{
  "구어체 (Colloquial)": [
    {
      "korean": "내 말이",
      "english": "'That's what I'm saying.' Emphatic agreement, confirming that someone just expressed exactly what you think.",
      "example": "\"요즘 물가가 너무 올랐어.\" \"내 말이. 장 보러 갈 때마다 깜짝 놀라.\"",
      "example_en": "\"Prices have gone up so much lately.\" \"That's what I'm saying. I'm shocked every time I go grocery shopping.\""
    },
    {
      "korean": "당연하지",
      "english": "'Of course' or 'obviously.' Emphatic affirmation that something goes without saying.",
      "example": "\"이번에 도와줄 수 있어?\" \"당연하지, 말만 해.\"",
      "example_en": "\"Can you help me with this?\" \"Of course — just say the word.\""
    },
    {
      "korean": "누가 아니래",
      "english": "'Tell me about it' or 'who would disagree.' Strong agreement implying the point is so obvious nobody could argue.",
      "example": "\"이 날씨에 일하러 가기 싫다.\" \"누가 아니래, 나도 집에서 쉬고 싶어.\"",
      "example_en": "\"I don't want to go to work in this weather.\" \"Tell me about it — I want to stay home and rest too.\""
    },
    {
      "korean": "인정",
      "english": "'Fair point' or 'acknowledged.' Casual one-word concession validating someone's argument. Popular among younger speakers.",
      "example": "\"이 드라마 연출이 진짜 좋지 않아?\" \"인정. 특히 마지막 장면은 소름 돋았어.\"",
      "example_en": "\"Isn't the directing in this drama really good?\" \"Fair point. The last scene especially gave me chills.\""
    },
    {
      "korean": "완전 공감",
      "english": "'I totally relate.' Expresses deep agreement or shared feeling about a situation or opinion.",
      "example": "\"나이 들수록 시간이 빨리 간다는 말, 진짜 맞는 것 같아.\" \"완전 공감. 올해도 벌써 반이 지났잖아.\"",
      "example_en": "\"The saying that time flies faster as you age seems really true.\" \"I totally relate. Half of this year is already gone.\""
    },
    {
      "korean": "그치",
      "english": "'Right?' Casual contraction of 그렇지, used to seek or express quick agreement in conversation.",
      "example": "\"여기 분위기 진짜 좋다, 그치?\" \"응, 다음에 또 오자.\"",
      "example_en": "\"The atmosphere here is really great, right?\" \"Yeah, let's come again next time.\""
    },
    {
      "korean": "설마",
      "english": "'Surely not' or 'no way.' Expresses disbelief or reluctance to accept that something could possibly be true.",
      "example": "설마 걔가 진짜로 회사를 옮긴 거야? 농담인 줄 알았는데.",
      "example_en": "You're not telling me he actually switched companies? I thought it was a joke."
    },
    {
      "korean": "별로인데",
      "english": "'Not really' or 'I'm not into it.' Mild, casual way to express that something doesn't appeal to you.",
      "example": "\"이 식당 어때?\" \"음, 별로인데. 지난번에 왔을 때 맛이 좀 그랬어.\"",
      "example_en": "\"How about this restaurant?\" \"Hmm, not really. The taste was a bit off last time I came.\""
    },
    {
      "korean": "좀 아닌 것 같은데",
      "english": "'I don't think that's right' or 'that seems off.' Softened disagreement used to gently push back on an idea.",
      "example": "\"그냥 이대로 제출하면 안 될까?\" \"그건 좀 아닌 것 같은데, 한 번 더 검토하자.\"",
      "example_en": "\"Can't we just submit it as is?\" \"I don't think that's a good idea — let's review it one more time.\""
    },
    {
      "korean": "무슨 소리야",
      "english": "'What are you talking about?' Dismissive response when someone's statement seems nonsensical or off-base.",
      "example": "\"네가 잘못한 거 아니야?\" \"무슨 소리야, 나는 아무 관련 없어.\"",
      "example_en": "\"Wasn't it your fault?\" \"What are you talking about? I had nothing to do with it.\""
    },
    {
      "korean": "짜증 나",
      "english": "'I'm so annoyed' or 'this is irritating.' Direct expression of annoyance at a situation or person.",
      "example": "인터넷이 또 끊겼어. 진짜 짜증 나, 이번 달에만 벌써 세 번째야.",
      "example_en": "The internet went out again. I'm so annoyed — this is already the third time this month."
    },
    {
      "korean": "또야?",
      "english": "'Again?' or 'Not this again.' Exasperated reaction when an unwanted situation keeps repeating.",
      "example": "\"내일도 야근이래.\" \"또야? 이번 주만 벌써 네 번째잖아.\"",
      "example_en": "\"They said it's overtime again tomorrow.\" \"Again? That's already the fourth time just this week.\""
    },
    {
      "korean": "환장하겠다",
      "english": "'I'm going to lose my mind.' Expresses extreme frustration or the feeling of being pushed past one's limit.",
      "example": "서류를 세 번이나 다시 쓰라고 해. 환장하겠다, 진짜.",
      "example_en": "They're making me rewrite the documents for the third time. I'm going to lose my mind, seriously."
    },
    {
      "korean": "진이 빠지다",
      "english": "'I'm completely drained.' Describes being physically or mentally exhausted from a tedious or taxing ordeal.",
      "example": "이사 짐 다 옮기고 나니까 진이 다 빠졌어. 손가락 하나 까딱 못 하겠어.",
      "example_en": "After moving all the boxes, I'm completely drained. I can't lift a finger."
    },
    {
      "korean": "그만 좀 해",
      "english": "'Stop it already' or 'cut it out.' Tells someone to stop doing something repetitive or annoying.",
      "example": "자꾸 같은 얘기 반복하지 마. 그만 좀 해, 나도 알고 있다고.",
      "example_en": "Stop repeating the same thing. Cut it out already — I know."
    },
    {
      "korean": "한숨밖에 안 나온다",
      "english": "'All I can do is sigh.' Resigned frustration when a situation is so bad there is nothing left to say.",
      "example": "다음 달 카드값 보고 한숨밖에 안 나왔어. 어디서부터 줄여야 할지 모르겠어.",
      "example_en": "When I saw next month's credit card bill, all I could do was sigh. I don't know where to start cutting back."
    },
    {
      "korean": "끝이 안 보인다",
      "english": "'There's no end in sight.' Expresses frustration with a task or situation that seems to go on forever.",
      "example": "이 보고서 작성 끝이 안 보인다. 쓰면 쓸수록 추가 자료가 필요해.",
      "example_en": "There's no end in sight with this report. The more I write, the more additional materials I need."
    },
    {
      "korean": "골치 아프다",
      "english": "'It's a headache' or 'what a pain.' Describes something troublesome and difficult to resolve.",
      "example": "윗집 소음 문제 때문에 골치 아파. 말해도 안 듣거든.",
      "example_en": "The noise from the upstairs neighbor is such a headache. They don't listen even when I talk to them."
    },
    {
      "korean": "될 대로 되라",
      "english": "'Whatever happens, happens.' Resigned expression of giving up trying to control a frustrating situation.",
      "example": "더 이상 손 쓸 게 없어. 될 대로 되라, 나는 최선을 다했어.",
      "example_en": "There's nothing more I can do. Whatever happens, happens — I did my best."
    },
    {
      "korean": "어휴",
      "english": "Exasperated sigh expressing weariness, annoyance, or mild disgust. Heavier and more drawn-out than a simple 'ah.'",
      "example": "어휴, 이 더위에 에어컨도 고장이야? 참 되는 일이 하나도 없다.",
      "example_en": "Ugh, the AC is broken in this heat? Nothing is going right."
    },
    {
      "korean": "역시 너밖에 없다",
      "english": "'No one else but you could do this.' Strong compliment expressing that someone is uniquely skilled or reliable.",
      "example": "이렇게 빨리 해결해 줄 줄은 몰랐어. 역시 너밖에 없다.",
      "example_en": "I didn't expect you to solve it this fast. No one else could've done it but you."
    },
    {
      "korean": "쩐다",
      "english": "'That's insane' or 'that's incredible.' Slang expressing strong admiration for something impressive.",
      "example": "혼자서 이 프로젝트 다 한 거야? 야, 진짜 쩐다.",
      "example_en": "You did this whole project by yourself? Dude, that's incredible."
    },
    {
      "korean": "너답다",
      "english": "'That's so you.' Compliment acknowledging that someone's action perfectly reflects their best qualities.",
      "example": "바쁜데도 남 도와주는 거 보니까 역시 너답다.",
      "example_en": "Seeing you help others even when you're busy — that's so you."
    },
    {
      "korean": "센스 있다",
      "english": "'You've got great sense.' Praises someone's perceptiveness, good taste, or situational awareness.",
      "example": "선물 고르는 거 진짜 센스 있다. 내가 딱 갖고 싶었던 건데.",
      "example_en": "You've got such great taste in picking gifts. This is exactly what I wanted."
    },
    {
      "korean": "별걸 다 잘하네",
      "english": "'You're good at everything.' Admiring exclamation when someone shows unexpected talent in yet another area.",
      "example": "그림도 이렇게 잘 그려? 별걸 다 잘하네, 진짜.",
      "example_en": "You draw this well too? You're seriously good at everything."
    },
    {
      "korean": "해낼 줄 알았어",
      "english": "'I knew you'd pull it off.' Expression of confidence in someone, said after they succeed at something.",
      "example": "합격한 거 축하해! 네가 해낼 줄 알았어, 한 번도 의심 안 했어.",
      "example_en": "Congratulations on passing! I knew you'd pull it off — I never doubted you."
    },
    {
      "korean": "좀 치는데",
      "english": "'You're pretty good at this.' Understated, playful compliment implying someone is actually very skilled.",
      "example": "당구 처음이라며? 좀 치는데? 완전 거짓말이지.",
      "example_en": "You said this was your first time playing billiards? You're pretty good — you're totally lying."
    },
    {
      "korean": "니가 하면 다르다",
      "english": "'It's different when you do it.' Compliment that someone brings a special quality or skill that elevates the result.",
      "example": "같은 레시피인데 니가 하면 다르다. 훨씬 맛있어.",
      "example_en": "It's the same recipe, but it's different when you make it. It's way more delicious."
    },
    {
      "korean": "포기하기엔 아깝다",
      "english": "'It'd be a waste to give up now.' Encouragement urging someone to keep going because they have already invested so much.",
      "example": "여기서 그만두려고? 이만큼 했는데 포기하기엔 아깝다. 조금만 더 힘내 봐.",
      "example_en": "You're going to quit here? After coming this far, it'd be a waste to give up. Push through just a bit more."
    },
    {
      "korean": "어떻게 그런 생각을 했어",
      "english": "'How did you even come up with that?' Expresses admiration for someone's unexpected creativity or cleverness.",
      "example": "이 아이디어 진짜 기발하다. 어떻게 그런 생각을 했어?",
      "example_en": "This idea is really brilliant. How did you even come up with that?"
    },
    {
      "korean": "그래서 말인데",
      "english": "'So, about that...' Transition phrase used to segue from casual talk to the real point or a favor you want to ask.",
      "example": "그래서 말인데, 혹시 이번 주 토요일에 차 좀 빌려줄 수 있어?",
      "example_en": "So about that... could you maybe lend me your car this Saturday?"
    },
    {
      "korean": "말 나온 김에",
      "english": "'Since we're on the topic' or 'while we're at it.' Brings up something related to the current subject.",
      "example": "말 나온 김에 하나만 더 얘기할게. 다음 달 회비 인상 건도 논의해야 해.",
      "example_en": "Since we're on the topic, let me bring up one more thing. We need to discuss the fee increase next month."
    },
    {
      "korean": "근데 진짜",
      "english": "'But seriously though.' Shifts to a more earnest or important point within a casual conversation.",
      "example": "근데 진짜, 너 요즘 살 많이 빠진 것 같아. 무슨 비결이야?",
      "example_en": "But seriously, you look like you've lost a lot of weight lately. What's your secret?"
    },
    {
      "korean": "그건 둘째 치고",
      "english": "'Setting that aside' or 'that's secondary.' Dismisses one point to redirect attention to something more urgent.",
      "example": "돈은 그건 둘째 치고, 시간이 부족한 게 더 큰 문제야.",
      "example_en": "Money aside, the bigger problem is that we don't have enough time."
    },
    {
      "korean": "어쨌든",
      "english": "'Anyway' or 'in any case.' Wraps up a tangent or debate and refocuses the conversation on the main point.",
      "example": "이유야 어쨌든, 결과적으로 잘 됐으니 됐지 뭐.",
      "example_en": "Whatever the reason, it worked out in the end, so it's fine."
    },
    {
      "korean": "뭐냐면",
      "english": "'The thing is' or 'what I mean is.' Clarifying preface before explaining a point more precisely.",
      "example": "내가 하고 싶은 말이 뭐냐면, 이번 기회를 놓치면 안 된다는 거야.",
      "example_en": "What I'm trying to say is that we can't afford to miss this opportunity."
    },
    {
      "korean": "아무튼",
      "english": "'At any rate' or 'anyway.' Quick conversational wrap-up or pivot, slightly more casual than 어쨌든.",
      "example": "아무튼 결론은 내일까지 끝내야 한다는 거지? 알겠어, 해 볼게.",
      "example_en": "At any rate, the bottom line is it needs to be done by tomorrow, right? Got it, I'll try."
    },
    {
      "korean": "다름이 아니라",
      "english": "'The reason I'm bringing this up is...' Polite preface before stating the real purpose of a conversation or call.",
      "example": "전화한 건 다름이 아니라, 주말에 도움이 좀 필요해서.",
      "example_en": "The reason I'm calling is that I need some help this weekend."
    },
    {
      "korean": "딴 얘기지만",
      "english": "'This is off-topic, but...' Signals a pivot to a completely unrelated subject mid-conversation.",
      "example": "딴 얘기지만, 너 아까 말한 그 책 제목이 뭐였어? 갑자기 생각났어.",
      "example_en": "This is off-topic, but what was the title of that book you mentioned earlier? It just popped into my head."
    },
    {
      "korean": "그게 말이야",
      "english": "'So here's the thing.' Introduces a point you have been building up to or hesitating to say.",
      "example": "그게 말이야, 사실 나 다음 달에 이직하려고.",
      "example_en": "So here's the thing — actually, I'm planning to change jobs next month."
    }
  ]
}
