{
  "주제별 단어 — 스포츠 (Topic: Sports)": [
    {
      "korean": "경기",
      "english": "game; match; competition",
      "example": "오늘 경기에서 우리 팀이 연장전 끝에 극적으로 역전승을 거뒀다.",
      "example_en": "In today's match, our team pulled off a dramatic comeback victory at the end of overtime."
    },
    {
      "korean": "예선",
      "english": "preliminary round; qualifier",
      "example": "예선에서 탈락하면 본선에 진출할 기회조차 없다.",
      "example_en": "If you get eliminated in the qualifiers, you don't even get a chance to advance to the main round."
    },
    {
      "korean": "결승",
      "english": "finals; championship match",
      "example": "결승까지 올라온 두 팀 모두 이번 시즌 최고의 기량을 보여 줬다.",
      "example_en": "Both teams that made it to the finals showed the best performance of the season."
    },
    {
      "korean": "심판",
      "english": "referee; umpire",
      "example": "심판의 판정에 불복한 감독이 항의하다가 퇴장당했다.",
      "example_en": "The coach who protested the referee's call was ejected from the game."
    },
    {
      "korean": "승부",
      "english": "match outcome; contest; showdown",
      "example": "두 선수의 승부는 마지막 라운드까지 갈 정도로 팽팽했다.",
      "example_en": "The contest between the two athletes was so tight it went all the way to the final round."
    },
    {
      "korean": "역전",
      "english": "comeback; reversal (of the score)",
      "example": "후반 막판에 역전골을 넣으면서 경기장 분위기가 폭발했다.",
      "example_en": "The atmosphere in the stadium exploded when a comeback goal was scored late in the second half."
    },
    {
      "korean": "무승부",
      "english": "draw; tie",
      "example": "양 팀이 2대 2 무승부로 끝나서 승부차기로 넘어갔다.",
      "example_en": "The two teams ended in a 2-2 draw and went to a penalty shootout."
    },
    {
      "korean": "탈락",
      "english": "elimination; being knocked out",
      "example": "우승 후보였던 팀이 8강에서 조기 탈락해서 모두 충격을 받았다.",
      "example_en": "Everyone was shocked when the tournament favorite was eliminated early in the quarterfinals."
    },
    {
      "korean": "선발",
      "english": "starting lineup; selection (for a team)",
      "example": "부상에서 복귀한 선수가 드디어 선발 명단에 이름을 올렸다.",
      "example_en": "The player who returned from injury finally made it onto the starting lineup."
    },
    {
      "korean": "관중",
      "english": "spectators; crowd; audience (at a sporting event)",
      "example": "5만 관중이 하나가 되어 응원하는 모습은 정말 감동적이었다.",
      "example_en": "The sight of 50,000 spectators cheering as one was truly moving."
    },
    {
      "korean": "체력",
      "english": "physical strength; stamina",
      "example": "체력이 바닥나면 아무리 기술이 좋아도 후반에 무너진다.",
      "example_en": "If your stamina runs out, no matter how good your technique is, you'll fall apart in the second half."
    },
    {
      "korean": "근력",
      "english": "muscular strength",
      "example": "하체 근력을 키우기 위해 매일 스쿼트를 200개씩 하고 있다.",
      "example_en": "I'm doing 200 squats every day to build lower-body muscular strength."
    },
    {
      "korean": "유산소 운동",
      "english": "aerobic exercise; cardio",
      "example": "유산소 운동을 꾸준히 해야 심폐 기능이 좋아진다.",
      "example_en": "You need to do aerobic exercise consistently for your cardiovascular function to improve."
    },
    {
      "korean": "무산소 운동",
      "english": "anaerobic exercise",
      "example": "단거리 달리기나 역도 같은 무산소 운동은 순간적인 폭발력을 길러 준다.",
      "example_en": "Anaerobic exercises like sprinting and weightlifting build explosive power."
    },
    {
      "korean": "부상",
      "english": "injury (sports injury)",
      "example": "무리한 훈련으로 무릎 부상을 입어 한 시즌을 통째로 쉬어야 했다.",
      "example_en": "I injured my knee from overtraining and had to sit out an entire season."
    },
    {
      "korean": "준비운동",
      "english": "warm-up exercise",
      "example": "준비운동을 충분히 하지 않으면 근육 파열 위험이 높아진다.",
      "example_en": "If you don't warm up sufficiently, the risk of muscle tears increases."
    },
    {
      "korean": "지구력",
      "english": "endurance; stamina",
      "example": "마라톤 선수에게는 무엇보다 지구력이 중요하다.",
      "example_en": "For a marathon runner, endurance is the most important thing."
    },
    {
      "korean": "감량",
      "english": "weight cutting; losing weight (for competition)",
      "example": "체급을 맞추기 위해 일주일 동안 극단적인 감량을 했다.",
      "example_en": "I went through extreme weight cutting for a week to make my weight class."
    },
    {
      "korean": "실전",
      "english": "actual competition; real game (as opposed to practice)",
      "example": "연습 때는 잘하는데 실전에만 나가면 긴장해서 실력 발휘를 못 한다.",
      "example_en": "I do well in practice, but whenever I go into a real game, I get nervous and can't perform."
    },
    {
      "korean": "정정당당하다",
      "english": "to be fair and square; to compete with integrity",
      "example": "어떤 결과가 나오든 정정당당하게 겨루자.",
      "example_en": "Whatever the result, let's compete fair and square."
    },
    {
      "korean": "패스",
      "english": "pass (in team sports)",
      "example": "결정적인 순간에 정확한 패스가 연결되면서 골이 터졌다.",
      "example_en": "A precise pass connected at the decisive moment, resulting in a goal."
    },
    {
      "korean": "수비",
      "english": "defense (in sports)",
      "example": "수비가 흔들리면 아무리 공격을 잘해도 경기를 이길 수 없다.",
      "example_en": "No matter how good your offense is, you can't win the game if your defense collapses."
    },
    {
      "korean": "공격",
      "english": "offense; attack (in sports)",
      "example": "후반 들어 공격 전술을 바꾸자 연속으로 득점에 성공했다.",
      "example_en": "After changing the offensive tactics in the second half, we scored consecutively."
    },
    {
      "korean": "팀워크",
      "english": "teamwork",
      "example": "개인 기량보다 팀워크가 잘 맞는 팀이 결국 우승을 차지했다.",
      "example_en": "In the end, the team with better teamwork rather than individual skill won the championship."
    },
    {
      "korean": "작전",
      "english": "strategy; game plan; tactics",
      "example": "감독이 타임아웃을 걸고 새로운 작전을 지시했다.",
      "example_en": "The coach called a timeout and gave instructions for a new strategy."
    },
    {
      "korean": "주장",
      "english": "team captain",
      "example": "주장이 선수들을 한데 모아 사기를 북돋아 주었다.",
      "example_en": "The team captain gathered the players together and boosted their morale."
    },
    {
      "korean": "교체",
      "english": "substitution (player swap)",
      "example": "체력이 떨어진 공격수를 빼고 신인 선수를 교체 투입했다.",
      "example_en": "They substituted out the tired striker and brought in a rookie player."
    },
    {
      "korean": "골대",
      "english": "goalpost; goal frame",
      "example": "슛이 골대를 맞고 나와서 아쉽게 득점에 실패했다.",
      "example_en": "The shot hit the goalpost and bounced out, narrowly missing a goal."
    },
    {
      "korean": "드리블",
      "english": "dribble (in soccer/basketball)",
      "example": "수비수 세 명을 드리블로 제치고 혼자서 골을 넣었다.",
      "example_en": "He dribbled past three defenders and scored a goal all by himself."
    },
    {
      "korean": "후보 선수",
      "english": "bench player; substitute",
      "example": "후보 선수로 들어가서도 결정적인 활약을 펼쳤다.",
      "example_en": "Even coming in as a substitute, he delivered a decisive performance."
    },
    {
      "korean": "육상",
      "english": "track and field; athletics",
      "example": "한국 육상 역사상 처음으로 100미터에서 10초 벽을 깼다.",
      "example_en": "For the first time in Korean track and field history, the 10-second barrier in the 100 meters was broken."
    },
    {
      "korean": "체조",
      "english": "gymnastics",
      "example": "체조 선수는 유연성과 균형 감각이 뛰어나야 한다.",
      "example_en": "A gymnast needs to have exceptional flexibility and balance."
    },
    {
      "korean": "양궁",
      "english": "archery",
      "example": "한국은 올림픽 양궁에서 늘 금메달을 휩쓸어 왔다.",
      "example_en": "Korea has always swept the gold medals in Olympic archery."
    },
    {
      "korean": "태권도",
      "english": "taekwondo",
      "example": "태권도는 한국에서 유래한 무술로 올림픽 정식 종목이다.",
      "example_en": "Taekwondo is a martial art originating from Korea and is an official Olympic sport."
    },
    {
      "korean": "유도",
      "english": "judo",
      "example": "유도에서는 상대의 힘을 이용해 넘기는 기술이 핵심이다.",
      "example_en": "In judo, the key is techniques that use the opponent's force to throw them."
    },
    {
      "korean": "펜싱",
      "english": "fencing",
      "example": "펜싱은 순간적인 판단력과 민첩성이 요구되는 종목이다.",
      "example_en": "Fencing is a sport that demands quick judgment and agility."
    },
    {
      "korean": "수영",
      "english": "swimming",
      "example": "수영은 전신 운동이라서 관절에 무리를 주지 않으면서도 근육을 고루 발달시킨다.",
      "example_en": "Swimming is a full-body exercise that develops muscles evenly without putting strain on the joints."
    },
    {
      "korean": "등산",
      "english": "mountain climbing; hiking",
      "example": "주말마다 등산을 다니면서 체력도 키우고 스트레스도 해소한다.",
      "example_en": "By hiking every weekend, I build stamina and relieve stress."
    },
    {
      "korean": "사격",
      "english": "shooting (sport)",
      "example": "사격은 호흡 조절과 집중력이 승패를 좌우하는 종목이다.",
      "example_en": "Shooting is a sport where breath control and concentration determine victory or defeat."
    },
    {
      "korean": "씨름",
      "english": "ssireum (Korean traditional wrestling)",
      "example": "씨름은 한국 전통 격투기로 명절 때 대회가 열리곤 했다.",
      "example_en": "Ssireum is a traditional Korean wrestling sport, and tournaments used to be held during holidays."
    }
  ]
}
