{
  "주제별 단어 — 역사 (Topic: History)": [
    {
      "korean": "삼국시대",
      "english": "Three Kingdoms period (57 BC - 668 AD); the era of Goguryeo, Baekje, and Silla",
      "example": "삼국시대에는 고구려, 백제, 신라가 한반도의 패권을 놓고 치열하게 경쟁했다.",
      "example_en": "During the Three Kingdoms period, Goguryeo, Baekje, and Silla fiercely competed for hegemony over the Korean peninsula."
    },
    {
      "korean": "고려",
      "english": "Goryeo dynasty (918-1392); the kingdom from which 'Korea' derives its name",
      "example": "고려는 불교를 국교로 삼아 찬란한 불교 문화를 꽃피웠다.",
      "example_en": "Goryeo adopted Buddhism as the state religion and cultivated a splendid Buddhist culture."
    },
    {
      "korean": "조선",
      "english": "Joseon dynasty (1392-1897); the last Korean dynasty, founded on Neo-Confucian ideals",
      "example": "조선은 유교적 이념을 바탕으로 500년 넘게 이어진 왕조였다.",
      "example_en": "Joseon was a dynasty that lasted over 500 years, founded on Confucian ideology."
    },
    {
      "korean": "임진왜란",
      "english": "Japanese invasions of Korea (1592-1598); Imjin War",
      "example": "임진왜란 때 이순신 장군이 이끄는 수군이 일본 해군을 격파했다.",
      "example_en": "During the Imjin War, the navy led by Admiral Yi Sun-sin defeated the Japanese naval forces."
    },
    {
      "korean": "병자호란",
      "english": "Manchu invasion of Korea (1636-1637); the Qing dynasty's attack on Joseon",
      "example": "병자호란의 패배 이후 조선은 청나라에 조공을 바쳐야 했다.",
      "example_en": "After the defeat in the Manchu invasion, Joseon had to pay tribute to the Qing dynasty."
    },
    {
      "korean": "일제강점기",
      "english": "Japanese colonial period (1910-1945); the era of Japan's occupation of Korea",
      "example": "일제강점기 동안 한국인들은 끊임없이 독립운동을 전개했다.",
      "example_en": "During the Japanese colonial period, Koreans ceaselessly carried out independence movements."
    },
    {
      "korean": "삼일운동",
      "english": "March 1st Movement (1919); a nationwide independence protest against Japanese rule",
      "example": "삼일운동은 비폭력 저항의 상징으로, 대한민국 임시정부 수립의 계기가 되었다.",
      "example_en": "The March 1st Movement, a symbol of nonviolent resistance, served as the catalyst for establishing the Provisional Government of Korea."
    },
    {
      "korean": "광복",
      "english": "liberation; national independence (specifically Korea's liberation from Japan on August 15, 1945)",
      "example": "1945년 8월 15일 광복을 맞이하여 온 국민이 환호했다.",
      "example_en": "On August 15, 1945, the entire nation celebrated upon achieving liberation."
    },
    {
      "korean": "한국전쟁",
      "english": "Korean War (1950-1953); the conflict between North and South Korea",
      "example": "한국전쟁으로 한반도는 폐허가 되었고, 이산가족의 비극이 시작되었다.",
      "example_en": "The Korean War reduced the peninsula to ruins and began the tragedy of separated families."
    },
    {
      "korean": "민주화운동",
      "english": "democratization movement; the series of pro-democracy struggles in South Korea (1960s-1980s)",
      "example": "1980년대 민주화운동의 희생 위에 오늘날의 대한민국 민주주의가 세워졌다.",
      "example_en": "Today's South Korean democracy was built upon the sacrifices of the 1980s democratization movement."
    },
    {
      "korean": "왕조",
      "english": "dynasty; a ruling family or succession of monarchs",
      "example": "한국 역사에서 가장 오래 지속된 왕조는 조선이다.",
      "example_en": "The longest-lasting dynasty in Korean history is Joseon."
    },
    {
      "korean": "봉건제도",
      "english": "feudal system; feudalism as a socio-political structure",
      "example": "유럽의 봉건제도와 조선의 신분 체계는 근본적으로 다른 구조였다.",
      "example_en": "European feudalism and Joseon's status system were fundamentally different structures."
    },
    {
      "korean": "쇄국정책",
      "english": "isolationist policy; closed-door policy restricting foreign contact",
      "example": "조선 후기의 쇄국정책은 서양 열강의 침투를 일시적으로 막았지만, 근대화를 지연시켰다.",
      "example_en": "The late Joseon isolationist policy temporarily blocked Western powers' encroachment but delayed modernization."
    },
    {
      "korean": "개화",
      "english": "enlightenment; modernization movement (specifically Korea's opening to the modern world in the late 19th century)",
      "example": "개화파는 서양 문물을 받아들여 나라를 근대화해야 한다고 주장했다.",
      "example_en": "The enlightenment faction argued that the country must be modernized by adopting Western civilization."
    },
    {
      "korean": "식민지",
      "english": "colony; a territory under foreign political control",
      "example": "한국이 식민지로 전락한 것은 국제 정세와 내부 분열이 복합적으로 작용한 결과였다.",
      "example_en": "Korea's fall into colonial status resulted from a combination of international circumstances and internal divisions."
    },
    {
      "korean": "유산",
      "english": "heritage; legacy left by previous generations",
      "example": "경주에는 신라 시대의 문화유산이 곳곳에 남아 있다.",
      "example_en": "Cultural heritage from the Silla period remains throughout Gyeongju."
    },
    {
      "korean": "사관",
      "english": "historical perspective; view of history (also: historian/official chronicler in traditional Korea)",
      "example": "같은 사건이라도 사관에 따라 전혀 다른 해석이 나올 수 있다.",
      "example_en": "Even the same event can yield entirely different interpretations depending on one's historical perspective."
    },
    {
      "korean": "사료",
      "english": "historical records; primary sources used in historical research",
      "example": "조선왕조실록은 조선 시대를 연구하는 데 가장 중요한 사료이다.",
      "example_en": "The Annals of the Joseon Dynasty are the most important historical records for studying the Joseon period."
    },
    {
      "korean": "기록유산",
      "english": "documentary heritage; written records recognized for cultural or historical value",
      "example": "한국은 훈민정음 해례본 등 세계적으로 인정받는 기록유산을 다수 보유하고 있다.",
      "example_en": "Korea possesses numerous documentary heritage items recognized worldwide, such as the Hunminjeongeum Haeryebon."
    },
    {
      "korean": "문명",
      "english": "civilization; an advanced stage of human social and cultural development",
      "example": "동아시아 문명은 한자 문화권을 중심으로 발전해 왔다.",
      "example_en": "East Asian civilization developed centered around the sphere of Chinese character culture."
    },
    {
      "korean": "수군",
      "english": "naval forces; the navy (specifically in pre-modern Korean military context)",
      "example": "이순신의 수군은 학익진 전법으로 왜군을 대파했다.",
      "example_en": "Yi Sun-sin's naval forces crushed the Japanese troops using the crane wing formation."
    },
    {
      "korean": "의병",
      "english": "righteous army; civilian volunteer militia rising against invaders",
      "example": "임진왜란 당시 전국 각지에서 의병이 일어나 일본군에 맞서 싸웠다.",
      "example_en": "During the Imjin War, righteous armies rose across the nation and fought against the Japanese forces."
    },
    {
      "korean": "성곽",
      "english": "fortress walls; castle walls or city walls used for defense",
      "example": "수원 화성은 정조 시대에 축조된 성곽으로, 동서양의 군사 기술이 결합되어 있다.",
      "example_en": "Suwon Hwaseong is a fortress built during King Jeongjo's reign, combining Eastern and Western military techniques."
    },
    {
      "korean": "거북선",
      "english": "turtle ship; the ironclad warship used by the Joseon navy",
      "example": "거북선은 세계 최초의 철갑선으로 알려져 있으며, 임진왜란에서 활약했다.",
      "example_en": "The turtle ship is known as the world's first ironclad vessel and played a crucial role in the Imjin War."
    },
    {
      "korean": "격전지",
      "english": "battlefield; site of a fierce battle",
      "example": "이 지역은 한국전쟁 당시의 격전지로, 수많은 병사가 목숨을 잃었다.",
      "example_en": "This area was a fierce battlefield during the Korean War, where countless soldiers lost their lives."
    },
    {
      "korean": "궁병",
      "english": "archer; a soldier specialized in archery",
      "example": "고구려의 궁병은 동아시아에서 가장 뛰어난 실력을 갖춘 것으로 유명했다.",
      "example_en": "Goguryeo's archers were renowned as the most skilled in East Asia."
    },
    {
      "korean": "군량",
      "english": "military provisions; food supplies for the army",
      "example": "전쟁이 장기화되자 군량 확보가 가장 시급한 문제로 떠올랐다.",
      "example_en": "As the war dragged on, securing military provisions became the most urgent problem."
    },
    {
      "korean": "함락",
      "english": "fall (of a fortress or city); capture by enemy forces",
      "example": "수도가 함락되자 왕실은 남쪽으로 피난을 떠났다.",
      "example_en": "When the capital fell, the royal court fled south for refuge."
    },
    {
      "korean": "주둔",
      "english": "stationing (of troops); military garrison or deployment",
      "example": "전쟁 이후에도 외국 군대가 이 지역에 주둔하고 있다.",
      "example_en": "Even after the war, foreign troops remain stationed in this area."
    },
    {
      "korean": "파병",
      "english": "troop dispatch; sending military forces abroad",
      "example": "한국은 베트남 전쟁에 대규모 파병을 결정하여 국내외적으로 논란이 되었다.",
      "example_en": "Korea's decision to dispatch large-scale troops to the Vietnam War sparked controversy both domestically and internationally."
    },
    {
      "korean": "양반",
      "english": "yangban; the ruling elite or aristocratic class of Joseon society",
      "example": "조선 시대 양반은 과거 시험을 통해 관직에 진출할 수 있는 특권 계층이었다.",
      "example_en": "In the Joseon era, yangban were the privileged class eligible to enter government service through the civil service examination."
    },
    {
      "korean": "천민",
      "english": "commoner of the lowest class; the lowest social stratum in traditional Korea (including slaves and outcasts)",
      "example": "조선 시대 천민은 사회적 차별을 받아 직업과 거주지가 제한되었다.",
      "example_en": "In the Joseon era, the lowest-class people faced social discrimination, with restrictions on occupations and residences."
    },
    {
      "korean": "과거제도",
      "english": "civil service examination system; the state exam for selecting government officials in Joseon",
      "example": "과거제도는 능력 위주의 관리 선발을 표방했지만, 실제로는 양반 중심으로 운영되었다.",
      "example_en": "The civil service exam system claimed to select officials by merit, but in practice it was operated around the yangban class."
    },
    {
      "korean": "세도정치",
      "english": "in-law politics; domination of state affairs by powerful consort families in late Joseon",
      "example": "세도정치 시기에는 왕의 외척이 권력을 독점하여 정치가 극도로 부패했다.",
      "example_en": "During the era of in-law politics, the king's maternal relatives monopolized power and politics became extremely corrupt."
    },
    {
      "korean": "항일",
      "english": "anti-Japanese; resistance against Japanese imperialism",
      "example": "항일 독립운동가들은 목숨을 걸고 조국의 자유를 위해 싸웠다.",
      "example_en": "Anti-Japanese independence activists risked their lives fighting for their homeland's freedom."
    },
    {
      "korean": "분단",
      "english": "division; the partition of the Korean peninsula into North and South",
      "example": "한반도의 분단은 70년 넘게 이어지고 있으며, 통일은 여전히 민족의 숙원이다.",
      "example_en": "The division of the Korean peninsula has lasted over 70 years, and reunification remains the nation's long-cherished wish."
    },
    {
      "korean": "군사정권",
      "english": "military regime; a government controlled by the armed forces through coups",
      "example": "1960년대부터 1980년대까지 한국은 군사정권 아래에서 경제 성장과 인권 탄압을 동시에 경험했다.",
      "example_en": "From the 1960s to the 1980s, Korea experienced both economic growth and human rights suppression under military regimes."
    },
    {
      "korean": "독립운동",
      "english": "independence movement; organized efforts to achieve national sovereignty from colonial rule",
      "example": "상하이에 설립된 대한민국 임시정부는 해외 독립운동의 구심점 역할을 했다.",
      "example_en": "The Provisional Government of Korea established in Shanghai served as the focal point of the overseas independence movement."
    },
    {
      "korean": "신분제",
      "english": "social status system; the hierarchical class system of traditional Korean society",
      "example": "갑오개혁으로 신분제가 공식적으로 폐지되었지만, 사회적 차별은 쉽게 사라지지 않았다.",
      "example_en": "The Gabo Reform officially abolished the social status system, but social discrimination did not easily disappear."
    },
    {
      "korean": "유배",
      "english": "exile; banishment to a remote region as political punishment in Joseon",
      "example": "정치적으로 패배한 관료들은 유배를 당해 오지에서 여생을 보내기도 했다.",
      "example_en": "Politically defeated officials were sometimes sent into exile to spend the rest of their lives in remote areas."
    }
  ]
}
