{
  "연어 (Collocations)": [
    {
      "korean": "논문을 발표하다",
      "english": "to present/publish a paper",
      "example": "교수님이 국제 학회에서 논문을 발표하고 큰 주목을 받았다.",
      "example_en": "The professor presented a paper at an international conference and received a lot of attention."
    },
    {
      "korean": "가설을 세우다",
      "english": "to formulate a hypothesis",
      "example": "실험에 앞서 먼저 명확한 가설을 세우는 것이 중요하다.",
      "example_en": "It's important to formulate a clear hypothesis before conducting the experiment."
    },
    {
      "korean": "자료를 수집하다",
      "english": "to collect data/materials",
      "example": "석사 논문을 위해 6개월간 현장에서 자료를 수집했다.",
      "example_en": "I spent six months collecting data in the field for my master's thesis."
    },
    {
      "korean": "분석을 실시하다",
      "english": "to conduct an analysis",
      "example": "설문 결과를 토대로 통계 분석을 실시한 결과 유의미한 차이가 나타났다.",
      "example_en": "After conducting a statistical analysis based on the survey results, a significant difference was found."
    },
    {
      "korean": "결과를 도출하다",
      "english": "to derive/draw results",
      "example": "다양한 변수를 고려하여 신뢰할 수 있는 결과를 도출해야 한다.",
      "example_en": "We need to derive reliable results by considering various variables."
    },
    {
      "korean": "연구를 수행하다",
      "english": "to conduct/carry out research",
      "example": "이 팀은 인공지능의 윤리적 문제에 대해 3년간 연구를 수행해 왔다.",
      "example_en": "This team has been conducting research on the ethical issues of AI for three years."
    },
    {
      "korean": "이론을 정립하다",
      "english": "to establish a theory",
      "example": "수십 년간의 연구 끝에 새로운 학문적 이론을 정립하는 데 성공했다.",
      "example_en": "After decades of research, they succeeded in establishing a new academic theory."
    },
    {
      "korean": "근거를 제시하다",
      "english": "to present evidence/grounds",
      "example": "주장만 하지 말고 구체적인 근거를 제시해 주세요.",
      "example_en": "Don't just make claims — please present concrete evidence."
    },
    {
      "korean": "학위를 취득하다",
      "english": "to obtain/earn a degree",
      "example": "직장을 다니면서 야간 대학원에서 석사 학위를 취득했다.",
      "example_en": "I earned my master's degree from an evening graduate program while working."
    },
    {
      "korean": "논점을 정리하다",
      "english": "to organize/summarize the key points of argument",
      "example": "회의가 길어지니까 한 번 논점을 정리하고 넘어가자.",
      "example_en": "The meeting is dragging on, so let's organize the key points and move on."
    },
    {
      "korean": "여론을 수렴하다",
      "english": "to gather/collect public opinion",
      "example": "정부는 정책을 시행하기 전에 충분히 여론을 수렴해야 한다.",
      "example_en": "The government should sufficiently gather public opinion before implementing the policy."
    },
    {
      "korean": "법안을 통과시키다",
      "english": "to pass a bill/legislation",
      "example": "여야 합의 끝에 해당 법안을 통과시키는 데 성공했다.",
      "example_en": "After bipartisan agreement, they succeeded in passing the bill."
    },
    {
      "korean": "성명을 발표하다",
      "english": "to issue/release a statement",
      "example": "외교부가 긴급 성명을 발표하며 강력히 항의했다.",
      "example_en": "The Ministry of Foreign Affairs issued an emergency statement and protested strongly."
    },
    {
      "korean": "혐의를 받다",
      "english": "to be charged with; to be under suspicion of",
      "example": "그는 횡령 혐의를 받고 현재 검찰 조사를 받고 있다.",
      "example_en": "He is under suspicion of embezzlement and is currently being investigated by prosecutors."
    },
    {
      "korean": "논란을 일으키다",
      "english": "to stir up/cause controversy",
      "example": "장관의 발언이 큰 논란을 일으키면서 사퇴 요구가 빗발쳤다.",
      "example_en": "The minister's remarks stirred up major controversy, prompting a flood of calls for resignation."
    },
    {
      "korean": "합의를 이루다",
      "english": "to reach an agreement/consensus",
      "example": "양측이 밤새 협상한 끝에 드디어 합의를 이루었다.",
      "example_en": "After negotiating through the night, both sides finally reached an agreement."
    },
    {
      "korean": "제재를 가하다",
      "english": "to impose sanctions/penalties",
      "example": "국제 사회가 핵 개발에 대해 강력한 제재를 가하기로 결정했다.",
      "example_en": "The international community decided to impose strong sanctions on nuclear development."
    },
    {
      "korean": "수사에 착수하다",
      "english": "to launch/commence an investigation",
      "example": "경찰이 내부 제보를 받고 즉시 수사에 착수했다.",
      "example_en": "The police received an internal tip and immediately launched an investigation."
    },
    {
      "korean": "피해를 입다",
      "english": "to suffer damage/harm",
      "example": "태풍으로 해안 지역 주민들이 큰 피해를 입었다.",
      "example_en": "Residents of coastal areas suffered significant damage from the typhoon."
    },
    {
      "korean": "입장을 밝히다",
      "english": "to state/clarify one's position",
      "example": "회사 측은 기자회견에서 이번 사건에 대한 공식 입장을 밝혔다.",
      "example_en": "The company stated its official position on the incident at the press conference."
    },
    {
      "korean": "잠을 설치다",
      "english": "to have a restless night; to sleep fitfully",
      "example": "내일 면접 생각에 밤새 잠을 설쳤다.",
      "example_en": "I had a restless night thinking about tomorrow's interview."
    },
    {
      "korean": "살림을 꾸리다",
      "english": "to set up/manage a household",
      "example": "결혼하고 처음으로 둘이서 살림을 꾸리는 게 쉽지 않았다.",
      "example_en": "Setting up a household together for the first time after getting married wasn't easy."
    },
    {
      "korean": "눈치를 보다",
      "english": "to read the room; to gauge someone's mood",
      "example": "상사 눈치를 보느라 하고 싶은 말도 못 했다.",
      "example_en": "I was so busy reading my boss's mood that I couldn't say what I wanted to."
    },
    {
      "korean": "잔소리를 하다",
      "english": "to nag; to lecture someone repeatedly",
      "example": "엄마가 매일 방 정리하라고 잔소리를 하셔서 귀가 아프다.",
      "example_en": "My mom nags me every day to clean my room — my ears are ringing."
    },
    {
      "korean": "바람을 쐬다",
      "english": "to get some fresh air; to step outside for air",
      "example": "머리가 복잡할 때는 밖에 나가서 바람을 쐬는 게 최고다.",
      "example_en": "When my head is full of thoughts, the best thing to do is go outside and get some fresh air."
    },
    {
      "korean": "한턱을 내다",
      "english": "to treat someone to a meal/drinks",
      "example": "승진 축하한다! 오늘 한턱 내는 거지?",
      "example_en": "Congratulations on the promotion! You're treating us today, right?"
    },
    {
      "korean": "짐을 꾸리다",
      "english": "to pack one's belongings/bags",
      "example": "출장 전날 밤에 허겁지겁 짐을 꾸렸다.",
      "example_en": "I hurriedly packed my bags the night before the business trip."
    },
    {
      "korean": "시간을 때우다",
      "english": "to kill time; to while away the time",
      "example": "비행기 시간까지 두 시간 남아서 카페에서 시간을 때웠다.",
      "example_en": "I had two hours until my flight, so I killed time at a cafe."
    },
    {
      "korean": "입맛이 돌다",
      "english": "to get one's appetite back; to feel hungry again",
      "example": "며칠째 아팠는데 오늘은 좀 나아져서 입맛이 돈다.",
      "example_en": "I was sick for days, but today I feel a bit better and my appetite is coming back."
    },
    {
      "korean": "빚을 갚다",
      "english": "to pay off a debt",
      "example": "학자금 대출 빚을 갚는 데만 5년이 걸렸다.",
      "example_en": "It took five years just to pay off my student loan debt."
    },
    {
      "korean": "의미를 부여하다",
      "english": "to assign/attach meaning to",
      "example": "사소한 일상에도 의미를 부여하면 삶이 더 풍요로워진다.",
      "example_en": "If you attach meaning even to trivial everyday moments, life becomes richer."
    },
    {
      "korean": "한계를 드러내다",
      "english": "to reveal/expose one's limits",
      "example": "기존 시스템이 급격한 수요 증가에 한계를 드러냈다.",
      "example_en": "The existing system revealed its limits in the face of a rapid surge in demand."
    },
    {
      "korean": "균형을 유지하다",
      "english": "to maintain balance",
      "example": "일과 삶의 균형을 유지하는 것이 요즘 직장인의 최대 과제다.",
      "example_en": "Maintaining a work-life balance is the biggest challenge for today's office workers."
    },
    {
      "korean": "본질을 파악하다",
      "english": "to grasp/understand the essence",
      "example": "겉모습에 속지 말고 문제의 본질을 파악하는 것이 중요하다.",
      "example_en": "Don't be fooled by appearances — it's important to grasp the essence of the problem."
    },
    {
      "korean": "영향을 미치다",
      "english": "to have an influence/impact on",
      "example": "어린 시절의 경험이 성인이 된 후에도 큰 영향을 미친다.",
      "example_en": "Childhood experiences have a significant influence even into adulthood."
    },
    {
      "korean": "변화를 꾀하다",
      "english": "to seek/attempt change",
      "example": "매출이 계속 떨어지자 경영진이 구조적인 변화를 꾀했다.",
      "example_en": "As sales kept declining, the management sought structural changes."
    },
    {
      "korean": "기대에 부응하다",
      "english": "to live up to expectations",
      "example": "국민의 기대에 부응하는 정책을 만들어야 한다.",
      "example_en": "We must create policies that live up to the people's expectations."
    },
    {
      "korean": "갈등을 빚다",
      "english": "to cause/create conflict",
      "example": "세대 간 가치관 차이가 가정 내에서 갈등을 빚는 경우가 많다.",
      "example_en": "Differences in values between generations often cause conflict within families."
    },
    {
      "korean": "소신을 지키다",
      "english": "to stick to one's convictions/principles",
      "example": "주변 압력에도 불구하고 끝까지 소신을 지킨 그녀가 대단하다.",
      "example_en": "It's impressive that she stuck to her convictions to the end despite the pressure around her."
    },
    {
      "korean": "가치를 인정하다",
      "english": "to acknowledge/recognize the value of",
      "example": "그동안 과소평가되었던 전통 공예의 가치를 인정하는 움직임이 커지고 있다.",
      "example_en": "There is a growing movement to recognize the value of traditional crafts that have long been undervalued."
    }
  ]
}
