{
  "주제별 단어 — 전통문화 (Topic: Traditional Korean Culture)": [
    {
      "korean": "깃",
      "english": "collar edge; strip of fabric at a garment's edge",
      "example": "저고리의 깃을 정성스럽게 감싸는 것이 한복 제작의 핵심이다.",
      "example_en": "Carefully wrapping the collar edge is essential to hanbok construction."
    },
    {
      "korean": "동정",
      "english": "white collar piece worn under jeogori (short jacket)",
      "example": "어머니는 빨간 저고리 위에 흰 동정을 깔끔하게 얹으셨다.",
      "example_en": "Mother placed the white collar piece neatly over the red jacket."
    },
    {
      "korean": "고름",
      "english": "ribbon ties that fasten the jeogori and chima",
      "example": "결혼식날 신부의 화려한 고름이 시선을 사로잡았다.",
      "example_en": "The bride's ornate ribbon ties captured everyone's attention on the wedding day."
    },
    {
      "korean": "치마",
      "english": "skirt; chima (Korean traditional skirt)",
      "example": "전통 치마는 여러 겹의 천을 사용해 부피감 있는 실루엣을 만든다.",
      "example_en": "Traditional skirts use multiple layers of fabric to create a voluminous silhouette."
    },
    {
      "korean": "저고리",
      "english": "jeogori; short fitted jacket worn as the upper part of hanbok",
      "example": "올해 설날을 위해 새 저고리를 맞춰 입기로 했다.",
      "example_en": "I decided to have a new jacket tailored for Lunar New Year this year."
    },
    {
      "korean": "수채",
      "english": "decorative embroidery or beadwork on hanbok",
      "example": "웨딩 한복의 수채는 금사와 진주로 화려하게 수놓여 있었다.",
      "example_en": "The wedding hanbok's embroidery was elaborately stitched with gold thread and pearls."
    },
    {
      "korean": "가야금",
      "english": "gayageum; traditional Korean zither-like instrument",
      "example": "국악 공연에서 가야금의 부드러운 음색이 관객들을 감동시켰다.",
      "example_en": "The gayageum's soft timbre moved the audience at the traditional music performance."
    },
    {
      "korean": "판소리",
      "english": "pansori; narrative singing style combining music and speech",
      "example": "판소리는 여러 시간에 걸쳐 펼쳐지는 이야기 중심의 예술이다.",
      "example_en": "Pansori is a narrative-centered art form that unfolds over several hours."
    },
    {
      "korean": "사물놀이",
      "english": "samulnori; traditional percussion quartet using drums and gongs",
      "example": "사물놀이 팀의 역동적인 연주가 축제의 분위기를 한껏 살렸다.",
      "example_en": "The samulnori team's dynamic performance brought the festival atmosphere to life."
    },
    {
      "korean": "장단",
      "english": "jangdan; rhythmic cycle or beat pattern in Korean traditional music",
      "example": "경험 많은 음악가는 미묘한 장단의 변화를 감지할 수 있다.",
      "example_en": "Experienced musicians can detect subtle changes in the rhythmic pattern."
    },
    {
      "korean": "법고",
      "english": "large traditional drum used in ritual and court music",
      "example": "궁궐의 법고 소리는 대신들에게 중요한 신호였다.",
      "example_en": "The sound of the ritual drum was an important signal to court officials."
    },
    {
      "korean": "아악",
      "english": "aak; court music tradition of Korea and East Asia",
      "example": "아악은 엄격한 규칙에 따라 전승되는 음악 전통이다.",
      "example_en": "Aak is a musical tradition passed down according to strict rules."
    },
    {
      "korean": "기와",
      "english": "roof tile used in traditional Korean architecture",
      "example": "고풍스러운 한옥의 기와지붕은 비가 오면 독특한 향기를 풍긴다.",
      "example_en": "The tile roof of a traditional Korean house releases a distinctive scent when it rains."
    },
    {
      "korean": "처마",
      "english": "eaves; roof overhang that protects the walls",
      "example": "넓은 처마 아래에 앉으면 소나기도 피할 수 있다.",
      "example_en": "Sitting under the broad eaves provides shelter from sudden rain."
    },
    {
      "korean": "대들보",
      "english": "main beam; the principal wooden structural beam",
      "example": "목수가 대들보 위에 정교한 문양을 조각했다.",
      "example_en": "The carpenter carved intricate patterns on the main beam."
    },
    {
      "korean": "온돌",
      "english": "ondol; underfloor heating system beneath traditional Korean floors",
      "example": "추운 겨울에도 온돌의 따뜻함으로 온 집이 포근했다.",
      "example_en": "Even in cold winters, the ondol's warmth kept the whole house cozy."
    },
    {
      "korean": "마루",
      "english": "wooden floor in a traditional Korean house",
      "example": "마루를 맨발로 걸으면 소나무의 향이 올라온다.",
      "example_en": "Walking barefoot on the wooden floor releases the scent of pine."
    },
    {
      "korean": "기둥",
      "english": "pillar; column that supports a traditional structure",
      "example": "시간이 지나면서 기둥들이 자연스럽게 휘어진다.",
      "example_en": "Over time, the pillars naturally curve and bend."
    },
    {
      "korean": "제사",
      "english": "jesa; ancestral rite performed to honor deceased family members",
      "example": "명절 때마다 제사를 지내는 것이 우리 가족의 전통이다.",
      "example_en": "It's our family tradition to perform ancestral rites during every holiday."
    },
    {
      "korean": "폐백",
      "english": "pyebaek; bride's formal greeting ceremony to groom's family",
      "example": "신부의 폐백은 한복 예식의 가장 우아로운 순간이다.",
      "example_en": "The bride's greeting is the most elegant moment of the hanbok ceremony."
    },
    {
      "korean": "함",
      "english": "ham; ornamental gift box exchanged during Korean wedding",
      "example": "화려한 함 안에는 신부의 예물들이 정중하게 담겨 있다.",
      "example_en": "Inside the ornate box are the bride's gifts arranged with great care."
    },
    {
      "korean": "혼례",
      "english": "honrye; wedding ceremony in the traditional Korean style",
      "example": "우리 부모님은 남산 한옥에서 아름다운 혼례를 올리셨다.",
      "example_en": "Our parents held a beautiful traditional wedding ceremony at a hanok on Namsan."
    },
    {
      "korean": "상례",
      "english": "sangrye; funeral rites and mourning practices",
      "example": "상례의 절차는 복잡하지만 조상에 대한 경의를 담고 있다.",
      "example_en": "Funeral rites are complex but express reverence for ancestors."
    },
    {
      "korean": "돌",
      "english": "dol; first birthday celebration, traditionally an important milestone",
      "example": "돌 때 아기가 쌓은 책의 높이로 똑똑함을 예측했다.",
      "example_en": "Traditionally, a baby's intelligence was predicted by how high they stacked books at their first birthday."
    },
    {
      "korean": "장담그기",
      "english": "making fermented soy paste and sauce from soybeans",
      "example": "할머니는 봄마다 장담그기를 하시며 여름 내내 햇빛에 말렸다.",
      "example_en": "Grandmother made fermented paste every spring and dried it in the sun all summer."
    },
    {
      "korean": "김장",
      "english": "kimjang; kimchi-making season, usually in late fall",
      "example": "온 동네 아주머니들이 함께 모여 김장을 하는 모습은 정겹다.",
      "example_en": "The sight of all the neighborhood women gathering together for kimchi-making is heartwarming."
    },
    {
      "korean": "담금",
      "english": "damgeum; process of pickling or fermenting; soaking",
      "example": "좋은 품질의 담금 장류는 최소 3년 이상 숙성되어야 한다.",
      "example_en": "High-quality fermented condiments must be aged for at least three years."
    },
    {
      "korean": "숙성",
      "english": "aging; maturation process that develops flavor and quality",
      "example": "간장의 숙성 과정을 거치면서 깊고 풍부한 맛이 생긴다.",
      "example_en": "Through the soy sauce aging process, it develops a deep and rich flavor."
    },
    {
      "korean": "윷놀이",
      "english": "yut nori; traditional board game played with four wooden sticks",
      "example": "명절이면 온 가족이 윷놀이를 하며 밤을 새운다.",
      "example_en": "During holidays, the whole family plays yut nori and stays up all night."
    },
    {
      "korean": "널뛰기",
      "english": "nol twigi; traditional seesaw jumping game for girls",
      "example": "고전 영화에서 본 여인들의 널뛰기는 우아함과 역동성을 동시에 보여준다.",
      "example_en": "The seesaw jumping of women seen in classic films shows both elegance and dynamism."
    },
    {
      "korean": "팽이",
      "english": "paengi; spinning top; traditional toy spun with a whip",
      "example": "팽이를 치는 기술은 손목의 정밀한 움직임을 요구한다.",
      "example_en": "The technique of spinning a top requires precise wrist movements."
    },
    {
      "korean": "서예",
      "english": "seoye; calligraphy; art of beautiful handwriting",
      "example": "서예의 기본은 붓으로 먹을 다루는 정중함과 절제이다.",
      "example_en": "The foundation of calligraphy is the reverence and restraint of handling ink with a brush."
    },
    {
      "korean": "먹",
      "english": "meok; ink stick used in traditional calligraphy and painting",
      "example": "고급 먹은 천연 재료로 만들어지며 향기도 우아하다.",
      "example_en": "High-quality ink is made from natural materials and has an elegant fragrance."
    },
    {
      "korean": "벼루",
      "english": "byeoru; inkstone used to grind ink with water",
      "example": "벼루의 재질과 모양에 따라 글씨의 품질까지 달라진다.",
      "example_en": "The quality of writing changes depending on the material and shape of the inkstone."
    },
    {
      "korean": "도자기",
      "english": "dojakgi; ceramics; pottery",
      "example": "조선시대 도자기는 그 순수한 아름다움으로 세계적으로 인정받는다.",
      "example_en": "Joseon-era pottery is recognized worldwide for its pure beauty."
    },
    {
      "korean": "청자",
      "english": "cheongja; celadon; pale green glazed pottery",
      "example": "청자의 비취색 같은 녹색은 자연에서 영감을 얻은 색이다.",
      "example_en": "Celadon's jade-like green color is inspired by nature."
    },
    {
      "korean": "한지",
      "english": "hanji; Korean mulberry paper, used for art and traditional crafts",
      "example": "한지의 질감은 부드러우면서도 강인한 특성을 동시에 지니고 있다.",
      "example_en": "Hanji's texture is simultaneously soft and strong."
    },
    {
      "korean": "깎아내기",
      "english": "carving; subtractive sculpting technique",
      "example": "목각 장인은 나무에 깎아내기로 섬세한 문양을 새긴다.",
      "example_en": "Master woodcarvers create delicate patterns through subtractive carving."
    },
    {
      "korean": "태극",
      "english": "taegeuk; yin-yang symbol representing cosmic balance",
      "example": "태극의 빨강과 파랑은 한국 국기의 핵심 요소이다.",
      "example_en": "The red and blue of the yin-yang are core elements of the Korean flag."
    },
    {
      "korean": "문양",
      "english": "munyang; pattern; design motif used in traditional decoration",
      "example": "한옥의 벽과 기둥에 새겨진 문양들은 각각 고유의 의미를 지니고 있다.",
      "example_en": "The patterns carved on hanok walls and pillars each have unique meanings."
    },
    {
      "korean": "무당",
      "english": "mudang; shaman; ritual specialist in Korean shamanism",
      "example": "무당의 굿은 마을 공동체의 정신적 건강을 지키는 역할을 했다.",
      "example_en": "A shaman's ritual served to protect the spiritual health of the village community."
    }
  ]
}
