{
  "고급 동사 (Advanced Verbs)": [
    {
      "korean": "추론하다",
      "english": "to infer; to deduce; to reason",
      "example": "주어진 단서만으로 범인의 동기를 추론하기는 쉽지 않았다.",
      "example_en": "It was not easy to infer the culprit's motive from the given clues alone."
    },
    {
      "korean": "간파하다",
      "english": "to see through; to penetrate; to discern the truth of",
      "example": "그녀는 상대방의 거짓말을 단번에 간파했다.",
      "example_en": "She saw through the other person's lie at once."
    },
    {
      "korean": "숙고하다",
      "english": "to deliberate; to ponder deeply; to give careful thought to",
      "example": "중대한 결정을 앞두고 며칠간 숙고한 끝에 사직서를 냈다.",
      "example_en": "After deliberating for days before a major decision, he submitted his resignation."
    },
    {
      "korean": "반추하다",
      "english": "to reflect on; to ruminate; to look back and reconsider",
      "example": "지난 실패를 반추하며 같은 실수를 되풀이하지 않겠다고 다짐했다.",
      "example_en": "Reflecting on past failures, she resolved not to repeat the same mistakes."
    },
    {
      "korean": "탐구하다",
      "english": "to explore; to investigate; to inquire deeply into",
      "example": "이 책은 인간 본성의 어두운 면을 깊이 탐구한다.",
      "example_en": "This book deeply explores the dark side of human nature."
    },
    {
      "korean": "사색하다",
      "english": "to contemplate; to meditate; to engage in deep thought",
      "example": "삶의 의미에 대해 홀로 사색하는 시간이 그에게는 꼭 필요했다.",
      "example_en": "He needed time alone to contemplate the meaning of life."
    },
    {
      "korean": "변별하다",
      "english": "to discern; to distinguish; to differentiate",
      "example": "진실과 거짓을 변별하는 능력은 비판적 사고의 핵심이다.",
      "example_en": "The ability to discern truth from falsehood is at the core of critical thinking."
    },
    {
      "korean": "착안하다",
      "english": "to conceive an idea from; to be inspired by; to hit upon",
      "example": "자연 현상에서 착안하여 혁신적인 소재를 개발했다.",
      "example_en": "Inspired by natural phenomena, they developed an innovative material."
    },
    {
      "korean": "응용하다",
      "english": "to apply (knowledge or theory); to put into practice",
      "example": "대학에서 배운 이론을 실무에 응용하는 것은 별개의 문제이다.",
      "example_en": "Applying theories learned in college to actual work is a separate matter entirely."
    },
    {
      "korean": "유추하다",
      "english": "to analogize; to infer by analogy; to extrapolate",
      "example": "과거 사례로부터 유추하면 이번에도 비슷한 결과가 나올 가능성이 높다.",
      "example_en": "Extrapolating from past cases, there is a high chance of a similar outcome this time."
    },
    {
      "korean": "사무치다",
      "english": "to pierce one's heart; to cut deep emotionally; to be heartrending",
      "example": "고향을 떠난 지 십 년이 지나자 그리움이 뼛속까지 사무쳤다.",
      "example_en": "After ten years away from home, longing pierced him to the bone."
    },
    {
      "korean": "자책하다",
      "english": "to blame oneself; to reproach oneself; to feel guilty",
      "example": "친구를 도와주지 못한 자신을 끊임없이 자책했다.",
      "example_en": "He endlessly blamed himself for not being able to help his friend."
    },
    {
      "korean": "분개하다",
      "english": "to be indignant; to be outraged; to burn with righteous anger",
      "example": "시민들은 권력자의 부정부패에 분개하여 거리로 나섰다.",
      "example_en": "Citizens, outraged by the corruption of those in power, took to the streets."
    },
    {
      "korean": "상심하다",
      "english": "to be deeply hurt; to be heartbroken; to be crestfallen",
      "example": "오랜 연인과의 이별에 크게 상심하여 한동안 아무것도 할 수 없었다.",
      "example_en": "Deeply heartbroken by the breakup with his long-time partner, he couldn't do anything for a while."
    },
    {
      "korean": "격앙되다",
      "english": "to become agitated; to get worked up; to be inflamed",
      "example": "토론이 진행될수록 양측의 감정이 격앙되어 고성이 오갔다.",
      "example_en": "As the debate progressed, emotions on both sides became inflamed and voices were raised."
    },
    {
      "korean": "한탄하다",
      "english": "to lament; to deplore; to bemoan",
      "example": "세상이 각박해진 것을 한탄하며 옛 시절을 그리워했다.",
      "example_en": "He lamented how harsh the world had become and longed for the old days."
    },
    {
      "korean": "경외하다",
      "english": "to revere; to stand in awe of; to hold in deep respect",
      "example": "그의 학문적 업적 앞에서 누구나 경외하지 않을 수 없었다.",
      "example_en": "No one could help but stand in awe before his academic achievements."
    },
    {
      "korean": "매료되다",
      "english": "to be captivated; to be fascinated; to be utterly charmed",
      "example": "처음 한국에 왔을 때 전통 음악의 깊은 울림에 완전히 매료되었다.",
      "example_en": "When I first came to Korea, I was completely captivated by the deep resonance of traditional music."
    },
    {
      "korean": "통곡하다",
      "english": "to wail; to cry out in grief; to weep bitterly",
      "example": "장례식장에서 유가족들이 통곡하는 소리가 끊이지 않았다.",
      "example_en": "The sound of the bereaved family wailing at the funeral hall never ceased."
    },
    {
      "korean": "감격하다",
      "english": "to be deeply moved; to be overwhelmed with emotion",
      "example": "수십 년 만에 고향 땅을 밟자 감격하여 눈물이 쏟아졌다.",
      "example_en": "Upon setting foot on his homeland after decades, he was so deeply moved that tears poured down."
    },
    {
      "korean": "관통하다",
      "english": "to penetrate; to pierce through; to run through",
      "example": "터널이 산맥을 관통하여 양쪽 도시의 이동 시간이 절반으로 줄었다.",
      "example_en": "The tunnel pierced through the mountain range, cutting travel time between the two cities in half."
    },
    {
      "korean": "봉쇄하다",
      "english": "to blockade; to seal off; to lock down",
      "example": "경찰이 시위 현장 주변 도로를 전면 봉쇄했다.",
      "example_en": "Police completely sealed off the roads around the protest site."
    },
    {
      "korean": "강탈하다",
      "english": "to seize by force; to plunder; to rob",
      "example": "식민 지배 세력은 현지인의 토지와 자원을 강탈했다.",
      "example_en": "The colonial rulers seized the locals' land and resources by force."
    },
    {
      "korean": "질주하다",
      "english": "to sprint; to dash; to race at full speed",
      "example": "결승선을 향해 질주하는 선수의 표정에는 비장함이 서려 있었다.",
      "example_en": "The face of the athlete sprinting toward the finish line was filled with fierce determination."
    },
    {
      "korean": "난무하다",
      "english": "to run rampant; to fly about in chaos; to swirl wildly",
      "example": "근거 없는 소문이 온라인에서 난무하여 사회적 혼란을 부추겼다.",
      "example_en": "Groundless rumors ran rampant online, fueling social chaos."
    },
    {
      "korean": "유린하다",
      "english": "to trample on; to violate; to desecrate",
      "example": "독재 정권은 국민의 기본권을 조직적으로 유린했다.",
      "example_en": "The dictatorship systematically trampled on the people's fundamental rights."
    },
    {
      "korean": "해부하다",
      "english": "to dissect; to anatomize; to analyze in fine detail",
      "example": "평론가는 그 영화의 서사 구조를 날카롭게 해부했다.",
      "example_en": "The critic sharply dissected the film's narrative structure."
    },
    {
      "korean": "도약하다",
      "english": "to leap forward; to make a breakthrough; to take a big step",
      "example": "반도체 기술의 발전으로 한국 경제가 한 단계 더 도약했다.",
      "example_en": "Advances in semiconductor technology allowed the Korean economy to leap forward another level."
    },
    {
      "korean": "소탕하다",
      "english": "to wipe out; to mop up; to eradicate",
      "example": "군 당국은 산악 지대에 은거하던 잔여 세력을 소탕했다.",
      "example_en": "Military authorities wiped out the remaining forces hiding in the mountainous region."
    },
    {
      "korean": "천착하다",
      "english": "to delve deeply into; to dig into; to devote oneself to studying",
      "example": "그 학자는 평생 동아시아 고대사에 천착해 왔다.",
      "example_en": "That scholar has spent his entire life delving deeply into ancient East Asian history."
    },
    {
      "korean": "회유하다",
      "english": "to appease; to win over; to conciliate",
      "example": "정부는 강경 대응 대신 반대 세력을 회유하는 전략을 택했다.",
      "example_en": "Instead of a hardline response, the government chose a strategy of appeasing the opposition."
    },
    {
      "korean": "사주하다",
      "english": "to instigate; to put someone up to something; to abet",
      "example": "검찰은 배후에서 범행을 사주한 인물을 추적하고 있다.",
      "example_en": "The prosecution is tracking down the person who instigated the crime from behind the scenes."
    },
    {
      "korean": "매도하다",
      "english": "to denounce; to condemn; to vilify",
      "example": "언론이 확인도 없이 그를 범죄자로 매도하는 것은 부당하다.",
      "example_en": "It is unjust for the media to denounce him as a criminal without verification."
    },
    {
      "korean": "중재하다",
      "english": "to mediate; to arbitrate; to act as intermediary",
      "example": "양국 간의 분쟁을 중재하기 위해 유엔이 특사를 파견했다.",
      "example_en": "The UN dispatched a special envoy to mediate the dispute between the two countries."
    },
    {
      "korean": "포섭하다",
      "english": "to co-opt; to recruit to one's side; to bring into one's fold",
      "example": "야당은 무소속 의원들을 포섭하여 과반 의석을 확보하려 했다.",
      "example_en": "The opposition party tried to recruit independent lawmakers to secure a majority of seats."
    },
    {
      "korean": "옹호하다",
      "english": "to advocate; to defend; to champion",
      "example": "그녀는 소수자의 권리를 옹호하는 데 앞장서 왔다.",
      "example_en": "She has been at the forefront of advocating for minority rights."
    },
    {
      "korean": "참견하다",
      "english": "to meddle; to interfere; to butt in",
      "example": "남의 가정사에 함부로 참견하면 오히려 관계만 나빠진다.",
      "example_en": "If you carelessly meddle in someone else's family affairs, it only worsens the relationship."
    },
    {
      "korean": "응대하다",
      "english": "to attend to; to deal with; to respond to (a person or situation)",
      "example": "고객의 불만에 성의 있게 응대하는 것이 서비스업의 기본이다.",
      "example_en": "Sincerely attending to customer complaints is the foundation of the service industry."
    },
    {
      "korean": "순응하다",
      "english": "to conform; to comply; to adapt oneself to",
      "example": "변화하는 시대에 무조건 순응하기보다는 주체적으로 판단해야 한다.",
      "example_en": "Rather than blindly conforming to a changing era, one should make independent judgments."
    },
    {
      "korean": "견제하다",
      "english": "to keep in check; to restrain; to counterbalance",
      "example": "삼권분립은 권력 기관이 서로를 견제하도록 설계된 제도이다.",
      "example_en": "The separation of powers is a system designed so that branches of government keep each other in check."
    }
  ]
}
