{"주제별 단어 — 인구/사회문제 (Topic: Demographics & Social Issues)": [
  {
    "korean": "저출산",
    "english": "low birth rate",
    "example": "한국의 저출산 현상이 심각해져서 정부에서 다양한 정책을 추진하고 있다.",
    "example_en": "Korea's low birth rate issue has become serious, so the government is promoting various policies."
  },
  {
    "korean": "고령화",
    "english": "aging (of population)",
    "example": "전 세계적으로 고령화 추세가 가속화되고 있으며, 이는 많은 국가에서 정책 과제가 되고 있다.",
    "example_en": "The aging trend is accelerating globally, and it has become a policy issue in many countries."
  },
  {
    "korean": "인구감소",
    "english": "population decline",
    "example": "지난 10년간 지방의 인구감소로 인해 폐교가 증가했다.",
    "example_en": "Due to population decline in rural areas over the past decade, the number of closed schools has increased."
  },
  {
    "korean": "인구증가",
    "english": "population growth",
    "example": "개발도상국의 빠른 인구증가는 환경 문제를 야기하고 있다.",
    "example_en": "Rapid population growth in developing countries is causing environmental problems."
  },
  {
    "korean": "인구밀도",
    "english": "population density",
    "example": "서울의 인구밀도는 세계 주요 도시 중에서도 가장 높은 수준이다.",
    "example_en": "Seoul's population density is among the highest among major cities in the world."
  },
  {
    "korean": "도시화",
    "english": "urbanization",
    "example": "급속한 도시화로 인해 전통적인 농촌 문화가 사라지고 있다.",
    "example_en": "Traditional rural culture is disappearing due to rapid urbanization."
  },
  {
    "korean": "지역소멸",
    "english": "regional depopulation; regional extinction",
    "example": "지역소멸을 막기 위해 정부는 지방 일자리 창출에 집중하고 있다.",
    "example_en": "To prevent regional depopulation, the government is focusing on creating jobs in local areas."
  },
  {
    "korean": "시골 공동화",
    "english": "rural hollowing out",
    "example": "청년들이 도시로 나가면서 시골은 점점 공동화되고 있다.",
    "example_en": "As young people move to cities, rural areas are becoming increasingly hollowed out."
  },
  {
    "korean": "이민",
    "english": "immigration",
    "example": "최근 한국으로의 이민 수가 크게 증가하고 있다.",
    "example_en": "The number of immigrants to Korea has increased significantly recently."
  },
  {
    "korean": "이민자",
    "english": "immigrant",
    "example": "이민자들이 지역 경제에 어떤 영향을 미치는지 연구하는 것이 중요하다.",
    "example_en": "It is important to study what impact immigrants have on the local economy."
  },
  {
    "korean": "다문화가족",
    "english": "multicultural family",
    "example": "다문화가족의 자녀들은 한국 사회에서 여러 어려움을 겪고 있다.",
    "example_en": "Children of multicultural families face various difficulties in Korean society."
  },
  {
    "korean": "소득 불평등",
    "english": "income inequality",
    "example": "소득 불평등이 심해지면서 사회 갈등이 증가하고 있다.",
    "example_en": "As income inequality worsens, social conflict is increasing."
  },
  {
    "korean": "부의 양극화",
    "english": "wealth polarization",
    "example": "부의 양극화는 중산층의 붕괴로 이어질 수 있다.",
    "example_en": "Wealth polarization can lead to the collapse of the middle class."
  },
  {
    "korean": "주택위기",
    "english": "housing crisis",
    "example": "젊은 세대는 주택위기로 인해 결혼과 출산을 미루고 있다.",
    "example_en": "Young people are delaying marriage and childbirth due to the housing crisis."
  },
  {
    "korean": "전세 사기",
    "english": "jeonse (key money deposit) fraud",
    "example": "최근 전세 사기 사건들이 언론에 크게 보도되고 있다.",
    "example_en": "Recent jeonse fraud cases are being widely reported in the media."
  },
  {
    "korean": "청년실업",
    "english": "youth unemployment",
    "example": "청년실업 문제를 해결하기 위해 정부의 과감한 정책이 필요하다.",
    "example_en": "Bold government policies are needed to solve the youth unemployment problem."
  },
  {
    "korean": "비정규직",
    "english": "non-regular workers; precarious workers",
    "example": "비정규직 노동자들은 정규직보다 훨씬 불안정한 고용 조건을 갖고 있다.",
    "example_en": "Non-regular workers have much more unstable employment conditions than regular workers."
  },
  {
    "korean": "남녀평등",
    "english": "gender equality",
    "example": "직장에서의 남녀평등을 실현하기 위한 법적 조치가 강화되고 있다.",
    "example_en": "Legal measures to realize gender equality in the workplace are being strengthened."
  },
  {
    "korean": "일과 생활의 균형",
    "english": "work-life balance",
    "example": "선진국들은 일과 생활의 균형을 중요시하는 문화를 만들고 있다.",
    "example_en": "Advanced countries are creating a culture that values work-life balance."
  },
  {
    "korean": "디지털 격차",
    "english": "digital divide",
    "example": "고령층의 디지털 격차 해소는 사회 포용의 중요한 과제이다.",
    "example_en": "Bridging the digital divide for the elderly is an important task for social inclusion."
  },
  {
    "korean": "사회안전망",
    "english": "social safety net",
    "example": "강한 사회안전망은 사회 구성원들의 불안감을 덜어준다.",
    "example_en": "A strong social safety net alleviates the anxiety of society's members."
  },
  {
    "korean": "빈곤",
    "english": "poverty",
    "example": "절대적 빈곤뿐만 아니라 상대적 빈곤도 중요한 사회 문제이다.",
    "example_en": "Not only absolute poverty but also relative poverty is an important social issue."
  },
  {
    "korean": "상대적 빈곤",
    "english": "relative poverty",
    "example": "상대적 빈곤층은 사회에서 박탈감을 느끼기 쉽다.",
    "example_en": "Those in relative poverty tend to feel a sense of deprivation in society."
  },
  {
    "korean": "중산층 붕괴",
    "english": "collapse of the middle class",
    "example": "중산층 붕괴로 인해 사회의 양극화가 심화되고 있다.",
    "example_en": "The collapse of the middle class is intensifying social polarization."
  },
  {
    "korean": "자살률",
    "english": "suicide rate",
    "example": "한국의 자살률은 OECD 국가 중에서도 높은 편이다.",
    "example_en": "Korea's suicide rate is relatively high among OECD countries."
  },
  {
    "korean": "출생률",
    "english": "birth rate",
    "example": "작년의 출생률이 역사적 최저치를 기록했다.",
    "example_en": "Last year's birth rate reached a historic low."
  },
  {
    "korean": "사망률",
    "english": "mortality rate",
    "example": "코로나19로 인해 일시적으로 사망률이 증가했다.",
    "example_en": "The mortality rate temporarily increased due to COVID-19."
  },
  {
    "korean": "기대수명",
    "english": "life expectancy",
    "example": "한국의 평균 기대수명은 지난 20년간 크게 증가했다.",
    "example_en": "Korea's average life expectancy has increased significantly over the past 20 years."
  },
  {
    "korean": "초고령화",
    "english": "super-aging",
    "example": "초고령화 사회에서는 노인 부양 문제가 핵심이다.",
    "example_en": "In a super-aged society, elderly care is the key issue."
  },
  {
    "korean": "일자리 창출",
    "english": "job creation",
    "example": "정부는 청년층을 위한 일자리 창출에 예산을 집중하고 있다.",
    "example_en": "The government is concentrating its budget on job creation for young people."
  },
  {
    "korean": "구조적 실업",
    "english": "structural unemployment",
    "example": "산업 변화로 인한 구조적 실업을 해결하기 위해 재교육이 필수적이다.",
    "example_en": "Retraining is essential to solve structural unemployment caused by industrial change."
  },
  {
    "korean": "세대 간 갈등",
    "english": "generational conflict",
    "example": "MZ 세대와 기성 세대의 가치관 차이로 인한 세대 간 갈등이 심하다.",
    "example_en": "Generational conflict due to differences in values between Gen MZ and older generations is severe."
  },
  {
    "korean": "동거",
    "english": "cohabitation",
    "example": "혼외 동거는 한국 사회에서 점점 보편화되고 있다.",
    "example_en": "Cohabitation without marriage is becoming increasingly common in Korean society."
  },
  {
    "korean": "미혼율",
    "english": "unmarried rate; rate of remaining single",
    "example": "급증하는 미혼율은 출생률 저하와 깊은 연관이 있다.",
    "example_en": "The rapidly increasing unmarried rate is closely related to the decline in birth rate."
  },
  {
    "korean": "만혼화",
    "english": "delayed marriage; trend toward marrying later",
    "example": "만혼화 추세로 인해 평균 결혼 나이가 계속 올라가고 있다.",
    "example_en": "Due to the trend of delayed marriage, the average age at marriage continues to rise."
  },
  {
    "korean": "여성경제활동",
    "english": "female labor force participation",
    "example": "여성경제활동 참여율을 높이려면 직장 문화 개선이 필요하다.",
    "example_en": "To increase female labor force participation, workplace culture improvement is needed."
  },
  {
    "korean": "육아휴직",
    "english": "parental leave; childcare leave",
    "example": "남성 육아휴직 사용률이 점점 증가하고 있다.",
    "example_en": "The rate of male parental leave usage is gradually increasing."
  },
  {
    "korean": "사회갈등",
    "english": "social conflict",
    "example": "빈부격차로 인한 사회갈등이 심화되는 것을 우려하는 전문가들이 많다.",
    "example_en": "Many experts are concerned about intensifying social conflict due to income inequality."
  },
  {
    "korean": "양극화",
    "english": "polarization",
    "example": "정치, 경제, 문화 등 다양한 분야에서 양극화가 진행되고 있다.",
    "example_en": "Polarization is occurring in various fields including politics, economy, and culture."
  },
  {
    "korean": "노인 부양",
    "english": "elderly care; support for the elderly",
    "example": "자녀 세대의 노인 부양 부담이 점점 커지고 있다.",
    "example_en": "The burden of elderly care on the younger generation is increasing."
  }
]}
