{
  "연어 (Collocations)": [
    {
      "korean": "결정을 내리다",
      "english": "to make a decision",
      "example": "더 이상 미룰 수 없어서 오늘 안에 결정을 내리기로 했다.",
      "example_en": "I couldn't put it off any longer, so I decided to make a decision by today."
    },
    {
      "korean": "조치를 취하다",
      "english": "to take measures/action",
      "example": "문제가 커지기 전에 빠르게 조치를 취해야 한다.",
      "example_en": "We need to take action quickly before the problem gets worse."
    },
    {
      "korean": "책임을 지다",
      "english": "to bear/take responsibility",
      "example": "팀장으로서 이번 실패에 대해 책임을 지겠습니다.",
      "example_en": "As the team leader, I will take responsibility for this failure."
    },
    {
      "korean": "결론을 내리다",
      "english": "to reach/draw a conclusion",
      "example": "몇 시간 동안 토론한 끝에 드디어 결론을 내렸다.",
      "example_en": "After debating for several hours, we finally reached a conclusion."
    },
    {
      "korean": "결심을 굳히다",
      "english": "to firm up one's resolve",
      "example": "여러 번 고민한 끝에 유학을 가겠다는 결심을 굳혔다.",
      "example_en": "After agonizing over it many times, I firmed up my resolve to study abroad."
    },
    {
      "korean": "행동에 옮기다",
      "english": "to put into action; to act on something",
      "example": "계획만 세우지 말고 이제 행동에 옮길 때다.",
      "example_en": "Stop just making plans — it's time to put them into action."
    },
    {
      "korean": "대책을 세우다",
      "english": "to devise countermeasures; to come up with a plan",
      "example": "홍수 피해를 줄이기 위해 정부가 대책을 세우고 있다.",
      "example_en": "The government is devising countermeasures to reduce flood damage."
    },
    {
      "korean": "발판을 마련하다",
      "english": "to lay the groundwork; to create a stepping stone",
      "example": "이번 프로젝트가 해외 진출의 발판을 마련해 줄 것이다.",
      "example_en": "This project will lay the groundwork for expanding overseas."
    },
    {
      "korean": "계획을 세우다",
      "english": "to make/draw up a plan",
      "example": "새해가 되면 항상 거창한 계획을 세우지만 작심삼일로 끝난다.",
      "example_en": "Every New Year I draw up grand plans, but they never last more than three days."
    },
    {
      "korean": "목표를 세우다",
      "english": "to set a goal",
      "example": "올해는 현실적인 목표를 세우고 꾸준히 실천하려고 한다.",
      "example_en": "This year I plan to set realistic goals and follow through consistently."
    },
    {
      "korean": "화를 삭이다",
      "english": "to swallow/suppress one's anger",
      "example": "회의 중에 화가 났지만 꾹 참고 화를 삭였다.",
      "example_en": "I got angry during the meeting, but I held it in and suppressed my anger."
    },
    {
      "korean": "감정을 추스르다",
      "english": "to collect/compose one's emotions",
      "example": "나쁜 소식을 듣고 한참 동안 감정을 추스르지 못했다.",
      "example_en": "After hearing the bad news, I couldn't compose my emotions for a long time."
    },
    {
      "korean": "눈물을 참다",
      "english": "to hold back tears",
      "example": "졸업식에서 눈물을 참으려고 했는데 결국 울고 말았다.",
      "example_en": "I tried to hold back tears at the graduation ceremony, but I ended up crying."
    },
    {
      "korean": "마음을 먹다",
      "english": "to make up one's mind; to set one's heart on",
      "example": "마음을 먹으면 뭐든 해내는 사람이라 걱정 안 해.",
      "example_en": "She's the type who accomplishes anything once she sets her mind to it, so I'm not worried."
    },
    {
      "korean": "한숨을 쉬다",
      "english": "to let out a sigh",
      "example": "월급 명세서를 보고 나도 모르게 한숨을 쉬었다.",
      "example_en": "I looked at my pay stub and let out a sigh without realizing it."
    },
    {
      "korean": "속을 끓이다",
      "english": "to be inwardly troubled; to stew with worry",
      "example": "아이가 늦게까지 안 들어와서 부모님이 속을 끓이고 계셨다.",
      "example_en": "The parents were stewing with worry because the child hadn't come home late into the night."
    },
    {
      "korean": "울분을 토하다",
      "english": "to vent one's pent-up frustration/rage",
      "example": "부당하게 해고된 직원들이 기자회견에서 울분을 토했다.",
      "example_en": "The unfairly fired employees vented their rage at the press conference."
    },
    {
      "korean": "용기를 내다",
      "english": "to muster/summon courage",
      "example": "떨리는 마음을 누르고 용기를 내서 고백했다.",
      "example_en": "I pushed down my trembling heart, mustered my courage, and confessed."
    },
    {
      "korean": "마음을 잡다",
      "english": "to pull oneself together; to get a grip",
      "example": "방황하다가 서른이 넘어서야 마음을 잡고 공부를 시작했다.",
      "example_en": "After drifting aimlessly, I finally pulled myself together and started studying past thirty."
    },
    {
      "korean": "기분을 풀다",
      "english": "to cheer up; to shake off a bad mood",
      "example": "기분을 풀려고 친구랑 맛있는 거 먹으러 나갔다.",
      "example_en": "I went out to eat something good with a friend to cheer myself up."
    },
    {
      "korean": "실력을 쌓다",
      "english": "to build up one's skills/competence",
      "example": "지름길은 없다 — 매일 꾸준히 해야 실력을 쌓을 수 있다.",
      "example_en": "There are no shortcuts — you can only build your skills by practicing steadily every day."
    },
    {
      "korean": "경력을 쌓다",
      "english": "to build up one's career/experience",
      "example": "대기업에서 5년간 경력을 쌓은 뒤 창업에 도전했다.",
      "example_en": "After building up five years of experience at a large company, I took the plunge and started my own business."
    },
    {
      "korean": "자리를 잡다",
      "english": "to settle in; to establish oneself",
      "example": "이민 간 지 3년 만에 겨우 자리를 잡았다.",
      "example_en": "It took three years after immigrating to finally get settled."
    },
    {
      "korean": "야근을 하다",
      "english": "to work overtime (at night)",
      "example": "이번 주 내내 야근을 해서 몸이 축나는 게 느껴진다.",
      "example_en": "I've been working overtime all week and I can feel my body wearing down."
    },
    {
      "korean": "사표를 내다",
      "english": "to submit one's resignation",
      "example": "더 이상 버틸 수 없어서 결국 사표를 냈다.",
      "example_en": "I couldn't take it anymore, so I finally submitted my resignation."
    },
    {
      "korean": "성과를 거두다",
      "english": "to achieve results; to reap outcomes",
      "example": "6개월간의 노력 끝에 눈에 띄는 성과를 거두었다.",
      "example_en": "After six months of effort, we achieved noticeable results."
    },
    {
      "korean": "일을 맡다",
      "english": "to take on a task/duty",
      "example": "이번에 신입이 들어와서 내가 교육하는 일을 맡게 됐다.",
      "example_en": "A new hire joined, so I was assigned the task of training them."
    },
    {
      "korean": "직장을 구하다",
      "english": "to look for/find a job",
      "example": "졸업하고 6개월 동안 직장을 구하느라 정신이 없었다.",
      "example_en": "For six months after graduating, I was frantic trying to find a job."
    },
    {
      "korean": "인정을 받다",
      "english": "to gain recognition; to be acknowledged",
      "example": "묵묵히 일한 덕분에 드디어 상사에게 인정을 받았다.",
      "example_en": "Thanks to working quietly and diligently, I was finally recognized by my boss."
    },
    {
      "korean": "실수를 만회하다",
      "english": "to make up for a mistake; to recover from an error",
      "example": "프레젠테이션에서 실수를 했지만 질의응답에서 만회했다.",
      "example_en": "I made a mistake during the presentation, but I made up for it during the Q&A."
    },
    {
      "korean": "사이가 벌어지다",
      "english": "to grow apart; for a rift to develop",
      "example": "사소한 오해가 쌓이면서 둘 사이가 점점 벌어졌다.",
      "example_en": "As small misunderstandings piled up, the two gradually grew apart."
    },
    {
      "korean": "관계를 맺다",
      "english": "to form/establish a relationship",
      "example": "거래처와 신뢰를 바탕으로 좋은 관계를 맺는 게 중요하다.",
      "example_en": "It's important to form a good relationship with clients based on trust."
    },
    {
      "korean": "인연을 맺다",
      "english": "to form a bond/connection (often fateful)",
      "example": "대학교 동아리에서 인연을 맺은 친구와 아직도 연락하고 지낸다.",
      "example_en": "I still keep in touch with a friend I formed a bond with in a college club."
    },
    {
      "korean": "사이가 틀어지다",
      "english": "to have a falling out; for a relationship to sour",
      "example": "돈 문제로 10년 지기 친구와 사이가 틀어졌다.",
      "example_en": "I had a falling out with a friend of ten years over a money issue."
    },
    {
      "korean": "마음을 열다",
      "english": "to open one's heart; to let someone in",
      "example": "처음에는 경계했지만 시간이 지나면서 서서히 마음을 열었다.",
      "example_en": "At first I was guarded, but as time passed I gradually opened my heart."
    },
    {
      "korean": "연락을 끊다",
      "english": "to cut off contact",
      "example": "헤어진 뒤로 깔끔하게 연락을 끊었다.",
      "example_en": "After the breakup, I cut off contact cleanly."
    },
    {
      "korean": "약속을 지키다",
      "english": "to keep a promise",
      "example": "아무리 사소해도 약속을 지키는 사람이 진짜 믿을 만하다.",
      "example_en": "A person who keeps promises, no matter how small, is truly trustworthy."
    },
    {
      "korean": "오해를 풀다",
      "english": "to clear up a misunderstanding",
      "example": "직접 만나서 이야기하니까 금방 오해를 풀 수 있었다.",
      "example_en": "Once we met in person and talked, we were able to clear up the misunderstanding quickly."
    },
    {
      "korean": "신뢰를 쌓다",
      "english": "to build trust",
      "example": "신뢰를 쌓는 데는 오래 걸리지만 무너지는 건 한순간이다.",
      "example_en": "Building trust takes a long time, but it can crumble in an instant."
    },
    {
      "korean": "소식을 전하다",
      "english": "to deliver/share news",
      "example": "고향에 계신 부모님께 합격 소식을 전하니 많이 기뻐하셨다.",
      "example_en": "When I shared the news of my acceptance with my parents back home, they were overjoyed."
    }
  ]
}
