{"주제별 단어 — 장애/접근성 (Topic: Disability & Accessibility)": [
  {"korean": "시각장애", "english": "visual impairment", "example": "그녀는 시각장애가 있지만 대학교를 졸업하고 변호사로 활동하고 있다.", "example_en": "She has a visual impairment but graduated from university and works as a lawyer."},
  {"korean": "청각장애", "english": "hearing impairment", "example": "청각장애가 있는 학생들을 위해 수화 통역 서비스가 제공된다.", "example_en": "Sign language interpretation services are provided for students with hearing impairments."},
  {"korean": "지체장애", "english": "physical disability", "example": "지체장애를 가진 사람도 특수한 기구를 사용하면 일상생활을 자립적으로 할 수 있다.", "example_en": "A person with a physical disability can lead an independent daily life using special equipment."},
  {"korean": "지적장애", "english": "intellectual disability", "example": "지적장애가 있는 사람들도 사회 속에서 자기 역할을 하며 살아갈 수 있어야 한다.", "example_en": "People with intellectual disabilities should be able to live meaningful lives and fulfill their roles in society."},
  {"korean": "발달장애", "english": "developmental disorder", "example": "발달장애 진단을 받은 어린이들은 조기 개입 프로그램을 통해 발전할 기회를 얻는다.", "example_en": "Children diagnosed with developmental disorders have opportunities to progress through early intervention programs."},
  {"korean": "자폐증", "english": "autism spectrum disorder", "example": "자폐증을 가진 학생들은 각자의 특성과 속도에 맞춘 맞춤형 교육이 필요하다.", "example_en": "Students with autism need customized education tailored to their individual characteristics and pace."},
  {"korean": "정신장애", "english": "mental disorder", "example": "정신장애는 신체장애만큼 중요하게 다루어져야 하며 사회의 편견을 극복해야 한다.", "example_en": "Mental disorders should be treated as seriously as physical disabilities and society must overcome prejudice."},
  {"korean": "난청", "english": "hearing loss", "example": "심한 난청으로 인해 일상적인 의사소통이 어려운 경우 보청기의 도움을 받을 수 있다.", "example_en": "When severe hearing loss makes daily communication difficult, hearing aids can help."},
  {"korean": "약시", "english": "low vision", "example": "약시가 있는 사람들도 특별한 확대경이나 컴퓨터 프로그램을 사용해서 일을 계속할 수 있다.", "example_en": "People with low vision can continue working using special magnifying glasses or computer programs."},
  {"korean": "농", "english": "deafness", "example": "농인 커뮤니티는 한국수화를 통해 자신들의 고유한 문화와 정체성을 유지하고 있다.", "example_en": "The Deaf community maintains their unique culture and identity through Korean Sign Language."},
  {"korean": "척수손상", "english": "spinal cord injury", "example": "척수손상을 입은 환자는 전문적인 재활 치료를 받음으로써 기능 회복이 가능하다.", "example_en": "Patients with spinal cord injuries can recover function through professional rehabilitation therapy."},
  {"korean": "뇌성마비", "english": "cerebral palsy", "example": "뇌성마비가 있어도 적절한 물리치료와 지원을 받으면 독립적인 삶을 영위할 수 있다.", "example_en": "Even with cerebral palsy, people can lead independent lives with appropriate physical therapy and support."},
  {"korean": "휠체어", "english": "wheelchair", "example": "현대의 전동 휠체어는 기술이 발전해서 계단도 올라갈 수 있는 제품들이 나오고 있다.", "example_en": "Modern electric wheelchairs have advanced technology and products that can climb stairs are now available."},
  {"korean": "보청기", "english": "hearing aid", "example": "최신형 보청기는 스마트폰과 연결되어 사용자가 음량과 음질을 자유롭게 조절할 수 있다.", "example_en": "The latest hearing aids can connect to smartphones, allowing users to freely adjust volume and sound quality."},
  {"korean": "인공와우", "english": "cochlear implant", "example": "인공와우 수술을 받으면 선천적 난청이 있어도 소리를 인지하고 언어를 습득할 수 있다.", "example_en": "With cochlear implant surgery, even those with congenital hearing loss can perceive sound and acquire language."},
  {"korean": "점자", "english": "Braille", "example": "시각장애인들은 점자를 통해 읽고 쓸 수 있으며, 도서관에는 점자 자료가 비치되어 있다.", "example_en": "Visually impaired people can read and write through Braille, and libraries have Braille materials available."},
  {"korean": "흰 지팡이", "english": "white cane", "example": "흰 지팡이는 시각장애인을 나타내는 상징일 뿐만 아니라 안전하게 이동할 수 있게 도와주는 도구이다.", "example_en": "A white cane is not only a symbol of visual impairment but also a tool that helps people move safely."},
  {"korean": "음성 안내", "english": "audio guidance", "example": "지하철 역에는 음성 안내 시스템이 설치되어 시각장애인도 쉽게 탈 수 있도록 돕는다.", "example_en": "Subway stations have audio guidance systems to help visually impaired people board easily."},
  {"korean": "화면 읽기 프로그램", "english": "screen reader", "example": "화면 읽기 프로그램은 컴퓨터 화면의 텍스트를 음성으로 변환해서 시각장애인이 인터넷을 사용하게 해준다.", "example_en": "Screen reader programs convert on-screen text to speech, enabling visually impaired people to use the internet."},
  {"korean": "자막", "english": "subtitles/captions", "example": "모든 방송국은 청각장애인을 위해 프로그램에 자막을 제공해야 한다는 규정이 있다.", "example_en": "All broadcasting stations have regulations requiring them to provide subtitles for their programs for hearing-impaired viewers."},
  {"korean": "경사로", "english": "ramp", "example": "휠체어 사용자가 계단을 올라갈 수 없으므로 건물 입구마다 경사로를 설치하는 것이 의무이다.", "example_en": "Since wheelchair users cannot climb stairs, it is mandatory to install ramps at building entrances."},
  {"korean": "엘리베이터", "english": "elevator", "example": "장애인뿐만 아니라 모든 사람들을 위해 엘리베이터에는 접근성을 높이는 여러 기능이 탑재되어 있다.", "example_en": "Elevators have various accessibility features not just for disabled people but for everyone."},
  {"korean": "손잡이", "english": "handrail", "example": "계단과 복도의 손잡이는 고령자나 장애인이 넘어지지 않도록 안전을 보장한다.", "example_en": "Handrails on stairs and hallways ensure safety for elderly people and those with disabilities to prevent falls."},
  {"korean": "점자 블록", "english": "tactile paving", "example": "보도의 점자 블록은 시각장애인이 안전하게 길을 찾을 수 있도록 유도하는 중요한 시설이다.", "example_en": "Tactile paving on sidewalks is an important facility that guides visually impaired people to navigate safely."},
  {"korean": "무장애 설계", "english": "barrier-free design", "example": "무장애 설계는 장애인뿐만 아니라 어린이, 노인, 임산부 등 모든 사람이 쉽게 이용할 수 있도록 고려한 설계이다.", "example_en": "Barrier-free design is designed so that not only people with disabilities but also children, elderly people, and pregnant women can use it easily."},
  {"korean": "배리어프리", "english": "barrier-free (environment)", "example": "이 카페는 배리어프리 환경을 제공해서 휠체어 사용자도 편하게 식사를 즐길 수 있다.", "example_en": "This café provides a barrier-free environment so wheelchair users can enjoy dining comfortably."},
  {"korean": "웹 접근성", "english": "web accessibility", "example": "정부 웹사이트는 웹 접근성 국제 표준을 충족해야 하므로 시각장애인도 이용할 수 있어야 한다.", "example_en": "Government websites must meet international web accessibility standards and be usable by visually impaired people."},
  {"korean": "접근성", "english": "accessibility", "example": "휴대폰의 접근성 기능을 활용하면 장애인도 비장애인과 동일하게 스마트폰을 사용할 수 있다.", "example_en": "Using smartphone accessibility features allows people with disabilities to use smartphones just like non-disabled people."},
  {"korean": "수화", "english": "sign language", "example": "청각장애인 부모님을 둔 자녀들은 수화를 모국어처럼 사용한다.", "example_en": "Children of Deaf parents use sign language like their native language."},
  {"korean": "수화 통역", "english": "sign language interpreter", "example": "중요한 공청회나 회의에는 청각장애인을 위해 수화 통역사가 배치되어야 한다.", "example_en": "Sign language interpreters should be assigned to important public hearings and meetings for people with hearing impairments."},
  {"korean": "한국수화", "english": "Korean Sign Language", "example": "한국수화는 한국의 농인들이 수세기에 걸쳐 발전시킨 독립적인 언어 체계이다.", "example_en": "Korean Sign Language is an independent language system developed by Korean Deaf people over centuries."},
  {"korean": "재활", "english": "rehabilitation", "example": "뇌졸중으로 인한 마비 환자들은 장기적인 재활 치료를 통해 일상생활 능력을 회복할 수 있다.", "example_en": "Patients paralyzed by stroke can recover their ability to perform daily activities through long-term rehabilitation therapy."},
  {"korean": "물리치료", "english": "physical therapy", "example": "물리치료사는 운동과 수동 조작을 통해 환자의 신체 기능과 이동성을 개선시킨다.", "example_en": "Physical therapists improve patients' physical function and mobility through exercise and manual manipulation."},
  {"korean": "작업치료", "english": "occupational therapy", "example": "작업치료는 환자가 일상생활 활동, 직업 활동, 여가 활동을 다시 수행할 수 있도록 돕는다.", "example_en": "Occupational therapy helps patients resume daily living activities, occupational activities, and leisure activities."},
  {"korean": "언어치료", "english": "speech therapy", "example": "뇌성마비나 음성장애가 있는 아이들은 언어치료를 통해 의사소통 능력을 향상시킬 수 있다.", "example_en": "Children with cerebral palsy or speech disorders can improve their communication skills through speech therapy."},
  {"korean": "심리치료", "english": "psychotherapy", "example": "장애를 가진 사람들이 심리적 어려움을 겪을 때 심리치료가 도움이 될 수 있다.", "example_en": "Psychotherapy can help people with disabilities who are experiencing psychological difficulties."},
  {"korean": "통합교육", "english": "inclusive education", "example": "통합교육은 장애학생과 비장애학생이 함께 공부하면서 서로를 이해하고 존중하는 환경을 만든다.", "example_en": "Inclusive education creates an environment where students with and without disabilities study together and understand and respect each other."},
  {"korean": "특수교육", "english": "special education", "example": "특수교육 교사들은 학생의 장애 유형과 정도에 따라 맞춤형 교수 방법을 사용한다.", "example_en": "Special education teachers use customized teaching methods according to the type and severity of students' disabilities."},
  {"korean": "직업 훈련", "english": "job training", "example": "직업 훈련 프로그램은 장애인이 자신의 능력에 맞는 직업 기술을 배우고 취업할 수 있도록 지원한다.", "example_en": "Job training programs support people with disabilities in learning job skills suited to their abilities and finding employment."},
  {"korean": "고용 지원", "english": "employment support", "example": "정부의 고용 지원 정책에 따라 기업이 장애인을 고용하면 세금 감면 혜택을 받을 수 있다.", "example_en": "Under the government's employment support policies, companies can receive tax benefits for hiring people with disabilities."}
]}
