{
  "구어체 (Colloquial)": [
    {
      "korean": "참 대단하시다",
      "english": "How impressive (sarcastic — meaning the opposite)",
      "example": "약속을 또 어겼네? 참 대단하시다.",
      "example_en": "You broke your promise again? How impressive."
    },
    {
      "korean": "그래, 네가 다 잘했어",
      "english": "Sure, you did everything right (dismissive sarcasm)",
      "example": "남 탓만 하더니, 그래, 네가 다 잘했어.",
      "example_en": "You kept blaming others — sure, you did everything right."
    },
    {
      "korean": "아이고, 고생이 많으시다",
      "english": "Oh, you must be suffering so much (ironic sympathy)",
      "example": "하루 종일 폰만 봤으면서, 아이고 고생이 많으시다.",
      "example_en": "You were on your phone all day, yet oh, you must be suffering so much."
    },
    {
      "korean": "눈치도 없다",
      "english": "You have zero social awareness (pointed observation)",
      "example": "분위기가 이런데 혼자 웃고 있어? 눈치도 없다.",
      "example_en": "The mood is like this and you're laughing alone? Zero social awareness."
    },
    {
      "korean": "입만 살았어",
      "english": "All talk, no action",
      "example": "매번 하겠다고만 하지, 입만 살았어.",
      "example_en": "You always say you'll do it — you're all talk."
    },
    {
      "korean": "그게 말이라고 해?",
      "english": "Is that even something you should say?",
      "example": "사과한다면서 그게 말이라고 해?",
      "example_en": "You call that an apology? Is that even something to say?"
    },
    {
      "korean": "잘난 척은",
      "english": "What a show-off (dismissive)",
      "example": "한 번 맞았다고 잘난 척은.",
      "example_en": "You got one right and now you're showing off."
    },
    {
      "korean": "어디서 배운 거야, 그 버릇",
      "english": "Where did you pick up that bad habit? (rhetorical, mocking)",
      "example": "어른 앞에서 그렇게 말하면, 어디서 배운 거야 그 버릇?",
      "example_en": "Talking like that in front of elders — where did you pick up that habit?"
    },
    {
      "korean": "오, 진짜?",
      "english": "Oh, really? (can be sarcastic or genuinely surprised depending on tone)",
      "example": "자기가 직접 요리했다고? 오, 진짜?",
      "example_en": "You cooked it yourself? Oh, really?"
    },
    {
      "korean": "하여튼 말은 참 잘해",
      "english": "You sure have a way with words (sarcastically implying they only talk)",
      "example": "변명할 때 보면 하여튼 말은 참 잘해.",
      "example_en": "When it comes to making excuses, you sure have a way with words."
    },
    {
      "korean": "헉, 이게 뭐야",
      "english": "Whoa, what is this?! (shock/disbelief)",
      "example": "헉, 이게 뭐야! 갑자기 사장이 전체 메일을 보냈어.",
      "example_en": "Whoa, what is this?! The boss suddenly sent a company-wide email."
    },
    {
      "korean": "소름 끼친다",
      "english": "That gives me chills (shock/awe/creepiness)",
      "example": "우연의 일치라기엔 소름 끼친다.",
      "example_en": "It gives me chills to call it just a coincidence."
    },
    {
      "korean": "기가 차다",
      "english": "To be so stunned/appalled one is speechless",
      "example": "이 정도면 기가 차서 말이 안 나온다.",
      "example_en": "At this point, I'm so stunned I can't even speak."
    },
    {
      "korean": "뜬금없이 왜",
      "english": "Why out of the blue?",
      "example": "뜬금없이 왜 전 여자친구 이야기를 꺼내?",
      "example_en": "Why are you bringing up your ex-girlfriend out of the blue?"
    },
    {
      "korean": "눈앞이 캄캄하다",
      "english": "Everything goes dark before one's eyes (overwhelmed/shocked)",
      "example": "시험 결과를 보는 순간 눈앞이 캄캄했다.",
      "example_en": "The moment I saw the test results, everything went dark."
    },
    {
      "korean": "아닐 줄 알았는데",
      "english": "I thought it wouldn't be the case, but... (surprised it happened)",
      "example": "설마 했는데, 아닐 줄 알았는데 진짜 합격했어.",
      "example_en": "I didn't think it would happen, but I actually passed."
    },
    {
      "korean": "꿈에도 몰랐다",
      "english": "I had no idea in my wildest dreams",
      "example": "그 사람이 범인이었다니 꿈에도 몰랐다.",
      "example_en": "I had no idea in my wildest dreams that person was the culprit."
    },
    {
      "korean": "심장이 멎는 줄 알았다",
      "english": "I thought my heart was going to stop (extreme shock)",
      "example": "뒤에서 갑자기 소리 질러서 심장이 멎는 줄 알았다.",
      "example_en": "Someone suddenly screamed from behind — I thought my heart was going to stop."
    },
    {
      "korean": "이게 실화야?",
      "english": "Is this for real? (disbelief at something happening)",
      "example": "시험 범위가 전부라고? 이게 실화야?",
      "example_en": "The exam covers everything? Is this for real?"
    },
    {
      "korean": "하늘이 노래지다",
      "english": "The sky turned yellow (feeling faint from shock/despair)",
      "example": "통장 잔고를 확인하고 하늘이 노래졌다.",
      "example_en": "I checked my bank balance and nearly fainted."
    },
    {
      "korean": "한번만 더 생각해 봐",
      "english": "Just think about it one more time (gentle persuasion)",
      "example": "섣불리 결정하지 말고 한번만 더 생각해 봐.",
      "example_en": "Don't decide hastily — just think about it one more time."
    },
    {
      "korean": "네 입장은 알겠는데",
      "english": "I understand your position, but... (prelude to disagreeing)",
      "example": "네 입장은 알겠는데, 이건 좀 아닌 것 같아.",
      "example_en": "I understand your position, but I don't think this is right."
    },
    {
      "korean": "그건 좀 다른 문제 아니야?",
      "english": "Isn't that a different issue? (redirecting an argument)",
      "example": "비용 문제를 말하는데 왜 감정 이야기를 해? 그건 좀 다른 문제 아니야?",
      "example_en": "We're talking about costs, so why bring up feelings? Isn't that a different issue?"
    },
    {
      "korean": "그 논리대로라면",
      "english": "By that logic... (challenging someone's reasoning)",
      "example": "그 논리대로라면 아무도 새로운 시도를 못 하겠네.",
      "example_en": "By that logic, nobody could ever try anything new."
    },
    {
      "korean": "따지고 보면",
      "english": "If you think about it carefully / when you really look into it",
      "example": "따지고 보면 네가 먼저 약속을 어긴 거잖아.",
      "example_en": "When you really look into it, you were the one who broke the promise first."
    },
    {
      "korean": "안 그래도 그 얘기 하려고 했는데",
      "english": "I was actually just about to bring that up",
      "example": "안 그래도 그 얘기 하려고 했는데, 네가 먼저 꺼내니까 잘됐다.",
      "example_en": "I was just about to bring that up — good thing you mentioned it first."
    },
    {
      "korean": "핑계 대지 마",
      "english": "Don't make excuses",
      "example": "바빠서 못 했다니, 핑계 대지 마.",
      "example_en": "You said you were too busy — don't make excuses."
    },
    {
      "korean": "끝까지 우길 거야?",
      "english": "Are you going to insist until the very end?",
      "example": "증거가 이렇게 있는데 끝까지 우길 거야?",
      "example_en": "With this much evidence, are you still going to insist?"
    },
    {
      "korean": "그렇다고 이게 맞아?",
      "english": "Even so, is this right? (conceding a point but still disagreeing)",
      "example": "힘들었던 건 알아. 그렇다고 이게 맞아?",
      "example_en": "I know it was hard. But even so, is this the right thing to do?"
    },
    {
      "korean": "두고 보자",
      "english": "Just you wait / We'll see (mild threat or determination)",
      "example": "지금은 웃어도 두고 보자, 누가 맞는지.",
      "example_en": "Laugh now, but just you wait — we'll see who's right."
    },
    {
      "korean": "야, 들었어?",
      "english": "Hey, did you hear? (starting gossip)",
      "example": "야, 들었어? 옆 부서 과장이 갑자기 사표 냈대.",
      "example_en": "Hey, did you hear? The manager in the next department suddenly resigned."
    },
    {
      "korean": "그래서 어떻게 됐는데?",
      "english": "So what happened? (egging on a story)",
      "example": "거기까지 알고 끊으면 어떡해, 그래서 어떻게 됐는데?",
      "example_en": "You can't stop there — so what happened?"
    },
    {
      "korean": "아니 근데 진짜 웃긴 게",
      "english": "No but the really funny thing is... (storytelling transition)",
      "example": "아니 근데 진짜 웃긴 게, 다음 날 본인은 아무 일 없다는 듯이 나왔어.",
      "example_en": "But the really funny thing is, the next day they showed up acting like nothing happened."
    },
    {
      "korean": "카더라",
      "english": "So they say / Allegedly (hearsay marker)",
      "example": "이번 인사이동에서 팀장이 바뀐다 카더라.",
      "example_en": "They say the team leader is changing in the next personnel reshuffle."
    },
    {
      "korean": "소문에 의하면",
      "english": "According to rumors",
      "example": "소문에 의하면 그 두 사람이 사귄대.",
      "example_en": "According to rumors, those two are dating."
    },
    {
      "korean": "그 사람 원래 좀 그래",
      "english": "That person has always been like that (dismissive characterization)",
      "example": "놀랄 것도 없어, 그 사람 원래 좀 그래.",
      "example_en": "Nothing to be surprised about — that person has always been like that."
    },
    {
      "korean": "듣자 하니",
      "english": "From what I've heard (introducing secondhand info)",
      "example": "듣자 하니 그쪽 회사 분위기가 완전 엉망이래.",
      "example_en": "From what I've heard, the atmosphere at that company is a total mess."
    },
    {
      "korean": "그 뒷이야기가 있어",
      "english": "There's a backstory to that",
      "example": "걔가 왜 갑자기 그만뒀는지 알아? 그 뒷이야기가 있어.",
      "example_en": "Do you know why they suddenly quit? There's a backstory."
    },
    {
      "korean": "내가 직접 본 건 아닌데",
      "english": "I didn't see it myself, but... (hedging before gossip)",
      "example": "내가 직접 본 건 아닌데, 그날 사무실에서 큰 소리가 났다고 해.",
      "example_en": "I didn't see it myself, but they say there was a lot of shouting in the office that day."
    },
    {
      "korean": "함부로 말하면 안 되는데",
      "english": "I probably shouldn't say this, but... (pretending to hold back before sharing)",
      "example": "함부로 말하면 안 되는데, 그 프로젝트 사실 거의 엎어질 뻔했대.",
      "example_en": "I probably shouldn't say this, but that project almost fell apart."
    }
  ]
}