{
  "구어체 (Colloquial)": [
    {
      "korean": "아, 그래그래",
      "english": "Yeah, yeah, sure (dismissive, not really listening/agreeing)",
      "example": "잔소리가 길어지자 \"아, 그래그래\" 하며 넘겼다.",
      "example_en": "When the nagging went on too long, I brushed it off with 'yeah, yeah, sure.'"
    },
    {
      "korean": "웃기고 있네",
      "english": "That's laughable / Don't make me laugh (dismissive sarcasm)",
      "example": "자기가 잘못하고 화를 내? 웃기고 있네.",
      "example_en": "You did something wrong and you're the one getting mad? Don't make me laugh."
    },
    {
      "korean": "어디서 약을 팔어",
      "english": "Who do you think you're fooling? (lit: where are you selling medicine?)",
      "example": "모른다고? 어디서 약을 팔어, 다 알면서.",
      "example_en": "You don't know? Who are you trying to fool — you know everything."
    },
    {
      "korean": "말을 참 예쁘게도 하네",
      "english": "What pretty words (sarcasm: they're saying something self-serving)",
      "example": "본인 편한 대로 해 놓고 말을 참 예쁘게도 하네.",
      "example_en": "You did what suited you and now you phrase it so nicely."
    },
    {
      "korean": "그러게 내가 뭐랬어",
      "english": "See, what did I tell you? (I-told-you-so)",
      "example": "결국 이렇게 됐잖아. 그러게 내가 뭐랬어.",
      "example_en": "It ended up like this after all. See, what did I tell you?"
    },
    {
      "korean": "참 잘했다 잘했어",
      "english": "You really did great, great job (mocking/sarcastic when repeated)",
      "example": "시험 전날 놀러 갔다고? 참 잘했다 잘했어.",
      "example_en": "You went out to have fun the night before the exam? Great job, really."
    },
    {
      "korean": "본인이 제일 잘 알겠지",
      "english": "I'm sure you know best (sarcastic deference)",
      "example": "아무 말도 안 통하네. 본인이 제일 잘 알겠지, 뭐.",
      "example_en": "Nothing I say gets through. I'm sure you know best."
    },
    {
      "korean": "어쩜 그렇게 할 말만 골라 해",
      "english": "How do you manage to say only what suits you?",
      "example": "자기 잘못은 쏙 빼고, 어쩜 그렇게 할 말만 골라 해.",
      "example_en": "You conveniently leave out your own fault — how do you manage to say only what suits you?"
    },
    {
      "korean": "보는 눈이 있으니까",
      "english": "There are people watching, so... (warning to behave properly)",
      "example": "보는 눈이 있으니까 조용히 해, 나중에 얘기하자.",
      "example_en": "There are people watching, so keep it down — let's talk later."
    },
    {
      "korean": "격이 다르다",
      "english": "It's on a different level (can be genuine admiration or sarcastic)",
      "example": "비싼 가방이 역시 격이 다르네.",
      "example_en": "An expensive bag really is on a different level."
    },
    {
      "korean": "이게 웬 떡이야",
      "english": "What unexpected good fortune is this? (pleasant surprise)",
      "example": "갑자기 보너스가 나왔어? 이게 웬 떡이야!",
      "example_en": "A bonus came out of nowhere? What unexpected fortune!"
    },
    {
      "korean": "완전 멘붕이다",
      "english": "Total mental breakdown (slang for extreme shock/confusion)",
      "example": "면접에서 질문이 너무 어려워서 완전 멘붕이었어.",
      "example_en": "The interview questions were so hard, I had a total mental breakdown."
    },
    {
      "korean": "경악을 금치 못하다",
      "english": "To be unable to conceal one's shock (formal-sounding but used colloquially for effect)",
      "example": "그 가격을 보고 경악을 금치 못했다.",
      "example_en": "I was unable to conceal my shock when I saw that price."
    },
    {
      "korean": "어안이 벙벙하다",
      "english": "To be flabbergasted/dumbfounded",
      "example": "갑자기 해고 통보를 받아서 어안이 벙벙했다.",
      "example_en": "I was flabbergasted after suddenly being notified of my dismissal."
    },
    {
      "korean": "입이 딱 벌어지다",
      "english": "For one's jaw to drop (amazement)",
      "example": "호텔 스위트룸에 들어가니 입이 딱 벌어졌다.",
      "example_en": "When I entered the hotel suite, my jaw dropped."
    },
    {
      "korean": "미쳤나 봐",
      "english": "I think I/they must be crazy (disbelief at something absurd)",
      "example": "이 가격에 팔겠다고? 미쳤나 봐.",
      "example_en": "They want to sell it at that price? They must be crazy."
    },
    {
      "korean": "나 지금 멘탈 나갔어",
      "english": "I've completely lost it / My mental state is gone (slang for being overwhelmed)",
      "example": "실수를 연달아 해서 나 지금 멘탈 나갔어.",
      "example_en": "I made one mistake after another — I've completely lost it."
    },
    {
      "korean": "갑분싸",
      "english": "Sudden mood killer (abbreviation of 갑자기 분위기 싸해짐)",
      "example": "그 말 한마디에 갑분싸 됐잖아.",
      "example_en": "That one comment suddenly killed the mood."
    },
    {
      "korean": "할 말은 못 참겠어",
      "english": "I just can't hold back what I have to say (insisting on speaking up)",
      "example": "가만히 있으려고 했는데 할 말은 못 참겠어.",
      "example_en": "I was going to keep quiet, but I can't hold back what I have to say."
    },
    {
      "korean": "말귀를 못 알아듣다",
      "english": "To not understand what's being said (implies someone is dense)",
      "example": "몇 번을 말해도 말귀를 못 알아듣는다.",
      "example_en": "No matter how many times I explain, they don't get it."
    },
    {
      "korean": "억지 부리지 마",
      "english": "Stop being unreasonable / Don't force it",
      "example": "안 되는 거 안 되는 거야, 억지 부리지 마.",
      "example_en": "What can't be done can't be done — stop being unreasonable."
    },
    {
      "korean": "솔직히 좀 그렇지 않아?",
      "english": "Honestly, isn't that a bit much? (inviting agreement)",
      "example": "매번 자기만 빠지면서 솔직히 좀 그렇지 않아?",
      "example_en": "They skip out every time — honestly, isn't that a bit much?"
    },
    {
      "korean": "거 봐, 내 말이 맞잖아",
      "english": "See? I was right (vindicating oneself)",
      "example": "거 봐, 내 말이 맞잖아. 그때 들었으면 이렇게 안 됐어.",
      "example_en": "See? I was right. If you'd listened back then, it wouldn't have come to this."
    },
    {
      "korean": "딱 잘라 말하면",
      "english": "To put it bluntly / Cutting straight to it",
      "example": "딱 잘라 말하면, 그건 네 잘못이야.",
      "example_en": "To put it bluntly, that's your fault."
    },
    {
      "korean": "내가 양보할 테니까",
      "english": "I'll give in / I'll make the concession, so... (conditional offer in argument)",
      "example": "내가 양보할 테니까 다음부턴 이러지 마.",
      "example_en": "I'll give in this time, so don't do this again next time."
    },
    {
      "korean": "차라리 ~는 게 낫다",
      "english": "It'd be better to just... (exasperated suggestion)",
      "example": "이렇게 매번 싸울 바에야 차라리 따로 사는 게 낫다.",
      "example_en": "If we're going to fight like this every time, we'd be better off living separately."
    },
    {
      "korean": "일단 좀 진정하고",
      "english": "First, calm down a bit, and then... (de-escalating)",
      "example": "일단 좀 진정하고 천천히 얘기하자.",
      "example_en": "Calm down first, and let's talk slowly."
    },
    {
      "korean": "그 정도면 됐지 뭘 더 바라",
      "english": "That's more than enough — what more do you want?",
      "example": "이만큼 해 줬으면 그 정도면 됐지 뭘 더 바라.",
      "example_en": "I've done this much for you — that's enough, what more do you want?"
    },
    {
      "korean": "논점을 흐리지 마",
      "english": "Don't muddy the point / Don't change the subject",
      "example": "갑자기 딴 얘기 꺼내지 마, 논점을 흐리지 마.",
      "example_en": "Don't suddenly bring up something else — don't muddy the point."
    },
    {
      "korean": "백 번 양보해서",
      "english": "Even conceding a hundred times over / Even giving the maximum benefit of the doubt",
      "example": "백 번 양보해서 네가 맞다 치더라도 방법이 잘못됐어.",
      "example_en": "Even giving you the maximum benefit of the doubt, the method was wrong."
    },
    {
      "korean": "그 얘기 혹시 들었어?",
      "english": "Did you happen to hear about that? (opening for gossip)",
      "example": "영업팀 그 얘기 혹시 들었어? 완전 난리래.",
      "example_en": "Did you hear about the sales team? Apparently it's total chaos."
    },
    {
      "korean": "걔 말로는",
      "english": "According to them / They say... (secondhand storytelling)",
      "example": "걔 말로는 회사에서 부당 대우를 받았대.",
      "example_en": "According to them, they were unfairly treated at the company."
    },
    {
      "korean": "이건 비밀인데",
      "english": "This is a secret, but... (preface to sharing gossip)",
      "example": "이건 비밀인데, 그 사람 이직 준비 중이래.",
      "example_en": "This is a secret, but they say that person is preparing to switch jobs."
    },
    {
      "korean": "나만 알고 있어",
      "english": "Keep this to yourself / Just between us",
      "example": "이거 나만 알고 있어, 아직 공식 발표 전이거든.",
      "example_en": "Keep this to yourself — it hasn't been officially announced yet."
    },
    {
      "korean": "장난이 아니었어",
      "english": "It was no joke / It was insane (emphasizing how extreme something was)",
      "example": "어제 거기 사람 수가 장난이 아니었어.",
      "example_en": "The number of people there yesterday was no joke."
    },
    {
      "korean": "알고 보니까",
      "english": "It turned out that... / As it turns out... (revealing a twist)",
      "example": "알고 보니까 둘이 이미 예전부터 알고 지낸 사이였어.",
      "example_en": "As it turned out, the two of them had already known each other for a while."
    },
    {
      "korean": "분위기가 심상치 않더라",
      "english": "The atmosphere was not ordinary / Something seemed off",
      "example": "회의실에서 나올 때 분위기가 심상치 않더라.",
      "example_en": "The atmosphere seemed off when they came out of the meeting room."
    },
    {
      "korean": "그 뒤로 완전 달라졌어",
      "english": "After that, they/it completely changed",
      "example": "그 사건 이후로 걔 성격이 그 뒤로 완전 달라졌어.",
      "example_en": "After that incident, their personality completely changed."
    },
    {
      "korean": "있을 수가 없는 일인데",
      "english": "It's something that shouldn't be possible / It's unbelievable (storytelling emphasis)",
      "example": "같은 날 같은 장소에서 만날 줄이야, 있을 수가 없는 일인데.",
      "example_en": "Meeting at the same place on the same day — that's something that shouldn't be possible."
    },
    {
      "korean": "내가 봐도 좀 심했어",
      "english": "Even from my perspective, it was a bit much",
      "example": "다른 사람이야 모르겠지만 내가 봐도 좀 심했어.",
      "example_en": "Others might disagree, but even from my perspective, it was a bit much."
    }
  ]
}