{
  "주제별 단어 — 문화 (Topic: Culture)": [
    {
      "korean": "제사",
      "english": "ancestral memorial rite; ceremony honoring deceased family members",
      "example": "명절 때마다 온 가족이 모여 제사를 지내는 것이 우리 집안의 전통이다.",
      "example_en": "It's our family tradition for everyone to gather and hold ancestral rites on every holiday."
    },
    {
      "korean": "차례",
      "english": "holiday ancestral rite (performed on Chuseok and Seollal, simpler than 제사)",
      "example": "설날 아침에 차례를 지낸 뒤에야 비로소 떡국을 먹을 수 있었다.",
      "example_en": "We could only eat tteokguk after performing the ancestral rite on the morning of Seollal."
    },
    {
      "korean": "세배",
      "english": "New Year's deep bow to elders, accompanied by well-wishes",
      "example": "아이들이 할머니께 세배를 드리고 세뱃돈을 받아서 좋아했다.",
      "example_en": "The children were happy to bow to grandmother and receive New Year's money."
    },
    {
      "korean": "돌잔치",
      "english": "first birthday celebration (traditional milestone party for a baby turning one)",
      "example": "요즘 돌잔치를 호텔에서 성대하게 하는 집이 많아졌다.",
      "example_en": "Lately, many families hold elaborate first birthday parties at hotels."
    },
    {
      "korean": "상견례",
      "english": "formal meeting between the families of a bride and groom before marriage",
      "example": "상견례 자리에서 양가 부모님이 처음 만나 인사를 나눴다.",
      "example_en": "At the formal family meeting, the parents of both families met and exchanged greetings for the first time."
    },
    {
      "korean": "폐백",
      "english": "traditional post-wedding ceremony where the bride bows to the groom's family",
      "example": "폐백 때 시어머니가 며느리에게 대추와 밤을 던져 주셨다.",
      "example_en": "During the pyebaek ceremony, the mother-in-law tossed dates and chestnuts to the bride."
    },
    {
      "korean": "덕담",
      "english": "words of blessing; well-wishes exchanged especially during the New Year",
      "example": "어른들이 새해 덕담을 건네시며 한 해의 건강과 행복을 빌어 주셨다.",
      "example_en": "The elders offered New Year blessings, wishing health and happiness for the year."
    },
    {
      "korean": "풍속",
      "english": "customs; folk traditions; cultural practices handed down through generations",
      "example": "한국에는 동지에 팥죽을 먹는 풍속이 예로부터 전해져 왔다.",
      "example_en": "In Korea, the custom of eating red bean porridge on the winter solstice has been passed down since ancient times."
    },
    {
      "korean": "한옥",
      "english": "traditional Korean house (wooden frame, ondol heated floors, tiled or thatched roof)",
      "example": "전주 한옥마을에 가면 잘 보존된 한옥을 직접 구경할 수 있다.",
      "example_en": "If you visit Jeonju Hanok Village, you can see well-preserved traditional Korean houses in person."
    },
    {
      "korean": "굿",
      "english": "shamanistic ritual; exorcism ceremony performed by a shaman (무당)",
      "example": "과거에는 마을에 재앙이 닥치면 무당을 불러 굿을 했다.",
      "example_en": "In the past, when disaster struck a village, they would call a shaman to perform a ritual."
    },
    {
      "korean": "시청률",
      "english": "viewership rating; TV audience share",
      "example": "그 드라마는 마지막 회에서 시청률 40%를 돌파하며 국민 드라마가 되었다.",
      "example_en": "That drama surpassed a 40% viewership rating in the final episode and became a national hit."
    },
    {
      "korean": "음원",
      "english": "digital music track/release; sound source",
      "example": "신곡이 공개되자마자 주요 음원 차트 1위를 휩쓸었다.",
      "example_en": "As soon as the new song was released, it swept the top of all major music charts."
    },
    {
      "korean": "역주행",
      "english": "reverse chart climbing; belated viral popularity of a song or content",
      "example": "2년 전에 나온 곡인데 최근 역주행하면서 다시 차트에 올랐다.",
      "example_en": "The song came out two years ago, but it recently went viral and climbed back up the charts."
    },
    {
      "korean": "편성",
      "english": "broadcast scheduling; programming arrangement of TV shows or radio",
      "example": "방송사 측에서 갑자기 편성을 변경해서 시청자들이 혼란스러워했다.",
      "example_en": "The broadcasting company suddenly changed the schedule, confusing the viewers."
    },
    {
      "korean": "결방",
      "english": "broadcast cancellation; preemption of a scheduled TV episode",
      "example": "선거 특집 방송 때문에 이번 주 드라마가 결방되었다.",
      "example_en": "This week's drama was preempted because of the special election broadcast."
    },
    {
      "korean": "흥행",
      "english": "box office success; commercial hit (film, performance, etc.)",
      "example": "그 영화는 개봉 첫 주에 관객 500만 명을 돌파하며 대흥행했다.",
      "example_en": "The film surpassed 5 million viewers in its opening week, becoming a massive box office hit."
    },
    {
      "korean": "대본",
      "english": "script; screenplay; written text for a performance or broadcast",
      "example": "배우가 촬영 전날까지 대본을 수십 번 읽으며 연기를 준비했다.",
      "example_en": "The actor prepared by reading the script dozens of times until the day before shooting."
    },
    {
      "korean": "회차",
      "english": "episode number; installment of a series (drama, webtoon, etc.)",
      "example": "그 웹툰은 회차가 200회를 넘겼는데도 인기가 식지 않고 있다.",
      "example_en": "That webtoon has surpassed 200 episodes and its popularity still hasn't faded."
    },
    {
      "korean": "출연료",
      "english": "appearance fee; talent fee paid to actors, performers, or guests",
      "example": "톱스타의 출연료가 회당 수억 원에 달한다는 소문이 돌았다.",
      "example_en": "Rumors circulated that the top star's appearance fee reached hundreds of millions of won per episode."
    },
    {
      "korean": "제작진",
      "english": "production crew; production team (of a film, drama, or show)",
      "example": "제작진이 현지 로케이션 촬영을 위해 한 달간 해외에 머물렀다.",
      "example_en": "The production crew stayed overseas for a month for on-location filming."
    },
    {
      "korean": "손맛",
      "english": "the personal touch in homemade cooking; 'taste from one's hands'",
      "example": "어머니의 손맛을 따라갈 수 있는 식당은 어디에도 없다.",
      "example_en": "No restaurant anywhere can match the homemade touch of my mother's cooking."
    },
    {
      "korean": "밑반찬",
      "english": "everyday side dishes prepared in bulk and stored in the fridge",
      "example": "주말마다 밑반찬을 여러 가지 만들어 놓으면 평일이 훨씬 수월하다.",
      "example_en": "If you prepare a variety of side dishes on the weekend, weekdays become much easier."
    },
    {
      "korean": "숙성",
      "english": "aging; fermentation; maturation (of food such as kimchi, meat, or cheese)",
      "example": "숙성시킨 김치로 찌개를 끓이면 맛이 훨씬 깊어진다.",
      "example_en": "If you make stew with well-aged kimchi, the flavor becomes much deeper."
    },
    {
      "korean": "담그다",
      "english": "to make/prepare fermented food (especially kimchi, doenjang, ganjang)",
      "example": "김장철이 되면 온 동네가 모여서 김치를 담그곤 했다.",
      "example_en": "When kimjang season arrived, the whole neighborhood would gather to make kimchi together."
    },
    {
      "korean": "곁들이다",
      "english": "to serve alongside; to accompany a main dish with a side or drink",
      "example": "삼겹살에 소주를 곁들이는 것이 한국의 대표적인 식문화 중 하나다.",
      "example_en": "Pairing soju with samgyeopsal is one of the most iconic aspects of Korean food culture."
    },
    {
      "korean": "회식",
      "english": "company dinner; work group gathering over food and drinks after hours",
      "example": "요즘 젊은 직장인들은 잦은 회식을 부담스러워하는 경우가 많다.",
      "example_en": "Nowadays, many young office workers find frequent company dinners burdensome."
    },
    {
      "korean": "맛집",
      "english": "popular restaurant known for great food; must-visit eatery",
      "example": "그 골목에 숨겨진 맛집이 있다는 소문을 듣고 일부러 찾아갔다.",
      "example_en": "I heard a rumor about a hidden gem of a restaurant in that alley and went out of my way to find it."
    },
    {
      "korean": "해장",
      "english": "hangover cure, especially by eating specific foods like soup the morning after drinking",
      "example": "술을 많이 마신 다음 날에는 뜨끈한 해장국 한 그릇이 최고다.",
      "example_en": "After a night of heavy drinking, nothing beats a bowl of hot hangover soup."
    },
    {
      "korean": "푸짐하다",
      "english": "to be generous in portion; plentiful and abundant (of food servings)",
      "example": "시골 밥집은 반찬도 푸짐하고 인심도 넉넉해서 자꾸 찾게 된다.",
      "example_en": "Countryside restaurants have generous portions and warm hospitality, so you keep going back."
    },
    {
      "korean": "입맛",
      "english": "appetite; personal taste preference in food",
      "example": "해외에 오래 살다 보면 한국 음식이 그리워서 입맛이 없어질 때가 있다.",
      "example_en": "After living abroad for a long time, there are times when you lose your appetite because you miss Korean food."
    },
    {
      "korean": "갑질",
      "english": "abuse of power; bullying by someone in a position of authority",
      "example": "갑질 논란이 불거지면서 해당 기업의 이미지에 큰 타격을 입었다.",
      "example_en": "As the power abuse controversy erupted, the company's image took a severe hit."
    },
    {
      "korean": "금수저",
      "english": "born into wealth; 'gold spoon' (metaphor for privileged upbringing)",
      "example": "금수저 논란은 한국 사회의 계층 고착화 문제를 여실히 반영한다.",
      "example_en": "The 'gold spoon' debate vividly reflects the problem of class rigidity in Korean society."
    },
    {
      "korean": "혼밥",
      "english": "eating alone (a growing social trend, especially among young adults)",
      "example": "혼밥 문화가 확산되면서 1인용 좌석을 마련한 식당이 늘어나고 있다.",
      "example_en": "As the solo dining trend spreads, more restaurants are setting up single-person seating."
    },
    {
      "korean": "혼술",
      "english": "drinking alone (a growing social trend reflecting changing lifestyles)",
      "example": "퇴근 후 편의점에서 혼술하는 직장인들을 흔히 볼 수 있다.",
      "example_en": "It's common to see office workers drinking alone at convenience stores after work."
    },
    {
      "korean": "소확행",
      "english": "small but certain happiness (coined term for valuing modest everyday pleasures)",
      "example": "소확행을 추구하는 사람들이 늘면서 취미 생활에 투자하는 비율도 높아졌다.",
      "example_en": "As more people pursue small but certain happiness, the proportion investing in hobbies has also increased."
    },
    {
      "korean": "칼퇴",
      "english": "leaving work right on time (sharp departure at quitting time; contrast with overtime culture)",
      "example": "최근 칼퇴 문화가 자리 잡으면서 야근을 강요하는 분위기가 많이 줄었다.",
      "example_en": "Recently, as the on-time departure culture has taken root, the pressure to work overtime has greatly decreased."
    },
    {
      "korean": "꼰대",
      "english": "condescending elder; out-of-touch authority figure who lectures and imposes old values",
      "example": "부하 직원에게 일방적으로 훈계만 하면 꼰대라는 소리를 듣기 쉽다.",
      "example_en": "If you only lecture subordinates one-sidedly, you'll easily be called a kkondae."
    },
    {
      "korean": "갑을관계",
      "english": "unequal power dynamic ('Party A vs Party B' relationship); hierarchical imbalance",
      "example": "하도급 업체들은 원청과의 갑을관계 때문에 불합리한 요구도 거절하기 어렵다.",
      "example_en": "Subcontractors find it hard to refuse unreasonable demands due to the power imbalance with the main contractor."
    },
    {
      "korean": "한",
      "english": "deep-seated resentment, sorrow, and longing (a uniquely Korean emotional concept)",
      "example": "판소리에는 한국인 특유의 한이 깊이 서려 있어 듣는 이의 마음을 울린다.",
      "example_en": "Pansori is deeply infused with the uniquely Korean sentiment of han, moving the hearts of listeners."
    },
    {
      "korean": "빨리빨리",
      "english": "hurry-hurry (cultural trait emphasizing speed and urgency in Korean society)",
      "example": "한국의 빨리빨리 문화 덕분에 인터넷 속도와 배달 서비스가 세계적 수준이 되었다.",
      "example_en": "Thanks to Korea's hurry-hurry culture, internet speed and delivery services have reached world-class levels."
    }
  ]
}
