{
  "주제별 단어 — 환경 (Topic: Environment)": [
    {
      "korean": "기후변화",
      "english": "climate change",
      "example": "기후변화로 인해 전 세계적으로 해수면이 상승하고 있다.",
      "example_en": "Sea levels are rising globally due to climate change."
    },
    {
      "korean": "폭염",
      "english": "heatwave; extreme heat",
      "example": "올여름 폭염이 기승을 부려 온열 질환자가 급증했다.",
      "example_en": "The heatwave raged this summer, causing a surge in heat-related illnesses."
    },
    {
      "korean": "한파",
      "english": "cold wave; cold snap",
      "example": "갑작스러운 한파에 수도관이 얼어붙는 피해가 속출했다.",
      "example_en": "The sudden cold wave caused widespread damage from frozen water pipes."
    },
    {
      "korean": "가뭄",
      "english": "drought",
      "example": "장기간 가뭄이 이어지면서 농작물 피해가 심각해졌다.",
      "example_en": "Prolonged drought has caused severe damage to crops."
    },
    {
      "korean": "홍수",
      "english": "flood",
      "example": "집중호우로 하천이 범람하여 대규모 홍수가 발생했다.",
      "example_en": "Heavy rainfall caused rivers to overflow, resulting in a large-scale flood."
    },
    {
      "korean": "장마",
      "english": "monsoon season; rainy season",
      "example": "올해 장마가 예년보다 열흘이나 길어져 일상생활에 불편이 컸다.",
      "example_en": "This year's rainy season lasted ten days longer than usual, causing major inconvenience."
    },
    {
      "korean": "태풍",
      "english": "typhoon",
      "example": "초강력 태풍이 북상 중이라 해안 지역에 대피 명령이 내려졌다.",
      "example_en": "A super typhoon is heading north, and an evacuation order has been issued for coastal areas."
    },
    {
      "korean": "이상기후",
      "english": "abnormal weather; climate anomaly",
      "example": "최근 이상기후가 잦아지면서 기상 예측이 점점 어려워지고 있다.",
      "example_en": "With abnormal weather becoming more frequent, weather prediction is getting increasingly difficult."
    },
    {
      "korean": "강수량",
      "english": "precipitation; rainfall amount",
      "example": "이번 달 강수량이 평년 대비 두 배를 넘었다.",
      "example_en": "This month's precipitation exceeded twice the annual average."
    },
    {
      "korean": "온난화",
      "english": "global warming",
      "example": "지구 온난화를 막기 위해 국제 사회가 공동으로 대응해야 한다.",
      "example_en": "The international community must respond collectively to prevent global warming."
    },
    {
      "korean": "미세먼지",
      "english": "fine dust; particulate matter (PM)",
      "example": "미세먼지 농도가 '매우 나쁨' 수준이라 외출을 자제해야 한다.",
      "example_en": "The fine dust concentration is at a 'very bad' level, so you should refrain from going outside."
    },
    {
      "korean": "대기오염",
      "english": "air pollution",
      "example": "공장 밀집 지역의 대기오염이 주민 건강을 심각하게 위협하고 있다.",
      "example_en": "Air pollution in industrial areas is seriously threatening residents' health."
    },
    {
      "korean": "수질오염",
      "english": "water pollution",
      "example": "불법 폐수 방류로 인한 수질오염이 심각한 사회 문제로 대두되었다.",
      "example_en": "Water pollution from illegal wastewater discharge has emerged as a serious social issue."
    },
    {
      "korean": "폐수",
      "english": "wastewater; sewage",
      "example": "정화 처리를 거치지 않은 폐수가 하천에 그대로 유입되었다.",
      "example_en": "Untreated wastewater flowed directly into the river."
    },
    {
      "korean": "매립지",
      "english": "landfill",
      "example": "수도권 매립지가 곧 포화 상태에 이를 것으로 예상된다.",
      "example_en": "The metropolitan area landfill is expected to reach capacity soon."
    },
    {
      "korean": "자연보호",
      "english": "nature conservation; environmental protection",
      "example": "자연보호는 미래 세대를 위한 우리 모두의 책임이다.",
      "example_en": "Nature conservation is the responsibility of all of us for future generations."
    },
    {
      "korean": "보호종",
      "english": "protected species; endangered species",
      "example": "반달가슴곰은 한국에서 천연기념물로 지정된 보호종이다.",
      "example_en": "The Asiatic black bear is a protected species designated as a natural monument in Korea."
    },
    {
      "korean": "남획",
      "english": "overfishing; overharvesting",
      "example": "무분별한 남획으로 근해 어족 자원이 급격히 줄어들었다.",
      "example_en": "Indiscriminate overfishing has drastically reduced coastal fish stocks."
    },
    {
      "korean": "산성비",
      "english": "acid rain",
      "example": "산성비는 토양의 산도를 높여 삼림을 황폐화시킨다.",
      "example_en": "Acid rain increases soil acidity and devastates forests."
    },
    {
      "korean": "유해물질",
      "english": "hazardous substance; toxic material",
      "example": "공장에서 유해물질이 유출되어 인근 주민들이 긴급 대피했다.",
      "example_en": "Hazardous substances leaked from the factory, forcing nearby residents to evacuate."
    },
    {
      "korean": "습지",
      "english": "wetland",
      "example": "습지는 다양한 생물이 서식하는 생태적으로 매우 중요한 공간이다.",
      "example_en": "Wetlands are ecologically vital spaces where a wide variety of organisms live."
    },
    {
      "korean": "빙하",
      "english": "glacier",
      "example": "극지방의 빙하가 빠르게 녹으면서 해수면 상승이 가속화되고 있다.",
      "example_en": "Glaciers in polar regions are melting rapidly, accelerating sea level rise."
    },
    {
      "korean": "해류",
      "english": "ocean current",
      "example": "해류의 변화는 전 세계 기후 패턴에 큰 영향을 미친다.",
      "example_en": "Changes in ocean currents have a major impact on global climate patterns."
    },
    {
      "korean": "산맥",
      "english": "mountain range",
      "example": "태백산맥은 한반도의 동쪽을 남북으로 관통하는 주요 산맥이다.",
      "example_en": "The Taebaek Mountains are a major mountain range running north-south through the eastern Korean Peninsula."
    },
    {
      "korean": "고원",
      "english": "plateau; highland",
      "example": "개마고원은 한반도에서 가장 넓고 높은 고원 지대이다.",
      "example_en": "The Gaema Plateau is the largest and highest plateau on the Korean Peninsula."
    },
    {
      "korean": "열대우림",
      "english": "tropical rainforest",
      "example": "열대우림은 '지구의 허파'라 불릴 만큼 산소 생산에 중요한 역할을 한다.",
      "example_en": "Tropical rainforests play such a crucial role in oxygen production that they are called the 'lungs of the Earth.'"
    },
    {
      "korean": "사막화",
      "english": "desertification",
      "example": "과도한 방목과 벌목이 사막화를 가속시키는 주된 원인이다.",
      "example_en": "Excessive grazing and logging are the main causes accelerating desertification."
    },
    {
      "korean": "삼림",
      "english": "forest; woodland",
      "example": "전 세계적으로 삼림 면적이 해마다 줄어들고 있어 우려가 크다.",
      "example_en": "There is growing concern as forest area is shrinking year after year worldwide."
    },
    {
      "korean": "하천",
      "english": "river; stream; waterway",
      "example": "하천 정비 사업으로 수질이 개선되고 주변 생태계가 회복되었다.",
      "example_en": "The river restoration project improved water quality and helped the surrounding ecosystem recover."
    },
    {
      "korean": "해안",
      "english": "coast; shoreline",
      "example": "해안 침식이 심해져서 방파제를 추가로 설치해야 할 상황이다.",
      "example_en": "Coastal erosion has worsened to the point where additional breakwaters need to be installed."
    },
    {
      "korean": "신재생에너지",
      "english": "renewable energy",
      "example": "정부는 신재생에너지 비중을 2030년까지 30%로 높이겠다고 발표했다.",
      "example_en": "The government announced it will raise the share of renewable energy to 30% by 2030."
    },
    {
      "korean": "탄소중립",
      "english": "carbon neutrality; net zero",
      "example": "한국은 2050년까지 탄소중립을 달성하겠다는 목표를 세웠다.",
      "example_en": "Korea has set a goal to achieve carbon neutrality by 2050."
    },
    {
      "korean": "지속가능성",
      "english": "sustainability",
      "example": "기업들이 수익보다 지속가능성을 우선시하는 경영 방식으로 전환하고 있다.",
      "example_en": "Companies are shifting to management approaches that prioritize sustainability over profits."
    },
    {
      "korean": "친환경",
      "english": "eco-friendly; environmentally friendly",
      "example": "소비자들의 친환경 제품에 대한 수요가 꾸준히 증가하고 있다.",
      "example_en": "Consumer demand for eco-friendly products is steadily increasing."
    },
    {
      "korean": "온실가스",
      "english": "greenhouse gas",
      "example": "온실가스 감축을 위해 각국이 다양한 정책을 시행하고 있다.",
      "example_en": "Countries are implementing various policies to reduce greenhouse gas emissions."
    },
    {
      "korean": "순환경제",
      "english": "circular economy",
      "example": "순환경제 모델은 폐기물을 자원으로 재활용하는 것을 핵심으로 한다.",
      "example_en": "The circular economy model is centered on recycling waste into resources."
    },
    {
      "korean": "생태발자국",
      "english": "ecological footprint",
      "example": "한 사람의 생태발자국을 줄이려면 에너지 소비를 의식적으로 줄여야 한다.",
      "example_en": "To reduce one's ecological footprint, one must consciously cut energy consumption."
    },
    {
      "korean": "자원 고갈",
      "english": "resource depletion",
      "example": "화석 연료의 자원 고갈 문제가 대체 에너지 개발을 촉진하고 있다.",
      "example_en": "The issue of fossil fuel resource depletion is driving the development of alternative energy."
    },
    {
      "korean": "녹색성장",
      "english": "green growth",
      "example": "녹색성장은 환경 보전과 경제 발전을 동시에 추구하는 전략이다.",
      "example_en": "Green growth is a strategy that pursues environmental conservation and economic development simultaneously."
    },
    {
      "korean": "재활용",
      "english": "recycling",
      "example": "분리수거를 철저히 하면 재활용률을 크게 높일 수 있다.",
      "example_en": "Thorough waste separation can significantly increase the recycling rate."
    }
  ]
}
