{
  "주제별 단어 — 무용/댄스 (Topic: Dance)": [
    {
      "korean": "무용",
      "english": "dance (art form)",
      "example": "현대 무용은 전통 무용과 다른 새로운 표현 방식을 추구한다.",
      "example_en": "Contemporary dance pursues new modes of expression different from traditional dance."
    },
    {
      "korean": "발레",
      "english": "ballet",
      "example": "발레는 유럽에서 유래한 고전 무용 형식이다.",
      "example_en": "Ballet is a classical dance form that originated in Europe."
    },
    {
      "korean": "현대무용",
      "english": "contemporary dance",
      "example": "현대무용 공연에서는 전통적인 음악 대신 실험적인 사운드를 사용하기도 한다.",
      "example_en": "In contemporary dance performances, experimental sounds are sometimes used instead of traditional music."
    },
    {
      "korean": "전통무용",
      "english": "traditional dance",
      "example": "한국의 전통무용은 우리 민족의 정서와 역사를 담고 있다.",
      "example_en": "Korean traditional dance embodies the emotions and history of our people."
    },
    {
      "korean": "부채춤",
      "english": "fan dance",
      "example": "부채춤은 우아한 동작과 선명한 라인으로 매력적인 한국 전통무용이다.",
      "example_en": "Fan dance is a charming Korean traditional dance characterized by graceful movements and sharp lines."
    },
    {
      "korean": "탈춤",
      "english": "mask dance",
      "example": "탈춤은 여러 등장인물들이 탈을 쓰고 벌이는 민속 공연 형태다.",
      "example_en": "Mask dance is a folk performance form where various characters wear masks."
    },
    {
      "korean": "사물놀이",
      "english": "nongak (Korean percussion performance)",
      "example": "사물놀이는 징, 장고, 북, 꽹과리 네 가지 악기로 이루어진 한국 전통 공연 예술이다.",
      "example_en": "Nongak is a traditional Korean performance art consisting of four instruments: jing, janggu, buk, and kkwaenggwari."
    },
    {
      "korean": "안무",
      "english": "choreography",
      "example": "이번 공연의 안무는 전통 동작과 현대적 움직임을 조화시켰다.",
      "example_en": "The choreography of this performance harmonizes traditional movements with modern motion."
    },
    {
      "korean": "안무가",
      "english": "choreographer",
      "example": "그 유명한 안무가는 수십 년 동안 무용 예술의 발전에 기여해 왔다.",
      "example_en": "That renowned choreographer has contributed to the development of dance art for decades."
    },
    {
      "korean": "리허설",
      "english": "rehearsal",
      "example": "공연 전에는 무용수들이 매일 리허설을 통해 완벽함을 기한다.",
      "example_en": "Before a performance, dancers rehearse daily to achieve perfection."
    },
    {
      "korean": "공연",
      "english": "performance/show",
      "example": "그 무용단의 공연은 매 회 표가 다 팔려나갈 정도로 인기가 많다.",
      "example_en": "That dance company's performances are so popular that tickets sell out every time."
    },
    {
      "korean": "무대",
      "english": "stage",
      "example": "무대 위에서 무용수는 모든 것을 잊고 순수하게 춤에 집중해야 한다.",
      "example_en": "On stage, a dancer must forget everything and focus purely on dancing."
    },
    {
      "korean": "무용수",
      "english": "dancer (professional)",
      "example": "그 무용수는 발레 국제 대회에서 여러 번 수상했다.",
      "example_en": "That dancer has won awards multiple times at international ballet competitions."
    },
    {
      "korean": "동작",
      "english": "movement/motion",
      "example": "이 안무의 특징은 빠른 동작과 느린 동작이 극명하게 대비되는 것이다.",
      "example_en": "The characteristic of this choreography is the stark contrast between fast and slow movements."
    },
    {
      "korean": "스텝",
      "english": "step (dancing movement)",
      "example": "발레의 기본 스텝들을 마스터하는 데 수년이 걸린다.",
      "example_en": "It takes years to master the basic steps of ballet."
    },
    {
      "korean": "포즈",
      "english": "pose",
      "example": "마지막 포즈를 우아하게 결정하는 것이 무용 공연의 성공을 좌우한다.",
      "example_en": "Gracefully concluding with a final pose determines the success of a dance performance."
    },
    {
      "korean": "균형",
      "english": "balance",
      "example": "무용수의 신체 균형감각은 끊임없는 연습으로 향상된다.",
      "example_en": "A dancer's sense of physical balance improves through continuous practice."
    },
    {
      "korean": "회전",
      "english": "spin/rotation",
      "example": "발레에서 회전 기술은 무용수의 실력을 평가하는 중요한 요소다.",
      "example_en": "In ballet, spinning technique is an important factor in evaluating a dancer's skill."
    },
    {
      "korean": "점프",
      "english": "jump",
      "example": "높은 점프를 안정적으로 착지하는 것은 발레 기본기 중 하나다.",
      "example_en": "Landing a high jump stably is one of the fundamentals of ballet."
    },
    {
      "korean": "착지",
      "english": "landing",
      "example": "점프 후 착지할 때 무릎을 부드럽게 굽혀서 충격을 흡수해야 한다.",
      "example_en": "When landing after a jump, you must bend your knees gently to absorb impact."
    },
    {
      "korean": "리듬",
      "english": "rhythm",
      "example": "무용은 음악의 리듬에 완벽하게 동조되어야 한다.",
      "example_en": "Dance must be perfectly synchronized with the rhythm of music."
    },
    {
      "korean": "템포",
      "english": "tempo",
      "example": "템포가 빨라질수록 무용수는 더욱 강렬한 표현이 필요하다.",
      "example_en": "As the tempo increases, dancers need more intense expression."
    },
    {
      "korean": "박자",
      "english": "beat/measure",
      "example": "박자를 놓치지 않고 춤을 추려면 음악을 귀로 정확히 감지해야 한다.",
      "example_en": "To dance without missing the beat, you must accurately perceive the music with your ears."
    },
    {
      "korean": "음악",
      "english": "music",
      "example": "현대무용에서는 클래식 음악뿐만 아니라 다양한 장르의 음악이 사용된다.",
      "example_en": "Contemporary dance uses not only classical music but also various music genres."
    },
    {
      "korean": "의상",
      "english": "costume",
      "example": "무용 공연의 의상은 작품의 주제와 분위기를 효과적으로 전달한다.",
      "example_en": "Dance costumes effectively convey the theme and atmosphere of the work."
    },
    {
      "korean": "분장",
      "english": "makeup",
      "example": "전통무용 공연에서는 분장이 무용수의 표정을 더욱 극적으로 만든다.",
      "example_en": "In traditional dance performances, makeup makes the dancer's expressions more dramatic."
    },
    {
      "korean": "조명",
      "english": "lighting",
      "example": "조명의 변화는 무용 공연의 감정적 효과를 크게 높인다.",
      "example_en": "Changes in lighting greatly enhance the emotional effect of dance performances."
    },
    {
      "korean": "음향",
      "english": "sound system/acoustics",
      "example": "공연장의 음향이 좋아야 무용수들이 음악에 제대로 맞춰 춤을 출 수 있다.",
      "example_en": "Good acoustics in the venue allow dancers to properly synchronize with the music."
    },
    {
      "korean": "무대장치",
      "english": "stage set/scenery",
      "example": "창의적인 무대장치는 무용 공연을 더욱 인상적으로 만든다.",
      "example_en": "Creative stage sets make dance performances even more impressive."
    },
    {
      "korean": "유연성",
      "english": "flexibility",
      "example": "무용수들은 몸의 유연성을 늘리기 위해 매일 스트레칭을 한다.",
      "example_en": "Dancers stretch daily to increase their body's flexibility."
    },
    {
      "korean": "표현력",
      "english": "expressiveness",
      "example": "좋은 무용수는 뛰어난 기술뿐만 아니라 풍부한 표현력을 가져야 한다.",
      "example_en": "A good dancer must have not only excellent technique but also rich expressiveness."
    },
    {
      "korean": "우아함",
      "english": "grace/elegance",
      "example": "발레의 특징은 모든 동작에서 우아함을 유지하는 것이다.",
      "example_en": "The characteristic of ballet is maintaining grace in all movements."
    },
    {
      "korean": "자세",
      "english": "posture",
      "example": "올바른 자세는 무용 기초 훈련의 첫 번째 단계다.",
      "example_en": "Correct posture is the first step in basic dance training."
    },
    {
      "korean": "기본 동작",
      "english": "basic movement",
      "example": "모든 무용 스타일을 배우기 전에 기본 동작부터 완벽하게 익혀야 한다.",
      "example_en": "Before learning any dance style, you must first master the basic movements perfectly."
    },
    {
      "korean": "발레화",
      "english": "ballet shoes",
      "example": "발레화의 발끝은 특별한 처리가 되어 있어 무용수가 발끝으로 설 수 있게 한다.",
      "example_en": "Ballet shoes have special construction at the toe allowing dancers to stand on their toes."
    },
    {
      "korean": "튀튀",
      "english": "tutu",
      "example": "튀튀 스커트의 길이는 발레 작품의 종류에 따라 달라진다.",
      "example_en": "The length of a tutu skirt varies depending on the type of ballet piece."
    },
    {
      "korean": "무용 치료",
      "english": "dance therapy",
      "example": "무용 치료는 신체와 정신 건강을 동시에 개선하는 효과적인 방법이다.",
      "example_en": "Dance therapy is an effective method for improving both physical and mental health."
    },
    {
      "korean": "경연대회",
      "english": "competition/contest",
      "example": "국제 무용 경연대회에 참가하는 것은 무용수의 경력에 중요한 이정표가 된다.",
      "example_en": "Participating in international dance competitions is an important milestone in a dancer's career."
    },
    {
      "korean": "무용단",
      "english": "dance company/troupe",
      "example": "그 무용단은 전통무용과 현대무용을 모두 공연하는 것으로 유명하다.",
      "example_en": "That dance company is known for performing both traditional and contemporary dance."
    },
    {
      "korean": "움직임",
      "english": "movement",
      "example": "무용수의 부드러운 움직임이 관객들을 매료시킨다.",
      "example_en": "The graceful movements of dancers captivate the audience."
    }
  ]
}
