{
  "주제별 단어 — 부동산 (Topic: Real Estate)": [
    {
      "korean": "부동산",
      "english": "real estate",
      "example": "이 회사는 부동산 투자로 큰 수익을 올리고 있습니다.",
      "example_en": "This company is making significant profit through real estate investment."
    },
    {
      "korean": "전세",
      "english": "jeonse (long-term lease with lump-sum deposit)",
      "example": "서울에서 전세 계약을 할 때는 보증금이 매우 높은 편입니다.",
      "example_en": "When signing a jeonse contract in Seoul, the deposit is typically quite high."
    },
    {
      "korean": "월세",
      "english": "monthly rent",
      "example": "이 아파트의 월세는 50만 원이고 보증금은 1000만 원입니다.",
      "example_en": "This apartment costs 500,000 won in monthly rent and has a 10 million won deposit."
    },
    {
      "korean": "보증금",
      "english": "security deposit",
      "example": "계약 만료 후 보증금이 온전하지 않으면 법적 분쟁이 생길 수 있습니다.",
      "example_en": "If the security deposit is not returned in full after the contract expires, legal disputes can arise."
    },
    {
      "korean": "전세금",
      "english": "jeonse deposit",
      "example": "전세금으로 2억 원을 빌려주는 조건의 계약을 찾고 있습니다.",
      "example_en": "I'm looking for a contract where someone lends 200 million won as a jeonse deposit."
    },
    {
      "korean": "관리비",
      "english": "management/maintenance fee",
      "example": "관리비에는 난방비, 수도비, 청소비 등이 포함됩니다.",
      "example_en": "The management fee includes heating, water, and cleaning costs."
    },
    {
      "korean": "담보",
      "english": "collateral",
      "example": "은행에서 대출을 받으려면 부동산을 담보로 제시해야 합니다.",
      "example_en": "To get a loan from a bank, you must provide real estate as collateral."
    },
    {
      "korean": "담보대출",
      "english": "secured loan; mortgage",
      "example": "담보대출의 이자율은 신용대출보다 훨씬 낮습니다.",
      "example_en": "The interest rate on a secured loan is much lower than on an unsecured loan."
    },
    {
      "korean": "이자율",
      "english": "interest rate",
      "example": "중앙은행이 기준금리를 인상하면서 대출 이자율도 올랐습니다.",
      "example_en": "As the central bank raised the base rate, loan interest rates also increased."
    },
    {
      "korean": "원금",
      "english": "principal",
      "example": "이 대출에서 원금은 1억 원이고 이자는 월 50만 원입니다.",
      "example_en": "In this loan, the principal is 100 million won and the monthly interest is 500,000 won."
    },
    {
      "korean": "상환",
      "english": "repayment",
      "example": "대출금 상환 일정을 미리 확인하는 것이 중요합니다.",
      "example_en": "It's important to check the loan repayment schedule in advance."
    },
    {
      "korean": "계약서",
      "english": "contract",
      "example": "부동산 거래 시에는 반드시 법적 계약서를 작성해야 합니다.",
      "example_en": "When conducting a real estate transaction, a proper contract must always be prepared."
    },
    {
      "korean": "계약금",
      "english": "earnest money; down payment",
      "example": "계약금으로 보통 구매가의 10% 정도를 지불합니다.",
      "example_en": "Earnest money typically amounts to about 10% of the purchase price."
    },
    {
      "korean": "중개수수료",
      "english": "brokerage fee",
      "example": "중개수수료는 매수자와 매도자가 각각 0.5%씩 부담하는 것이 일반적입니다.",
      "example_en": "It's common for the buyer and seller to each pay 0.5% of the transaction price as brokerage fee."
    },
    {
      "korean": "공인중개인",
      "english": "licensed real estate agent",
      "example": "신뢰할 수 있는 공인중개인을 찾아 거래를 진행하는 것이 좋습니다.",
      "example_en": "It's wise to find a trustworthy licensed real estate agent to conduct the transaction."
    },
    {
      "korean": "감정가",
      "english": "appraised value",
      "example": "은행 대출 심사 시 감정가가 실제 거래가보다 낮으면 문제가 될 수 있습니다.",
      "example_en": "If the appraised value is lower than the actual transaction price during bank loan review, it can be problematic."
    },
    {
      "korean": "시세",
      "english": "market price; going rate",
      "example": "최근 이 지역의 부동산 시세가 많이 올랐습니다.",
      "example_en": "The market price of real estate in this area has risen significantly recently."
    },
    {
      "korean": "감정평가사",
      "english": "appraiser",
      "example": "부동산 거래 전에 공인된 감정평가사의 평가를 받아야 합니다.",
      "example_en": "Before a real estate transaction, you must get an evaluation from a certified appraiser."
    },
    {
      "korean": "매도",
      "english": "selling",
      "example": "집값이 오를 때까지 기다렸다가 나중에 매도하려고 합니다.",
      "example_en": "I'm planning to wait for the property value to increase before selling it later."
    },
    {
      "korean": "매수",
      "english": "buying; purchase",
      "example": "좋은 조건의 아파트를 매수할 기회가 있으면 놓치지 말아야 합니다.",
      "example_en": "If there's an opportunity to purchase an apartment at good terms, you shouldn't miss it."
    },
    {
      "korean": "거래",
      "english": "transaction; deal",
      "example": "부동산 거래는 매우 신중하게 진행해야 하는 중요한 일입니다.",
      "example_en": "A real estate transaction is an important matter that must be handled very carefully."
    },
    {
      "korean": "등기부등본",
      "english": "property registry certificate",
      "example": "매매 계약 전에 등기부등본을 확인해서 소유권과 저당권을 확인합니다.",
      "example_en": "Before signing a purchase contract, check the property registry to verify ownership and liens."
    },
    {
      "korean": "확정일자",
      "english": "confirmed date stamp",
      "example": "전세 계약 후 확정일자를 받으면 대항력이 생깁니다.",
      "example_en": "After signing a jeonse contract and receiving a confirmed date stamp, you gain priority rights."
    },
    {
      "korean": "건면적",
      "english": "gross floor area",
      "example": "이 건물의 건면적은 500평입니다.",
      "example_en": "The gross floor area of this building is 500 pyeong (approximately 1,650 square meters)."
    },
    {
      "korean": "전용면적",
      "english": "usable floor area; living space",
      "example": "전용면적이 80평인 아파트를 찾고 있습니다.",
      "example_en": "I'm looking for an apartment with a usable floor area of 80 pyeong."
    },
    {
      "korean": "대지",
      "english": "land; plot",
      "example": "이 주택의 대지 면적은 150평입니다.",
      "example_en": "The land area of this house is 150 pyeong."
    },
    {
      "korean": "인테리어",
      "english": "interior design; interior renovation",
      "example": "새로 구입한 아파트의 인테리어 공사를 시작하려고 합니다.",
      "example_en": "I'm planning to start interior renovation work on the newly purchased apartment."
    },
    {
      "korean": "개축",
      "english": "reconstruction; rebuilding of a building",
      "example": "낡은 건물을 개축하기 위해서는 많은 인허가 절차가 필요합니다.",
      "example_en": "Many permits and procedures are required to reconstruct an old building."
    },
    {
      "korean": "단독주택",
      "english": "detached house; single-family home",
      "example": "단독주택은 아파트보다 개인 정원이 있다는 장점이 있습니다.",
      "example_en": "A detached house has the advantage of having a private garden compared to apartments."
    },
    {
      "korean": "연립주택",
      "english": "townhouse; row house",
      "example": "연립주택은 아파트보다 저렴하고 단독주택보다는 관리비가 싼 편입니다.",
      "example_en": "Townhouses are cheaper than apartments and have lower maintenance fees than detached houses."
    },
    {
      "korean": "아파트",
      "english": "apartment",
      "example": "한국에서는 아파트가 가장 인기 있는 주거 형태입니다.",
      "example_en": "In Korea, apartments are the most popular form of housing."
    },
    {
      "korean": "오피스텔",
      "english": "officetel (office + residential hybrid)",
      "example": "오피스텔은 주거와 사무 공간을 함께 할 수 있어서 자영업자들이 많이 선호합니다.",
      "example_en": "Officetels are preferred by self-employed people because they can use them for both living and work."
    },
    {
      "korean": "상가",
      "english": "commercial space; shop",
      "example": "1층 상가는 높은 임차료로 인해 임차인이 자주 바뀝니다.",
      "example_en": "Due to high rents, commercial spaces on the first floor have tenants that change frequently."
    },
    {
      "korean": "주택담보대출",
      "english": "home loan; mortgage",
      "example": "주택담보대출의 금리는 신용등급에 따라 달라집니다.",
      "example_en": "The interest rate on a home loan varies depending on credit rating."
    },
    {
      "korean": "용적률",
      "english": "floor area ratio; FAR",
      "example": "이 지역의 용적률이 높으면 더 큰 건물을 지을 수 있습니다.",
      "example_en": "If the floor area ratio in this area is high, larger buildings can be constructed."
    },
    {
      "korean": "건폐율",
      "english": "building coverage ratio",
      "example": "건폐율 제한으로 인해 땅의 일부는 건물을 지을 수 없습니다.",
      "example_en": "Due to building coverage ratio restrictions, you cannot build on a portion of the land."
    },
    {
      "korean": "재산세",
      "english": "property tax",
      "example": "재산세는 부동산 소유자가 매년 내야 하는 의무입니다.",
      "example_en": "Property tax is an annual obligation that property owners must pay."
    },
    {
      "korean": "양도소득세",
      "english": "capital gains tax",
      "example": "부동산을 판매할 때 양도소득세를 내야 하는지 확인해야 합니다.",
      "example_en": "You should check if you need to pay capital gains tax when selling real estate."
    },
    {
      "korean": "취득세",
      "english": "acquisition tax",
      "example": "부동산을 매입할 때 취득세를 내야 합니다.",
      "example_en": "You must pay acquisition tax when purchasing real estate."
    },
    {
      "korean": "등록세",
      "english": "registration tax",
      "example": "부동산 거래를 완료하려면 등록세를 내고 등기를 해야 합니다.",
      "example_en": "To complete a real estate transaction, you must pay the registration tax and register the property."
    },
    {
      "korean": "용도지역",
      "english": "zoning district; land use zone",
      "example": "주택 건설을 원한다면 먼저 그 토지의 용도지역을 확인해야 합니다.",
      "example_en": "If you want to build a house, you must first check the zoning district of the land."
    }
  ]
}
