{
  "격식 & 문어체 (Formal & Written)": [
    {
      "korean": "안건을 상정하다",
      "english": "to bring an item/agenda to the table; to submit an agenda item",
      "example": "이번 이사회에서 신규 사업 안건을 상정할 예정입니다.",
      "example_en": "We plan to bring the new business agenda item to the table at this board meeting."
    },
    {
      "korean": "회의록을 작성하다",
      "english": "to prepare the meeting minutes",
      "example": "총무부에서 금일 회의록을 작성하여 배포해 주시기 바랍니다.",
      "example_en": "The general affairs department is requested to prepare and distribute today's meeting minutes."
    },
    {
      "korean": "결재를 상신하다",
      "english": "to submit (a document) for approval",
      "example": "출장 경비에 대한 결재를 상신하였으나 아직 승인되지 않았습니다.",
      "example_en": "The approval request for travel expenses was submitted, but it has not yet been approved."
    },
    {
      "korean": "업무를 인수인계하다",
      "english": "to hand over duties; to transfer responsibilities",
      "example": "퇴직 전에 후임자에게 업무를 인수인계해야 합니다.",
      "example_en": "You must hand over your duties to your successor before leaving the company."
    },
    {
      "korean": "~을/를 경유하여",
      "english": "via; by way of; through (the channel of)",
      "example": "모든 대외 문서는 법무팀을 경유하여 발송해야 합니다.",
      "example_en": "All external documents must be sent via the legal team."
    },
    {
      "korean": "계약을 체결하다",
      "english": "to conclude/enter into a contract",
      "example": "양사는 3년간의 공급 계약을 체결하였다.",
      "example_en": "Both companies concluded a three-year supply contract."
    },
    {
      "korean": "실적을 보고하다",
      "english": "to report on performance/results",
      "example": "분기별 실적을 보고하는 자리를 마련하겠습니다.",
      "example_en": "We will arrange an occasion to report on quarterly performance."
    },
    {
      "korean": "~에 착수하다",
      "english": "to commence; to embark on; to undertake",
      "example": "내년 초 신규 프로젝트에 착수할 계획입니다.",
      "example_en": "We plan to commence the new project at the beginning of next year."
    },
    {
      "korean": "~을/를 일임하다",
      "english": "to entrust entirely; to delegate fully",
      "example": "세부 일정은 실무진에 일임하기로 결정하였습니다.",
      "example_en": "It has been decided to fully delegate the detailed schedule to the working-level staff."
    },
    {
      "korean": "계약을 해지하다",
      "english": "to terminate/cancel a contract",
      "example": "상대 측의 계약 위반으로 인해 계약을 해지하기로 하였다.",
      "example_en": "Due to the other party's breach of contract, it was decided to terminate the contract."
    },
    {
      "korean": "~에 대한 검토를 요청하다",
      "english": "to request a review of",
      "example": "해당 조항에 대한 법률 검토를 요청드립니다.",
      "example_en": "I request a legal review of the relevant clause."
    },
    {
      "korean": "협의를 거치다",
      "english": "to go through consultation/deliberation",
      "example": "관련 부서와 충분한 협의를 거친 후에 시행하겠습니다.",
      "example_en": "We will implement it after going through sufficient consultation with the relevant departments."
    },
    {
      "korean": "~을/를 양해해 주시기 바랍니다",
      "english": "I ask for your understanding regarding",
      "example": "공사로 인한 소음에 대해 양해해 주시기 바랍니다.",
      "example_en": "I ask for your understanding regarding the noise from the construction work."
    },
    {
      "korean": "귀사",
      "english": "your esteemed company (honorific in business correspondence)",
      "example": "귀사의 무궁한 발전을 기원합니다.",
      "example_en": "We wish for the boundless growth of your esteemed company."
    },
    {
      "korean": "폐사",
      "english": "our humble company (humble form in business correspondence)",
      "example": "폐사에서는 귀사의 제안을 적극 검토하겠습니다.",
      "example_en": "Our company will actively review your esteemed company's proposal."
    },
    {
      "korean": "~을/를 이행하다",
      "english": "to fulfill; to carry out; to perform (obligations)",
      "example": "계약상의 의무를 성실히 이행해야 합니다.",
      "example_en": "Contractual obligations must be faithfully fulfilled."
    },
    {
      "korean": "채산성이 맞지 않다",
      "english": "to not be cost-effective; to not be profitable",
      "example": "현재 시장 상황에서는 채산성이 맞지 않아 사업 철수를 검토 중이다.",
      "example_en": "Given the current market conditions, it is not cost-effective, and we are reviewing withdrawal from the business."
    },
    {
      "korean": "~에 관해 회신 부탁드립니다",
      "english": "I kindly request a reply regarding",
      "example": "견적서에 관해 이번 주 내로 회신 부탁드립니다.",
      "example_en": "I kindly request a reply regarding the quotation by the end of this week."
    },
    {
      "korean": "~을/를 수주하다",
      "english": "to win/receive an order (for a project or contract)",
      "example": "당사는 해외 인프라 사업을 수주하는 데 성공하였다.",
      "example_en": "Our company succeeded in winning the overseas infrastructure project order."
    },
    {
      "korean": "손익분기점에 도달하다",
      "english": "to reach the break-even point",
      "example": "사업 개시 2년 만에 손익분기점에 도달할 것으로 예상됩니다.",
      "example_en": "It is expected to reach the break-even point two years after the business launch."
    },
    {
      "korean": "~을/를 공고하다",
      "english": "to publicly announce; to make an official notice",
      "example": "정부는 새로운 환경 규제를 관보에 공고하였다.",
      "example_en": "The government publicly announced the new environmental regulations in the official gazette."
    },
    {
      "korean": "시행령을 발표하다",
      "english": "to issue an enforcement decree/executive order",
      "example": "개정법에 따른 시행령이 다음 달 발표될 예정이다.",
      "example_en": "The enforcement decree under the amended law is scheduled to be issued next month."
    },
    {
      "korean": "~을/를 시달하다",
      "english": "to issue directives/instructions (from higher to lower government offices)",
      "example": "중앙 부처에서 각 지방자치단체에 지침을 시달하였다.",
      "example_en": "The central ministry issued directives to each local government."
    },
    {
      "korean": "행정 처분을 내리다",
      "english": "to impose an administrative sanction/disposition",
      "example": "위반 업체에 대해 영업 정지 행정 처분을 내렸다.",
      "example_en": "An administrative sanction of business suspension was imposed on the violating company."
    },
    {
      "korean": "~을/를 관장하다",
      "english": "to have jurisdiction over; to oversee (official authority)",
      "example": "해당 업무는 환경부가 관장하고 있습니다.",
      "example_en": "The Ministry of Environment has jurisdiction over this matter."
    },
    {
      "korean": "~에 대한 고시를 발령하다",
      "english": "to issue an official announcement/notice regarding",
      "example": "보건복지부는 의약품 가격에 대한 고시를 발령하였다.",
      "example_en": "The Ministry of Health and Welfare issued an official notice regarding pharmaceutical prices."
    },
    {
      "korean": "~을/를 소관으로 하다",
      "english": "to have (something) fall under one's jurisdiction",
      "example": "국토교통부를 소관으로 하는 법안이 국회에 제출되었다.",
      "example_en": "A bill under the jurisdiction of the Ministry of Land, Infrastructure and Transport was submitted to the National Assembly."
    },
    {
      "korean": "~을/를 철회하다",
      "english": "to withdraw; to retract (a policy, statement, or proposal)",
      "example": "정부는 국민의 반발에 직면하여 해당 정책을 철회하였다.",
      "example_en": "The government withdrew the policy in the face of public backlash."
    },
    {
      "korean": "긴급 재난 문자를 발송하다",
      "english": "to send an emergency disaster alert",
      "example": "기상청에서 폭염 주의보와 함께 긴급 재난 문자를 발송하였다.",
      "example_en": "The Korea Meteorological Administration sent an emergency disaster alert along with a heat wave advisory."
    },
    {
      "korean": "~을/를 의결하다",
      "english": "to pass a resolution; to vote to decide",
      "example": "국회에서 추경 예산안을 의결하였다.",
      "example_en": "The National Assembly passed a resolution on the supplementary budget bill."
    },
    {
      "korean": "~을/를 공표하다",
      "english": "to officially announce; to publish (government data, results)",
      "example": "선거관리위원회가 최종 투표 결과를 공표하였다.",
      "example_en": "The National Election Commission officially announced the final vote results."
    },
    {
      "korean": "~에 관한 훈령을 하달하다",
      "english": "to issue a directive/order to subordinate offices",
      "example": "국방부는 전군에 비상 경계에 관한 훈령을 하달하였다.",
      "example_en": "The Ministry of National Defense issued a directive on emergency alertness to the entire military."
    },
    {
      "korean": "민원을 접수하다",
      "english": "to receive/accept a civil complaint or petition",
      "example": "주민센터에서 소음 관련 민원을 접수하였습니다.",
      "example_en": "The community center received a civil complaint regarding noise."
    },
    {
      "korean": "~을/를 시행하다",
      "english": "to enforce; to put into effect (a law, regulation, or policy)",
      "example": "개정된 도로교통법이 7월 1일부터 시행됩니다.",
      "example_en": "The amended Road Traffic Act will go into effect starting July 1st."
    },
    {
      "korean": "~에 주안점을 두다",
      "english": "to place the main focus on; to put emphasis on",
      "example": "본 정책은 취약 계층 지원에 주안점을 두고 있다.",
      "example_en": "This policy places its main focus on support for vulnerable groups."
    },
    {
      "korean": "~을/를 규명하다",
      "english": "to investigate and clarify; to determine the cause of",
      "example": "사고의 원인을 규명하기 위한 합동 조사가 진행 중이다.",
      "example_en": "A joint investigation is underway to determine the cause of the accident."
    },
    {
      "korean": "~에 대한 실증적 분석",
      "english": "empirical analysis of",
      "example": "본 논문은 소비 행태 변화에 대한 실증적 분석을 시도한다.",
      "example_en": "This paper attempts an empirical analysis of changes in consumer behavior."
    },
    {
      "korean": "~을/를 도출하다",
      "english": "to derive; to draw (a conclusion or result)",
      "example": "수집된 데이터를 바탕으로 유의미한 결론을 도출하였다.",
      "example_en": "A meaningful conclusion was derived based on the collected data."
    },
    {
      "korean": "~(으)ㄴ/는 것으로 판단되다",
      "english": "it is judged/assessed that",
      "example": "현 단계에서는 추가 실험이 불가피한 것으로 판단된다.",
      "example_en": "At the current stage, it is judged that further experiments are unavoidable."
    },
    {
      "korean": "선행 연구에 의하면",
      "english": "according to prior/previous research",
      "example": "선행 연구에 의하면 수면 부족은 인지 기능 저하와 직결된다.",
      "example_en": "According to prior research, sleep deprivation is directly linked to cognitive decline."
    },
    {
      "korean": "~의 타당성을 검증하다",
      "english": "to verify the validity/feasibility of",
      "example": "제안된 모델의 타당성을 검증하기 위해 시뮬레이션을 수행하였다.",
      "example_en": "A simulation was conducted to verify the validity of the proposed model."
    },
    {
      "korean": "~의 함의를 지니다",
      "english": "to carry implications for; to have significance",
      "example": "이 연구 결과는 교육 정책에 중요한 함의를 지닌다.",
      "example_en": "These research findings carry important implications for education policy."
    },
    {
      "korean": "~의 변수를 통제하다",
      "english": "to control for variables",
      "example": "연령과 성별 변수를 통제한 후에도 동일한 결과가 관찰되었다.",
      "example_en": "The same results were observed even after controlling for age and gender variables."
    },
    {
      "korean": "~(으)ㄴ/는 양상을 보이다",
      "english": "to exhibit/show a pattern of",
      "example": "두 집단은 뚜렷이 상반되는 양상을 보였다.",
      "example_en": "The two groups exhibited clearly contrasting patterns."
    },
    {
      "korean": "본 연구의 한계로는",
      "english": "as for the limitations of this study",
      "example": "본 연구의 한계로는 표본 크기가 제한적이라는 점을 들 수 있다.",
      "example_en": "As for the limitations of this study, it can be noted that the sample size was limited."
    },
    {
      "korean": "~의 관점에서 논의하다",
      "english": "to discuss from the perspective of",
      "example": "본 장에서는 사회학적 관점에서 이 현상을 논의한다.",
      "example_en": "This chapter discusses the phenomenon from a sociological perspective."
    },
    {
      "korean": "~(으)ㄴ/는 점을 감안하면",
      "english": "considering the fact that; taking into account that",
      "example": "경기 둔화 추세를 감안하면 올해 성장 목표 달성은 어려울 것이다.",
      "example_en": "Taking into account the trend of economic slowdown, achieving this year's growth target will be difficult."
    },
    {
      "korean": "~을/를 뒷받침하다",
      "english": "to support; to corroborate; to back up (a claim or argument)",
      "example": "이 실험 결과는 기존 가설을 뒷받침한다.",
      "example_en": "These experimental results corroborate the existing hypothesis."
    },
    {
      "korean": "~(으)ㄴ/는 데에 기여하다",
      "english": "to contribute to (achieving/accomplishing something)",
      "example": "이 기술은 탄소 배출량을 줄이는 데에 크게 기여할 것이다.",
      "example_en": "This technology will greatly contribute to reducing carbon emissions."
    },
    {
      "korean": "~과/와 맥을 같이하다",
      "english": "to be in line with; to share the same vein as",
      "example": "이 주장은 최근 학계의 논의와 맥을 같이한다.",
      "example_en": "This argument is in line with recent discussions in the academic community."
    },
    {
      "korean": "~(으)ㄴ/는 한편",
      "english": "while; on the one hand (formal transitional connector)",
      "example": "정부는 규제를 강화하는 한편 기업 지원책도 마련하였다.",
      "example_en": "While the government strengthened regulations, it also prepared support measures for businesses."
    },
    {
      "korean": "이에 따라",
      "english": "accordingly; in accordance with this; as a result",
      "example": "수요가 급증하였다. 이에 따라 생산량도 대폭 늘렸다.",
      "example_en": "Demand surged. Accordingly, production volume was also significantly increased."
    },
    {
      "korean": "~(으)ㄴ/는 바와 같이",
      "english": "as (stated/shown/mentioned); in accordance with what",
      "example": "상기 보고서에서 분석한 바와 같이 시장은 회복 국면에 접어들었다.",
      "example_en": "As analyzed in the above report, the market has entered a recovery phase."
    },
    {
      "korean": "뿐만 아니라 ~도",
      "english": "not only... but also (sentence-level formal connector)",
      "example": "비용이 절감되었을 뿐만 아니라 품질도 향상되었다.",
      "example_en": "Not only were costs reduced, but quality was also improved."
    },
    {
      "korean": "이와 더불어",
      "english": "in addition to this; along with this",
      "example": "세금 인하가 시행되었다. 이와 더불어 복지 예산도 확대되었다.",
      "example_en": "A tax cut was implemented. In addition to this, the welfare budget was also expanded."
    },
    {
      "korean": "이를 토대로",
      "english": "on the basis of this; building upon this",
      "example": "1차 조사 결과를 확보하였다. 이를 토대로 심층 분석을 진행하겠다.",
      "example_en": "We have secured the results of the preliminary investigation. Building upon this, we will proceed with an in-depth analysis."
    },
    {
      "korean": "다시 말해",
      "english": "in other words; that is to say (formal rephrasing connector)",
      "example": "합격률이 10%에 불과하다. 다시 말해, 열 명 중 아홉 명은 탈락한다는 뜻이다.",
      "example_en": "The pass rate is only 10%. In other words, nine out of ten people are eliminated."
    },
    {
      "korean": "이에 반해",
      "english": "in contrast to this; on the contrary",
      "example": "국내 시장은 위축되고 있다. 이에 반해 해외 시장은 호조를 보이고 있다.",
      "example_en": "The domestic market is shrinking. In contrast to this, the overseas market is showing a strong trend."
    },
    {
      "korean": "결과적으로",
      "english": "as a result; consequently (formal conclusion marker)",
      "example": "투자 확대가 지속되었고, 결과적으로 생산성이 크게 향상되었다.",
      "example_en": "Investment expansion continued, and as a result, productivity improved significantly."
    },
    {
      "korean": "~(으)ㄴ/는 데 더하여",
      "english": "in addition to; on top of (formal additive connector)",
      "example": "원자재 가격이 상승한 데 더하여 물류비까지 인상되었다.",
      "example_en": "On top of raw material prices rising, logistics costs were also increased."
    },
    {
      "korean": "이러한 맥락에서",
      "english": "in this context; against this backdrop",
      "example": "이러한 맥락에서 새로운 접근법이 요구된다.",
      "example_en": "In this context, a new approach is required."
    },
    {
      "korean": "~(으)ㄴ/는 것은 주지의 사실이다",
      "english": "it is a well-known fact that",
      "example": "기후 변화가 전 세계적 문제인 것은 주지의 사실이다.",
      "example_en": "It is a well-known fact that climate change is a global problem."
    },
    {
      "korean": "요컨대",
      "english": "in short; to sum up; in a nutshell",
      "example": "요컨대, 이번 정책의 핵심은 규제 완화에 있다.",
      "example_en": "In short, the core of this policy lies in deregulation."
    },
    {
      "korean": "~(으)ㄹ 개연성이 높다",
      "english": "there is a high probability/likelihood that",
      "example": "원가 상승에 따라 소비자 가격이 인상될 개연성이 높다.",
      "example_en": "There is a high likelihood that consumer prices will rise due to increasing costs."
    },
    {
      "korean": "~(으)ㄹ 공산이 크다",
      "english": "there is a strong chance that; it is highly likely that",
      "example": "합의 없이는 사업이 무산될 공산이 크다.",
      "example_en": "Without an agreement, there is a strong chance the project will fall through."
    },
    {
      "korean": "말씀드리다",
      "english": "to humbly say/tell (humble form of 말하다 in formal speech)",
      "example": "한 가지 말씀드릴 것이 있습니다.",
      "example_en": "There is one thing I would like to tell you."
    },
    {
      "korean": "여쭈다",
      "english": "to humbly ask (humble form of 묻다/물어보다)",
      "example": "한 가지 여쭤 봐도 될까요?",
      "example_en": "May I humbly ask you one thing?"
    },
    {
      "korean": "아뢰다",
      "english": "to report/inform (to a superior; very formal/archaic humble speech)",
      "example": "위원장님께 조사 결과를 아뢰겠습니다.",
      "example_en": "I shall report the investigation results to the chairperson."
    },
    {
      "korean": "거취를 밝히다",
      "english": "to announce one's future course of action (resignation, next steps)",
      "example": "대표이사가 이번 주 내로 거취를 밝힐 것으로 보인다.",
      "example_en": "It appears the CEO will announce his future course of action within this week."
    },
    {
      "korean": "소명하다",
      "english": "to provide an explanation/justification (in response to an accusation or inquiry)",
      "example": "피의자 측은 혐의에 대해 소명할 기회를 요청하였다.",
      "example_en": "The defendant's side requested an opportunity to provide an explanation regarding the charges."
    },
    {
      "korean": "~을/를 수립하다",
      "english": "to establish; to formulate (a plan, strategy, or policy)",
      "example": "장기적인 국가 발전 전략을 수립해야 합니다.",
      "example_en": "We must formulate a long-term national development strategy."
    },
    {
      "korean": "~을/를 강구하다",
      "english": "to devise; to work out (measures, solutions)",
      "example": "교통 체증 완화를 위한 대책을 강구하고 있습니다.",
      "example_en": "We are devising measures to alleviate traffic congestion."
    },
    {
      "korean": "~을/를 도모하다",
      "english": "to pursue; to seek to bring about",
      "example": "지역 경제 활성화를 도모하기 위한 정책을 추진 중이다.",
      "example_en": "Policies are being promoted to pursue the revitalization of the regional economy."
    },
    {
      "korean": "~을/를 견지하다",
      "english": "to maintain; to uphold; to adhere to (a stance or principle)",
      "example": "정부는 한반도 비핵화 원칙을 견지하고 있다.",
      "example_en": "The government upholds the principle of denuclearization of the Korean Peninsula."
    },
    {
      "korean": "~을/를 표명하다",
      "english": "to express; to declare (an opinion, position, or intent)",
      "example": "여러 국가가 해당 결의안에 대한 지지를 표명하였다.",
      "example_en": "Multiple countries expressed their support for the resolution."
    },
    {
      "korean": "~을/를 유보하다",
      "english": "to reserve; to withhold; to defer (judgment, a decision)",
      "example": "위원회는 최종 결정을 다음 회의까지 유보하기로 했다.",
      "example_en": "The committee decided to defer the final decision until the next meeting."
    },
    {
      "korean": "~을/를 지양하다",
      "english": "to refrain from; to avoid (a negative practice or tendency)",
      "example": "형식적인 논의를 지양하고 실질적인 대안을 마련해야 한다.",
      "example_en": "We should refrain from superficial discussions and prepare substantive alternatives."
    },
    {
      "korean": "~을/를 지향하다",
      "english": "to aspire to; to aim toward; to pursue (a goal or ideal)",
      "example": "우리 사회는 다양성과 포용을 지향해야 한다.",
      "example_en": "Our society should aspire toward diversity and inclusion."
    },
    {
      "korean": "~에 선행하다",
      "english": "to precede; to come before",
      "example": "제도 개혁에 선행하여 충분한 사회적 합의가 이루어져야 한다.",
      "example_en": "Sufficient social consensus must be reached prior to institutional reform."
    },
    {
      "korean": "~을/를 타진하다",
      "english": "to sound out; to probe; to explore the possibility of",
      "example": "양국은 비공식 채널을 통해 정상회담 가능성을 타진하고 있다.",
      "example_en": "Both countries are exploring the possibility of a summit through unofficial channels."
    }
  ]
}
