{
  "사자성어 (Four-Character Idioms)": [
    {
      "korean": "선견지명",
      "english": "Foresight; the wisdom to see things before they happen",
      "hanja": "先見之明",
      "breakdown": "선(先) ahead + 견(見) see + 지(之) of + 명(明) clarity",
      "example": "그 투자자는 선견지명이 있어서 시장이 폭락하기 전에 주식을 팔았다.",
      "example_en": "That investor had the foresight to sell stocks before the market crashed."
    },
    {
      "korean": "지피지기",
      "english": "Know your enemy and know yourself; key to victory",
      "hanja": "知彼知己",
      "breakdown": "지(知) know + 피(彼) the other + 지(知) know + 기(己) oneself",
      "example": "지피지기면 백전백승이라고, 협상 전에 상대방을 철저히 분석해야 한다.",
      "example_en": "As they say, know your enemy and yourself and you'll win every battle — you must thoroughly analyze the other side before negotiations."
    },
    {
      "korean": "원교근공",
      "english": "Befriend the distant and attack the near; a divide-and-conquer strategy",
      "hanja": "遠交近攻",
      "breakdown": "원(遠) far + 교(交) befriend + 근(近) near + 공(攻) attack",
      "example": "그 기업은 원교근공 전략으로 해외 파트너와 손잡고 국내 경쟁사를 압박했다.",
      "example_en": "The company used a distant-ally strategy, partnering with overseas firms to pressure domestic competitors."
    },
    {
      "korean": "호시탐탐",
      "english": "Watching and waiting like a tiger; eyeing an opportunity",
      "hanja": "虎視眈眈",
      "breakdown": "호(虎) tiger + 시(視) gaze + 탐(眈) glare + 탐(眈) glare",
      "example": "경쟁 업체들이 호시탐탐 우리 시장 점유율을 노리고 있다.",
      "example_en": "Competing companies are watching like tigers, eyeing our market share."
    },
    {
      "korean": "허장성세",
      "english": "Making an empty show of force; bluffing",
      "hanja": "虛張聲勢",
      "breakdown": "허(虛) empty + 장(張) spread + 성(聲) voice + 세(勢) power",
      "example": "그의 강경한 발언은 허장성세에 불과했고, 실제로는 양보할 준비가 되어 있었다.",
      "example_en": "His tough talk was nothing but bluffing — he was actually ready to make concessions."
    },
    {
      "korean": "이이제이",
      "english": "Use one's adversary to control another; divide and rule",
      "hanja": "以夷制夷",
      "breakdown": "이(以) use + 이(夷) outsider + 제(制) control + 이(夷) outsider",
      "example": "그 정치인은 이이제이 전략으로 반대파 내부의 분열을 유도했다.",
      "example_en": "The politician used a divide-and-rule strategy to provoke infighting within the opposition."
    },
    {
      "korean": "암중모색",
      "english": "Groping in the dark; searching blindly for a solution",
      "hanja": "暗中摸索",
      "breakdown": "암(暗) dark + 중(中) middle + 모(摸) feel + 색(索) search",
      "example": "증거가 부족해서 수사관들은 암중모색하며 단서를 찾고 있었다.",
      "example_en": "With insufficient evidence, the investigators were groping in the dark for clues."
    },
    {
      "korean": "순망치한",
      "english": "When the lips are gone, the teeth feel cold; mutual dependence",
      "hanja": "脣亡齒寒",
      "breakdown": "순(脣) lips + 망(亡) perish + 치(齒) teeth + 한(寒) cold",
      "example": "두 나라는 순망치한의 관계라 한쪽이 무너지면 다른 쪽도 위험하다.",
      "example_en": "The two countries are so interdependent that if one falls, the other is at risk."
    },
    {
      "korean": "관포지교",
      "english": "A friendship of deep trust and understanding, like Guan Zhong and Bao Shuya",
      "hanja": "管鮑之交",
      "breakdown": "관(管) Guan Zhong + 포(鮑) Bao Shuya + 지(之) of + 교(交) friendship",
      "example": "우리 둘은 관포지교라 서로 잘못을 해도 이해하고 감싸 준다.",
      "example_en": "Our friendship is so deep that we forgive and embrace each other even when we make mistakes."
    },
    {
      "korean": "수어지교",
      "english": "An inseparable bond, like water and fish",
      "hanja": "水魚之交",
      "breakdown": "수(水) water + 어(魚) fish + 지(之) of + 교(交) friendship",
      "example": "유비와 제갈량은 수어지교의 관계로 서로 없이는 큰일을 이룰 수 없었다.",
      "example_en": "Liu Bei and Zhuge Liang had an inseparable bond — neither could accomplish great things without the other."
    },
    {
      "korean": "이합집산",
      "english": "Partings and reunions; the cycle of coming together and breaking apart",
      "hanja": "離合集散",
      "breakdown": "이(離) separate + 합(合) unite + 집(集) gather + 산(散) scatter",
      "example": "정치판에서는 이합집산이 반복되어 어제의 적이 오늘의 동지가 된다.",
      "example_en": "In politics, alliances constantly form and dissolve, so yesterday's enemy becomes today's ally."
    },
    {
      "korean": "결초보은",
      "english": "Repaying a debt of gratitude, even after death",
      "hanja": "結草報恩",
      "breakdown": "결(結) tie + 초(草) grass + 보(報) repay + 은(恩) kindness",
      "example": "스승의 은혜에 결초보은하는 마음으로 장학금을 기부했다.",
      "example_en": "With a heart determined to repay my teacher's kindness, I donated a scholarship."
    },
    {
      "korean": "백년해로",
      "english": "Growing old together for a hundred years; lifelong marital devotion",
      "hanja": "百年偕老",
      "breakdown": "백(百) hundred + 년(年) years + 해(偕) together + 로(老) grow old",
      "example": "할아버지와 할머니는 백년해로하시며 서로를 한결같이 아껴 오셨다.",
      "example_en": "My grandparents have grown old together, cherishing each other faithfully throughout their lives."
    },
    {
      "korean": "상부상조",
      "english": "Mutual help and support; assisting one another",
      "hanja": "相扶相助",
      "breakdown": "상(相) mutually + 부(扶) support + 상(相) mutually + 조(助) help",
      "example": "이웃 간에 상부상조하는 문화가 점점 사라지고 있어 안타깝다.",
      "example_en": "It's regrettable that the culture of neighbors helping each other is gradually disappearing."
    },
    {
      "korean": "새옹지마",
      "english": "A blessing in disguise; fortune and misfortune are unpredictable",
      "hanja": "塞翁之馬",
      "breakdown": "새(塞) frontier + 옹(翁) old man + 지(之) of + 마(馬) horse",
      "example": "해고를 당했지만 새옹지마라고, 덕분에 더 좋은 직장을 찾게 되었다.",
      "example_en": "I was laid off, but as they say, misfortune can turn to fortune — I ended up finding a better job."
    },
    {
      "korean": "제행무상",
      "english": "All things are impermanent; nothing lasts forever",
      "hanja": "諸行無常",
      "breakdown": "제(諸) all + 행(行) phenomena + 무(無) without + 상(常) permanence",
      "example": "제행무상이라는 말처럼, 아무리 강한 제국도 결국 멸망한다.",
      "example_en": "As the saying goes, all things are impermanent — even the mightiest empire eventually falls."
    },
    {
      "korean": "색즉시공",
      "english": "Form is emptiness; material things are inherently empty",
      "hanja": "色即是空",
      "breakdown": "색(色) form + 즉(即) is + 시(是) this + 공(空) emptiness",
      "example": "재산을 잃고 나서야 색즉시공이라는 말의 의미를 깨달았다.",
      "example_en": "Only after losing my wealth did I grasp the meaning of 'form is emptiness.'"
    },
    {
      "korean": "대동소이",
      "english": "Largely the same with minor differences",
      "hanja": "大同小異",
      "breakdown": "대(大) large + 동(同) same + 소(小) small + 이(異) different",
      "example": "두 후보의 공약은 대동소이해서 유권자들이 선택하기 어려웠다.",
      "example_en": "The two candidates' platforms were largely the same, making it difficult for voters to choose."
    },
    {
      "korean": "허허실실",
      "english": "A mix of truth and bluff; feinting and real moves intertwined",
      "hanja": "虛虛實實",
      "breakdown": "허(虛) empty + 허(虛) empty + 실(實) real + 실(實) real",
      "example": "협상 테이블에서 양측은 허허실실 전략을 구사하며 서로의 속내를 탐색했다.",
      "example_en": "At the negotiating table, both sides employed a mix of bluffs and real moves, probing each other's true intentions."
    },
    {
      "korean": "유아독존",
      "english": "I alone am supreme; extreme arrogance or self-importance",
      "hanja": "唯我獨尊",
      "breakdown": "유(唯) only + 아(我) I + 독(獨) alone + 존(尊) revered",
      "example": "그는 유아독존 식으로 행동해서 팀원들의 반감을 샀다.",
      "example_en": "He acted as if he alone mattered, earning resentment from his teammates."
    },
    {
      "korean": "만물유전",
      "english": "All things flow and change; everything is in constant flux",
      "hanja": "萬物流轉",
      "breakdown": "만(萬) ten thousand + 물(物) things + 유(流) flow + 전(轉) turn",
      "example": "만물유전의 이치를 받아들이면 변화에 대한 두려움이 줄어든다.",
      "example_en": "If you accept that all things flow and change, your fear of change diminishes."
    },
    {
      "korean": "양두구육",
      "english": "Hanging a sheep's head but selling dog meat; false advertising",
      "hanja": "羊頭狗肉",
      "breakdown": "양(羊) sheep + 두(頭) head + 구(狗) dog + 육(肉) meat",
      "example": "친환경이라고 광고하면서 유해 물질을 쓰다니, 양두구육도 이런 양두구육이 없다.",
      "example_en": "Advertising as eco-friendly while using harmful substances — there's no better example of false advertising."
    },
    {
      "korean": "교토삼굴",
      "english": "A cunning rabbit has three burrows; always have backup plans",
      "hanja": "狡兔三窟",
      "breakdown": "교(狡) cunning + 토(兔) rabbit + 삼(三) three + 굴(窟) burrow",
      "example": "그 사업가는 교토삼굴이라고 여러 나라에 자산을 분산해 두었다.",
      "example_en": "That businessman, like a cunning rabbit with three burrows, spread his assets across multiple countries."
    },
    {
      "korean": "구밀복검",
      "english": "Honey on the lips but a sword in the belly; outwardly sweet but inwardly treacherous",
      "hanja": "口蜜腹劍",
      "breakdown": "구(口) mouth + 밀(蜜) honey + 복(腹) belly + 검(劍) sword",
      "example": "그 사람은 구밀복검이라 겉으로는 친절하지만 뒤에서는 험담을 한다.",
      "example_en": "That person is honey-mouthed but dagger-hearted — kind on the surface but gossiping behind your back."
    },
    {
      "korean": "양약고구",
      "english": "Good medicine tastes bitter; honest advice is hard to hear",
      "hanja": "良藥苦口",
      "breakdown": "양(良) good + 약(藥) medicine + 고(苦) bitter + 구(口) mouth",
      "example": "양약고구라고, 부모님의 잔소리가 결국 나를 바른길로 이끌었다.",
      "example_en": "As they say, good medicine tastes bitter — my parents' nagging ultimately led me down the right path."
    },
    {
      "korean": "어불성설",
      "english": "Words that don't hold up; a nonsensical or absurd argument",
      "hanja": "語不成說",
      "breakdown": "어(語) words + 불(不) not + 성(成) become + 설(說) theory",
      "example": "예산은 삭감하면서 성과는 올리라니, 어불성설이다.",
      "example_en": "Cutting the budget while demanding better results — that's utterly absurd."
    },
    {
      "korean": "자승자박",
      "english": "Binding oneself with one's own rope; getting trapped by one's own actions",
      "hanja": "自繩自縛",
      "breakdown": "자(自) self + 승(繩) rope + 자(自) self + 박(縛) bind",
      "example": "거짓말을 하다 보니 자승자박이 되어 스스로 모순에 빠졌다.",
      "example_en": "By piling up lies, he trapped himself in his own contradictions."
    },
    {
      "korean": "아전인수",
      "english": "Drawing water to one's own rice paddy; a self-serving interpretation",
      "hanja": "我田引水",
      "breakdown": "아(我) my + 전(田) field + 인(引) draw + 수(水) water",
      "example": "같은 자료를 놓고 서로 아전인수 격으로 유리하게 해석하고 있다.",
      "example_en": "Both sides are interpreting the same data in self-serving ways to suit their own arguments."
    },
    {
      "korean": "극기복례",
      "english": "Overcome selfish desires and return to propriety; self-discipline",
      "hanja": "克己復禮",
      "breakdown": "극(克) overcome + 기(己) self + 복(復) return + 례(禮) propriety",
      "example": "공자는 극기복례를 인의 핵심으로 가르쳤다.",
      "example_en": "Confucius taught that overcoming the self and returning to propriety is the essence of benevolence."
    },
    {
      "korean": "견인불발",
      "english": "Firm patience that cannot be uprooted; steadfast perseverance",
      "hanja": "堅忍不拔",
      "breakdown": "견(堅) firm + 인(忍) endure + 불(不) not + 발(拔) pull out",
      "example": "그녀는 견인불발의 자세로 10년간 연구에 매진한 끝에 성과를 냈다.",
      "example_en": "With steadfast perseverance, she devoted herself to research for ten years and finally achieved results."
    },
    {
      "korean": "지행합일",
      "english": "Unity of knowledge and action; practicing what you know",
      "hanja": "知行合一",
      "breakdown": "지(知) know + 행(行) act + 합(合) unite + 일(一) one",
      "example": "환경 보호를 말하면서 일회용품을 쓴다면 지행합일이 아니다.",
      "example_en": "If you talk about protecting the environment while using disposable products, you're not practicing what you preach."
    },
    {
      "korean": "절차탁마",
      "english": "Cutting, filing, carving, and polishing; refining oneself through diligent effort",
      "hanja": "切磋琢磨",
      "breakdown": "절(切) cut + 차(磋) file + 탁(琢) carve + 마(磨) polish",
      "example": "동료들과 절차탁마하며 실력을 키워 나갔다.",
      "example_en": "I honed my skills through mutual refinement with my colleagues."
    },
    {
      "korean": "근검절약",
      "english": "Diligence and frugality; working hard and spending wisely",
      "hanja": "勤儉節約",
      "breakdown": "근(勤) diligent + 검(儉) frugal + 절(節) moderate + 약(約) economize",
      "example": "조부모님 세대는 근검절약을 미덕으로 여기며 살아오셨다.",
      "example_en": "Our grandparents' generation lived by the virtue of diligence and frugality."
    },
    {
      "korean": "청렴결백",
      "english": "Clean and incorruptible; moral integrity and honesty",
      "hanja": "清廉潔白",
      "breakdown": "청(清) pure + 렴(廉) incorrupt + 결(潔) clean + 백(白) white",
      "example": "그 판사는 청렴결백하기로 유명해서 누구도 뇌물을 시도하지 못했다.",
      "example_en": "The judge was so well-known for integrity that no one even attempted a bribe."
    },
    {
      "korean": "견리사의",
      "english": "When you see profit, think of righteousness; putting ethics before gain",
      "hanja": "見利思義",
      "breakdown": "견(見) see + 리(利) profit + 사(思) think + 의(義) righteousness",
      "example": "기업인이라면 견리사의의 자세로 이익 앞에서도 도의를 먼저 생각해야 한다.",
      "example_en": "A businessperson should adopt the mindset of thinking of righteousness when faced with profit."
    }
  ]
}
