{
  "주제별 단어 — 도서관 (Topic: Libraries & Books)": [
    {
      "korean": "참고문헌",
      "english": "bibliography; reference materials",
      "example": "이 논문의 참고문헌을 보면 최근 연구동향을 잘 알 수 있다.",
      "example_en": "By looking at this paper's bibliography, you can understand recent research trends well."
    },
    {
      "korean": "목록학",
      "english": "cataloging; bibliographic science",
      "example": "도서관의 목록학 시스템이 개편되면서 책 찾기가 훨씬 수월해졌다.",
      "example_en": "After the library's cataloging system was revised, finding books became much easier."
    },
    {
      "korean": "정기간행물",
      "english": "periodicals; journals and magazines",
      "example": "도서관에서는 다양한 정기간행물을 구독하고 있으며, 일부는 디지털로도 제공된다.",
      "example_en": "The library subscribes to various periodicals, and some are also available digitally."
    },
    {
      "korean": "필사본",
      "english": "manuscript; handwritten document",
      "example": "박물관에 보관된 조선시대 필사본들은 역사 연구에 매우 귀중한 자료다.",
      "example_en": "The Joseon-era manuscripts preserved in the museum are invaluable materials for historical research."
    },
    {
      "korean": "선집",
      "english": "anthology; selected works",
      "example": "19세기 한국 소설 선집은 근대 문학의 발전 과정을 보여준다.",
      "example_en": "An anthology of 19th-century Korean novels illustrates the development of modern literature."
    },
    {
      "korean": "문학비평",
      "english": "literary criticism",
      "example": "그 교수의 문학비평은 작품을 다양한 각도에서 분석한다.",
      "example_en": "The professor's literary criticism analyzes works from multiple perspectives."
    },
    {
      "korean": "저작권",
      "english": "copyright; intellectual property rights",
      "example": "출판사는 저작권 침해 사건에서 작가를 적극 지원하기로 했다.",
      "example_en": "The publisher decided to actively support the author in the copyright infringement case."
    },
    {
      "korean": "교정",
      "english": "proofreading; correction of text",
      "example": "인쇄 전에 세 번의 교정 과정을 거쳐야 한다.",
      "example_en": "The text must go through three rounds of proofreading before printing."
    },
    {
      "korean": "식자",
      "english": "typesetting; composition",
      "example": "현대에는 컴퓨터 식자 프로그램으로 편집 과정이 대폭 단축되었다.",
      "example_en": "With modern computer typesetting programs, the editing process has been greatly shortened."
    },
    {
      "korean": "제본",
      "english": "binding; bookbinding",
      "example": "고서적 제본 기술은 전통 수공예로 여전히 존경받고 있다.",
      "example_en": "The traditional craft of rare book binding is still highly respected."
    },
    {
      "korean": "주석",
      "english": "annotation; footnotes and commentary",
      "example": "원문 옆에 주석을 달면 독자가 쉽게 이해할 수 있다.",
      "example_en": "Adding annotations next to the original text helps readers understand more easily."
    },
    {
      "korean": "학위논문",
      "english": "dissertation; thesis",
      "example": "그 학위논문은 수년간의 연구 결과를 담고 있다.",
      "example_en": "The dissertation contains years of research results."
    },
    {
      "korean": "표절",
      "english": "plagiarism",
      "example": "표절 검사 프로그램으로 학생들의 레포트를 검증한다.",
      "example_en": "The instructor verifies students' reports using plagiarism detection software."
    },
    {
      "korean": "인용",
      "english": "citation; quotation",
      "example": "이 글에서 인용한 문헌들은 모두 학술지에 게재된 논문이다.",
      "example_en": "The literature cited in this article are all papers published in academic journals."
    },
    {
      "korean": "초록",
      "english": "abstract; summary",
      "example": "논문의 초록을 읽으면 전체 내용을 파악할 수 있다.",
      "example_en": "Reading the abstract of a paper gives you an understanding of the entire content."
    },
    {
      "korean": "색인",
      "english": "index; table of contents",
      "example": "책의 마지막 페이지에 있는 색인으로 특정 주제를 빠르게 찾을 수 있다.",
      "example_en": "The index at the end of the book allows you to quickly find specific topics."
    },
    {
      "korean": "아카이브",
      "english": "archive; repository of records",
      "example": "국립중앙도서관의 디지털 아카이브는 수백만 개의 자료를 보유하고 있다.",
      "example_en": "The National Library's digital archive holds millions of documents."
    },
    {
      "korean": "귀중본",
      "english": "rare book; precious volume",
      "example": "이 귀중본은 보존 상태가 매우 좋아서 소장 가치가 높다.",
      "example_en": "This rare book is in excellent condition and has high collection value."
    },
    {
      "korean": "전자도서관",
      "english": "digital library; e-library",
      "example": "전자도서관을 이용하면 시간과 장소의 제약 없이 자료에 접근할 수 있다.",
      "example_en": "Digital libraries allow access to materials without time or location restrictions."
    },
    {
      "korean": "출판사",
      "english": "publisher; publishing house",
      "example": "그 출판사는 문학 고전을 전문으로 출판한다.",
      "example_en": "The publisher specializes in publishing literary classics."
    },
    {
      "korean": "편집자",
      "english": "editor",
      "example": "편집자의 피드백을 반영해서 원고를 수정했다.",
      "example_en": "I revised the manuscript based on the editor's feedback."
    },
    {
      "korean": "원고",
      "english": "manuscript; draft text",
      "example": "출판 전에 원고를 여러 전문가에게 검토받는다.",
      "example_en": "Before publication, the manuscript is reviewed by several experts."
    },
    {
      "korean": "ISBN",
      "english": "ISBN; International Standard Book Number",
      "example": "이 책의 ISBN을 입력하면 도서관 시스템에서 자동으로 검색된다.",
      "example_en": "When you enter this book's ISBN, the library system automatically searches for it."
    },
    {
      "korean": "개정판",
      "english": "revised edition; new edition",
      "example": "이번 개정판에서는 최신 정보를 반영하여 여러 장을 수정했다.",
      "example_en": "In this revised edition, several chapters were updated to reflect the latest information."
    },
    {
      "korean": "서지사항",
      "english": "bibliographic information; publication details",
      "example": "책의 뒷면에 인쇄된 서지사항을 확인하면 출판 정보를 알 수 있다.",
      "example_en": "You can find publication information by checking the bibliographic details printed on the back of the book."
    },
    {
      "korean": "판권지",
      "english": "copyright page; title page verso",
      "example": "판권지에는 출판사, 저자, 출판일, 판수 등의 정보가 기재된다.",
      "example_en": "The copyright page contains information such as publisher, author, publication date, and edition."
    },
    {
      "korean": "편집증",
      "english": "editorial license; editorial discretion",
      "example": "편집자는 때때로 문맥에 맞게 약간의 편집증을 발휘한다.",
      "example_en": "Editors sometimes exercise editorial discretion to better fit the context."
    },
    {
      "korean": "저술",
      "english": "authorship; written work",
      "example": "그의 저술 활동은 학계에 큰 영향을 미쳤다.",
      "example_en": "His authorship and written works had a major impact on academia."
    },
    {
      "korean": "역본",
      "english": "translated version; translation",
      "example": "이 소설의 영어 역본은 세계적으로 큰 인기를 얻었다.",
      "example_en": "The English translation of this novel gained worldwide popularity."
    },
    {
      "korean": "미출판",
      "english": "unpublished; not yet published",
      "example": "그 작가의 미출판 원고들이 발견되어 학계의 주목을 받고 있다.",
      "example_en": "The unpublished manuscripts of the author have been discovered and are attracting academic attention."
    },
    {
      "korean": "절판",
      "english": "out of print; no longer published",
      "example": "그 책은 20년 전에 절판되었지만 여전히 중고 시장에서 찾을 수 있다.",
      "example_en": "The book went out of print 20 years ago, but you can still find it on the secondhand market."
    },
    {
      "korean": "서재",
      "english": "library; personal book collection",
      "example": "그의 방대한 서재는 그의 학문적 깊이를 보여준다.",
      "example_en": "His extensive personal library demonstrates his scholarly depth."
    },
    {
      "korean": "독서회",
      "english": "book club; reading circle",
      "example": "이 독서회는 매달 한 권의 책을 선정해서 토론한다.",
      "example_en": "This book club selects one book each month for discussion."
    },
    {
      "korean": "서평",
      "english": "book review",
      "example": "신문의 서평란에서 신작 소설에 대한 긍정적인 평가를 읽었다.",
      "example_en": "I read a positive review of a new novel in the newspaper's book review section."
    },
    {
      "korean": "북마크",
      "english": "bookmark",
      "example": "종이 북마크를 책 사이에 끼우고 다니는 것이 습관이다.",
      "example_en": "I habitually keep a paper bookmark inside the book I'm reading."
    },
    {
      "korean": "여백",
      "english": "margin; white space",
      "example": "원본의 여백에 필사된 주석들이 책의 가치를 더해준다.",
      "example_en": "Annotations handwritten in the margins of the original add to the book's value."
    },
    {
      "korean": "장정",
      "english": "book design; layout and binding",
      "example": "이 책의 장정은 고급스럽고 세련되어 있다.",
      "example_en": "This book's design is elegant and refined."
    },
    {
      "korean": "인쇄본",
      "english": "printed edition; printed copy",
      "example": "전자책이 보편화되었지만 종이 인쇄본을 선호하는 독자들도 많다.",
      "example_en": "Although e-books are common, many readers still prefer printed editions."
    },
    {
      "korean": "일람표",
      "english": "list; catalog; table of contents",
      "example": "도서관의 신간 일람표를 확인하면 최신 도서를 알 수 있다.",
      "example_en": "By checking the library's new releases list, you can see the latest books."
    }
  ]
}
