{
  "구어체 (Colloquial)": [
    {
      "korean": "헐",
      "english": "Expression of shock or disbelief, like 'whoa' or 'oh my god.' Used when something unexpected or absurd happens.",
      "example": "헐, 걔가 회사 그만뒀다고? 입사한 지 일주일밖에 안 됐잖아.",
      "example_en": "Whoa, he quit the company? It's only been a week since he started."
    },
    {
      "korean": "아이고",
      "english": "Versatile exclamation expressing frustration, exhaustion, sympathy, or mild pain. Used across all ages and situations.",
      "example": "아이고, 허리야. 하루 종일 앉아 있었더니 온몸이 쑤셔.",
      "example_en": "Oh my, my back. I've been sitting all day and my whole body aches."
    },
    {
      "korean": "어머",
      "english": "Exclamation of surprise (slightly feminine). Used for unexpected discoveries or mild shock.",
      "example": "어머, 이게 누구야! 여기서 만날 줄이야.",
      "example_en": "Oh my, who is this! I never expected to run into you here."
    },
    {
      "korean": "세상에",
      "english": "'Good heavens' or 'oh my goodness.' Expresses strong surprise or disbelief at something remarkable.",
      "example": "세상에, 십 년 만에 연락이 오다니. 너무 반갑다.",
      "example_en": "Good heavens, getting a call after ten years. I'm so glad to hear from you."
    },
    {
      "korean": "말도 안 돼",
      "english": "'That's absurd' or 'no way.' Used when something seems impossible or unbelievable.",
      "example": "그 식당 웨이팅이 세 시간이래. 말도 안 돼, 그냥 다른 데 가자.",
      "example_en": "They say the wait at that restaurant is three hours. That's absurd, let's just go somewhere else."
    },
    {
      "korean": "웬일이야",
      "english": "'What brings you here?' or 'what a rare occasion.' Used when someone does something unexpected or out of character.",
      "example": "네가 아침에 일찍 일어나다니, 웬일이야? 무슨 일 있어?",
      "example_en": "You're up early in the morning — what's the occasion? Is something going on?"
    },
    {
      "korean": "그럴 리가",
      "english": "'That can't be' or 'no way.' Expresses disbelief or denial that something is true.",
      "example": "시험에 떨어졌다고? 그럴 리가. 네가 얼마나 열심히 했는데.",
      "example_en": "You failed the exam? That can't be. You worked so hard for it."
    },
    {
      "korean": "어쩜 이렇게",
      "english": "'How can it be like this?' Expresses admiration, surprise, or sometimes frustration at an extreme quality.",
      "example": "어쩜 이렇게 맛있지? 이 집 비빔밥은 진짜 예술이다.",
      "example_en": "How can it be this good? The bibimbap here is truly a work of art."
    },
    {
      "korean": "뭐야 이게",
      "english": "'What is this?' Reaction of confusion, disgust, or disbelief at something right in front of you.",
      "example": "뭐야 이게, 택배가 완전히 찌그러져서 왔네. 항의해야겠다.",
      "example_en": "What is this — the package arrived completely crushed. I need to file a complaint."
    },
    {
      "korean": "어이가 없다",
      "english": "'I'm dumbfounded' or 'I can't believe this.' Stronger than simple surprise; implies the situation is absurd or outrageous.",
      "example": "내가 줄 서 있었는데 새치기를 하더라. 진짜 어이가 없어서 말이 안 나왔어.",
      "example_en": "I was standing in line and someone cut in front of me. I was so dumbfounded I couldn't even speak."
    },
    {
      "korean": "좀 그렇다",
      "english": "Euphemistic way to say something is uncomfortable, awkward, or not great. Used to soften refusals or negative opinions.",
      "example": "그 날 약속은 좀 그런데, 다른 날은 안 될까?",
      "example_en": "That day is a bit difficult for me — would another day work?"
    },
    {
      "korean": "글쎄요",
      "english": "'Hmm, well...' or 'I'm not so sure.' Non-committal response when you don't want to give a definite answer.",
      "example": "\"이번 프로젝트 성공할 수 있을까요?\" \"글쎄요, 아직 변수가 많아서 뭐라 말하기 어렵네요.\"",
      "example_en": "\"Do you think this project can succeed?\" \"Well... there are still a lot of variables, so it's hard to say.\""
    },
    {
      "korean": "그렇긴 한데",
      "english": "'That's true, but...' Acknowledges someone's point while signaling disagreement or a reservation is coming.",
      "example": "그렇긴 한데, 현실적으로 그게 가능할까? 예산도 부족하잖아.",
      "example_en": "That's true, but is it realistically possible? We don't even have the budget."
    },
    {
      "korean": "말이 좀 그런데",
      "english": "'This might sound weird/rude, but...' Preface before saying something potentially awkward or blunt.",
      "example": "말이 좀 그런데, 그 사람이랑 같이 일하기 좀 힘들지 않아?",
      "example_en": "This might sound a bit off, but isn't it kind of hard working with that person?"
    },
    {
      "korean": "어떻게 보면",
      "english": "'Depending on how you look at it' or 'in a way.' Used to offer an alternative perspective or soften a statement.",
      "example": "어떻게 보면 오히려 잘된 거야. 그 회사 얼마 후에 망했잖아.",
      "example_en": "In a way, it actually worked out for the better. That company went under not long after."
    },
    {
      "korean": "뭐 그럴 수도 있지",
      "english": "'Well, I suppose that's possible' or 'that can happen.' Casual acceptance or concession, sometimes reluctant.",
      "example": "실수한 거에 대해 사과했대. 뭐 그럴 수도 있지, 누구나 실수하니까.",
      "example_en": "He said he apologized for the mistake. Well, that can happen — everyone makes mistakes."
    },
    {
      "korean": "솔직히 말하면",
      "english": "'To be honest' or 'frankly speaking.' Used before delivering a candid opinion, often one the listener might not want to hear.",
      "example": "솔직히 말하면 나도 별로 기대 안 했는데, 의외로 재밌더라.",
      "example_en": "To be honest, I wasn't expecting much either, but it was surprisingly fun."
    },
    {
      "korean": "내가 보기엔",
      "english": "'The way I see it' or 'in my opinion.' Introduces a personal assessment, slightly hedged to avoid sounding too assertive.",
      "example": "내가 보기엔 아직 준비가 덜 된 것 같아. 조금 더 다듬는 게 어때?",
      "example_en": "The way I see it, it doesn't seem quite ready yet. How about polishing it a bit more?"
    },
    {
      "korean": "괜히",
      "english": "'For no good reason' or 'unnecessarily.' Expresses regret about a pointless action or an inexplicable feeling.",
      "example": "괜히 말했나 봐. 분위기가 갑자기 어색해졌어.",
      "example_en": "I guess I shouldn't have said anything. The mood suddenly got awkward."
    },
    {
      "korean": "말하기 좀 뭐하지만",
      "english": "'It's a bit awkward to say this, but...' Polite preface before saying something delicate or potentially unwelcome.",
      "example": "말하기 좀 뭐하지만, 네 발표 자료에 오타가 좀 많아.",
      "example_en": "It's a bit awkward to say this, but there are quite a few typos in your presentation materials."
    },
    {
      "korean": "죽겠다",
      "english": "'I'm dying (of...).' Hyperbolic suffix expressing an extreme state — hunger, tiredness, boredom, heat, etc.",
      "example": "배고파 죽겠다. 점심 안 먹었더니 정말 쓰러질 것 같아.",
      "example_en": "I'm starving to death. I skipped lunch and I feel like I'm going to collapse."
    },
    {
      "korean": "장난 아니다",
      "english": "'It's no joke' or 'it's seriously intense.' Emphasizes that something is extreme in degree — positively or negatively.",
      "example": "오늘 추위 장난 아니다. 나가자마자 후회했어.",
      "example_en": "The cold today is no joke. I regretted it the moment I stepped outside."
    },
    {
      "korean": "미치겠다",
      "english": "'It's driving me crazy.' Expresses overwhelming frustration, stress, or sometimes excitement.",
      "example": "옆집에서 새벽 두 시까지 노래를 불러. 미치겠다, 진짜.",
      "example_en": "The neighbors are singing until 2 AM. It's driving me insane, honestly."
    },
    {
      "korean": "끝내주다",
      "english": "'It's amazing' or 'unbeatable.' Strong compliment meaning something is exceptionally good.",
      "example": "이 집 갈비탕 끝내준다. 여기 자주 와야겠다.",
      "example_en": "The galbitang here is incredible. I should come here more often."
    },
    {
      "korean": "한두 번이 아니다",
      "english": "'It's not just once or twice.' Emphasizes that something has happened repeatedly, implying frustration or a pattern.",
      "example": "그 사람이 약속을 어긴 게 한두 번이 아니야. 이제 못 믿겠어.",
      "example_en": "It's not just once or twice that he's broken promises. I can't trust him anymore."
    },
    {
      "korean": "말이 되냐",
      "english": "'Does that even make sense?' Rhetorical question expressing that something is completely unreasonable.",
      "example": "월급은 그대로인데 일만 두 배로 늘었어. 이게 말이 되냐?",
      "example_en": "My salary is the same but the workload doubled. Does that even make sense?"
    },
    {
      "korean": "얼마나 ~는지 모르다",
      "english": "'You have no idea how much...' Emphasizes an extreme degree of something that's hard to convey.",
      "example": "그 소식 듣고 얼마나 기뻤는지 몰라. 눈물이 날 뻔했어.",
      "example_en": "You have no idea how happy I was to hear that news. I almost cried."
    },
    {
      "korean": "정신이 없다",
      "english": "'I'm overwhelmed' or 'I can't think straight.' Describes being so busy or chaotic that you lose track of things.",
      "example": "이사 준비하느라 요즘 정신이 없어. 뭐가 어디 있는지도 모르겠어.",
      "example_en": "I've been so overwhelmed preparing for the move. I don't even know where anything is."
    },
    {
      "korean": "뭐가 이렇게 많아",
      "english": "'Why is there so much of this?' Exclamation of exasperation at an excessive quantity of something.",
      "example": "서류가 뭐가 이렇게 많아, 이걸 언제 다 처리해?",
      "example_en": "Why is there so much paperwork? When am I supposed to get through all of this?"
    },
    {
      "korean": "어디 ~뿐이겠어",
      "english": "'It's not just...' / 'And that's not even the only thing.' Rhetorical expression meaning the problem goes far beyond what was mentioned.",
      "example": "돈 문제가 어디 그것뿐이겠어. 시간도 없고 사람도 부족해.",
      "example_en": "The money issue is not even the half of it. There's no time and not enough people either."
    },
    {
      "korean": "있잖아",
      "english": "'You know what' or 'so listen.' Conversation opener to get someone's attention before introducing a topic.",
      "example": "있잖아, 나 요즘 고민이 하나 있는데 얘기 좀 해도 돼?",
      "example_en": "Hey, so listen — I've been worried about something lately. Can I talk to you about it?"
    },
    {
      "korean": "그러니까",
      "english": "'Exactly' or 'that's what I'm saying.' Used to strongly agree with someone, or as a filler meaning 'so' or 'I mean.'",
      "example": "\"이번 일은 좀 심하지 않아?\" \"그러니까, 나도 그 말을 하고 싶었어.\"",
      "example_en": "\"Isn't this going a bit too far?\" \"Exactly — that's what I wanted to say.\""
    },
    {
      "korean": "아 맞다",
      "english": "'Oh right' or 'that reminds me.' Used when you suddenly remember something mid-conversation.",
      "example": "아 맞다, 내일 회의 시간 바뀐 거 알지? 두 시로 옮겨졌어.",
      "example_en": "Oh right, you know the meeting time changed tomorrow, right? It moved to 2 o'clock."
    },
    {
      "korean": "그게 아니라",
      "english": "'That's not what I mean' or 'no, actually.' Used to correct a misunderstanding or redirect the conversation.",
      "example": "그게 아니라, 내 말은 아예 안 된다는 게 아니고 좀 더 생각해 보자는 거야.",
      "example_en": "That's not what I mean — I'm not saying it's impossible, I'm saying let's think about it more."
    },
    {
      "korean": "뭐랄까",
      "english": "'How should I put it' or 'what's the word.' Filler used while searching for the right expression.",
      "example": "그 영화가, 뭐랄까, 슬프면서도 따뜻한 느낌이었어.",
      "example_en": "That movie was, how should I put it, sad but warm at the same time."
    },
    {
      "korean": "그건 그렇고",
      "english": "'That aside' or 'anyway.' Used to acknowledge a point then shift to a different topic.",
      "example": "그건 그렇고, 주말에 시간 있어? 같이 밥 먹자.",
      "example_en": "That aside, are you free this weekend? Let's grab a meal."
    },
    {
      "korean": "그나저나",
      "english": "'By the way' or 'anyway' (topic pivot). Used to change the subject naturally in casual conversation.",
      "example": "그나저나 너 요즘 운동 시작했다며? 몸이 달라진 것 같은데.",
      "example_en": "By the way, I heard you started working out recently? You look like you've changed."
    },
    {
      "korean": "하긴",
      "english": "'Come to think of it' or 'well, you have a point.' Concedes that the other person's argument is valid after initial resistance.",
      "example": "하긴, 네 말도 맞아. 서두르면 오히려 실수할 수 있지.",
      "example_en": "Come to think of it, you're right. If we rush, we might make mistakes instead."
    },
    {
      "korean": "그래 가지고",
      "english": "'And so' or 'and then.' Casual connective used in storytelling to link events. More spoken than written.",
      "example": "버스를 놓쳤어. 그래 가지고 택시를 탔는데 택시비가 장난 아니더라.",
      "example_en": "I missed the bus. And so I took a taxi, and the fare was no joke."
    },
    {
      "korean": "아니 근데",
      "english": "'But wait' or 'hold on though.' Used to interject with a new thought, mild objection, or shift in direction.",
      "example": "아니 근데, 그 사람이 왜 거기 있었어? 출장 간다고 하지 않았어?",
      "example_en": "But wait, why was he there? Didn't he say he was going on a business trip?"
    }
  ]
}
