{
  "고급 형용사 (Advanced Adjectives)": [
    {
      "korean": "꿉꿉하다",
      "english": "musty, damp and stuffy; having a stale, humid quality that feels unpleasant",
      "example": "장마철이라 빨래가 마르지 않고 꿉꿉한 냄새가 난다.",
      "example_en": "The laundry won't dry during the rainy season and gives off a musty smell."
    },
    {
      "korean": "텁텁하다",
      "english": "thick and stale; a heavy, unpleasant sensation in the mouth or air",
      "example": "라면을 먹고 나면 입안이 텁텁해서 물을 많이 마시게 된다.",
      "example_en": "After eating ramyeon, my mouth feels thick and stale, so I end up drinking a lot of water."
    },
    {
      "korean": "칼칼하다",
      "english": "sharp and pungent; a biting spiciness or dryness that hits the throat",
      "example": "김치찌개가 칼칼해서 속이 다 풀리는 기분이다.",
      "example_en": "The kimchi stew is so sharply spicy that it feels like it clears everything up inside."
    },
    {
      "korean": "까끌까끌하다",
      "english": "rough, scratchy; having a coarse texture that irritates when touched",
      "example": "새로 산 수건이 까끌까끌해서 피부에 자극이 심하다.",
      "example_en": "The newly bought towel is so scratchy that it really irritates the skin."
    },
    {
      "korean": "얼얼하다",
      "english": "tingling, numb; a buzzing sensation from spice, cold, or impact",
      "example": "마라탕을 먹었더니 입이 얼얼해서 한동안 맛을 못 느꼈다.",
      "example_en": "After eating mala hotpot, my mouth was so numb that I couldn't taste anything for a while."
    },
    {
      "korean": "비릿하다",
      "english": "having a raw, fishy smell; the metallic scent of blood or raw seafood",
      "example": "시장 골목에 들어서니 생선 비릿한 냄새가 코를 찔렀다.",
      "example_en": "As I entered the market alley, the raw fishy smell hit my nose."
    },
    {
      "korean": "퀴퀴하다",
      "english": "musty, stale; having a stuffy old smell from being closed up too long",
      "example": "오래된 창고 문을 여니 퀴퀴한 냄새가 확 풍겼다.",
      "example_en": "When I opened the old warehouse door, a musty smell instantly wafted out."
    },
    {
      "korean": "느끼하다",
      "english": "greasy, cloying; unpleasantly oily or rich, also used for cheesy or sleazy behavior",
      "example": "크림파스타가 너무 느끼해서 반밖에 못 먹었다.",
      "example_en": "The cream pasta was so greasy that I could only eat half."
    },
    {
      "korean": "텁수룩하다",
      "english": "bushy, shaggy; thick and unkempt, typically describing facial hair or overgrown hair",
      "example": "수염이 텁수룩하게 자라서 면도를 해야겠다.",
      "example_en": "My beard has grown bushy and shaggy, so I should shave."
    },
    {
      "korean": "찌릿하다",
      "english": "sharp tingling; a sudden, electric-like piercing sensation",
      "example": "팔꿈치를 부딪히자 팔 전체가 찌릿하게 저려 왔다.",
      "example_en": "When I bumped my elbow, a sharp tingling sensation ran through my whole arm."
    },
    {
      "korean": "강직하다",
      "english": "upright, principled; rigidly honest and refusing to bend to pressure",
      "example": "강직한 성격 탓에 상사에게도 잘못된 건 잘못됐다고 말한다.",
      "example_en": "Because of his upright character, he tells even his superiors when something is wrong."
    },
    {
      "korean": "비겁하다",
      "english": "cowardly, underhanded; lacking courage or resorting to dishonorable means",
      "example": "책임을 남에게 떠넘기는 건 비겁한 행동이다.",
      "example_en": "Shifting responsibility onto others is a cowardly act."
    },
    {
      "korean": "염치없다",
      "english": "shameless, lacking decency; having no sense of propriety or embarrassment",
      "example": "이렇게 자주 부탁드리기 염치없지만 한 번만 더 도와주세요.",
      "example_en": "I know it's shameless to ask so often, but please help me just one more time."
    },
    {
      "korean": "고결하다",
      "english": "noble, lofty; morally pure and elevated in character",
      "example": "그의 고결한 인격은 주변 사람들에게 깊은 감화를 주었다.",
      "example_en": "His noble character deeply inspired those around him."
    },
    {
      "korean": "비열하다",
      "english": "despicable, vile; morally low and contemptible in behavior",
      "example": "약자를 이용하는 비열한 수법에 분노가 치밀었다.",
      "example_en": "Anger surged at the despicable tactics of exploiting the weak."
    },
    {
      "korean": "결백하다",
      "english": "innocent, guiltless; free from wrongdoing or crime",
      "example": "그는 끝까지 자신의 결백함을 주장하며 재심을 요청했다.",
      "example_en": "He maintained his innocence to the end and requested a retrial."
    },
    {
      "korean": "올곧다",
      "english": "upright, morally straight; adhering firmly to principles without wavering",
      "example": "올곧은 신념을 가진 사람은 어떤 유혹에도 흔들리지 않는다.",
      "example_en": "A person with upright convictions is not swayed by any temptation."
    },
    {
      "korean": "간사하다",
      "english": "treacherous, two-faced; outwardly friendly but harboring deceitful intentions",
      "example": "겉으로는 웃으면서 뒤에서 험담하는 간사한 사람을 조심해야 한다.",
      "example_en": "You have to watch out for treacherous people who smile to your face but gossip behind your back."
    },
    {
      "korean": "후덕하다",
      "english": "virtuous and generous; warm-hearted with a broad generosity of spirit",
      "example": "후덕한 인상 덕분에 처음 만난 사람도 금방 마음을 연다.",
      "example_en": "Thanks to her virtuous and generous demeanor, even people meeting her for the first time quickly open up."
    },
    {
      "korean": "뻔뻔하다",
      "english": "brazen, shameless; showing no embarrassment despite wrongdoing",
      "example": "잘못을 하고도 사과 한마디 없이 뻔뻔하게 구는 게 이해가 안 된다.",
      "example_en": "I can't understand how someone can act so brazenly without even a word of apology after doing something wrong."
    },
    {
      "korean": "까다롭다",
      "english": "exacting, picky; difficult to satisfy or requiring meticulous attention to detail",
      "example": "이 교수님은 과제 기준이 까다로워서 학생들이 긴장한다.",
      "example_en": "Students are nervous because this professor's assignment criteria are exacting."
    },
    {
      "korean": "난해하다",
      "english": "abstruse, incomprehensible; so complex and deep that it is extremely hard to understand",
      "example": "그 소설은 구조가 난해해서 두 번을 읽고서야 이해했다.",
      "example_en": "The novel's structure was so abstruse that I understood it only after reading it twice."
    },
    {
      "korean": "복잡다단하다",
      "english": "complex and multifaceted; involving many intertwined layers of difficulty",
      "example": "한반도의 정세는 복잡다단해서 한마디로 설명할 수 없다.",
      "example_en": "The situation on the Korean Peninsula is complex and multifaceted, impossible to explain in a single sentence."
    },
    {
      "korean": "수월하다",
      "english": "easy, smooth; proceeding without much difficulty or effort",
      "example": "경험이 있으니 이번에는 한결 수월하게 진행할 수 있었다.",
      "example_en": "Since I had experience, I was able to proceed much more smoothly this time."
    },
    {
      "korean": "만만하다",
      "english": "easy-looking, not to be underestimated; appears simple but is deceptively challenging",
      "example": "상대를 만만하게 봤다가 크게 당한 적이 있다.",
      "example_en": "I once underestimated my opponent and paid dearly for it."
    },
    {
      "korean": "정교하다",
      "english": "elaborate, exquisite; crafted with meticulous precision and fine detail",
      "example": "장인의 손에서 탄생한 정교한 도자기에 감탄이 절로 나왔다.",
      "example_en": "The elaborate ceramics born from the artisan's hands drew spontaneous admiration."
    },
    {
      "korean": "자질구레하다",
      "english": "trivial, petty; consisting of many small, unimportant details piled up",
      "example": "자질구레한 업무에 시간을 빼앗기다 보니 정작 중요한 일을 못 했다.",
      "example_en": "I spent so much time on trivial tasks that I couldn't get to the actually important work."
    },
    {
      "korean": "허술하다",
      "english": "sloppy, full of holes; lacking thoroughness and easy to find fault with",
      "example": "보안이 허술해서 개인정보가 대량으로 유출되었다.",
      "example_en": "Security was so sloppy that personal information was leaked on a massive scale."
    },
    {
      "korean": "촘촘하다",
      "english": "tightly woven, dense; with very small gaps, leaving no room for error or escape",
      "example": "법망이 촘촘해야 범죄를 사전에 예방할 수 있다.",
      "example_en": "The legal net must be tightly woven to prevent crime in advance."
    },
    {
      "korean": "번거롭다",
      "english": "cumbersome, troublesome; involving tedious and complicated procedures",
      "example": "서류 절차가 너무 번거로워서 온라인 신청으로 바꿨으면 좋겠다.",
      "example_en": "The paperwork process is so cumbersome that I wish they'd switch to online applications."
    },
    {
      "korean": "서먹서먹하다",
      "english": "awkward, stiff; the uncomfortable distance between people who are not yet close",
      "example": "오랜만에 만난 친구 사이가 서먹서먹해서 어색한 침묵이 흘렀다.",
      "example_en": "Meeting after a long time, things were awkward between us and an uneasy silence filled the air."
    },
    {
      "korean": "소원하다",
      "english": "estranged, distant; having grown apart in a relationship that was once close",
      "example": "한때 절친이었지만 연락을 안 하다 보니 사이가 소원해졌다.",
      "example_en": "We were once best friends, but not keeping in touch made us grow distant."
    },
    {
      "korean": "각별하다",
      "english": "special, extraordinarily close; a bond that stands out from ordinary relationships",
      "example": "할머니와 각별한 사이였기에 그 상실감이 더 컸다.",
      "example_en": "Because I had an extraordinarily close bond with my grandmother, the sense of loss was even greater."
    },
    {
      "korean": "돈독하다",
      "english": "close, solid; describing a strong, reliable relationship built on trust",
      "example": "어려운 시기를 함께 겪으면서 두 사람의 우정은 더욱 돈독해졌다.",
      "example_en": "Going through tough times together made their friendship even stronger and more solid."
    },
    {
      "korean": "원만하다",
      "english": "amicable, smooth; harmonious without friction or conflict",
      "example": "부부 사이가 원만하려면 서로의 공간을 존중해야 한다.",
      "example_en": "For a marriage to be amicable, both sides need to respect each other's space."
    },
    {
      "korean": "냉담하다",
      "english": "cold, indifferent; showing a lack of interest or emotional warmth toward others",
      "example": "인사를 건넸는데 냉담한 반응이 돌아와서 당황스러웠다.",
      "example_en": "I greeted them, but the cold, indifferent response left me flustered."
    },
    {
      "korean": "야박하다",
      "english": "heartless, stingy; lacking generosity or kindness in interpersonal dealings",
      "example": "오래 일한 직원에게 아무런 보상도 없이 내보내다니 너무 야박하다.",
      "example_en": "It's so heartless to let go of a long-serving employee without any compensation."
    },
    {
      "korean": "다정다감하다",
      "english": "tender and sensitive; naturally affectionate and easily moved emotionally",
      "example": "다정다감한 성격이라 남의 사정에도 쉽게 눈물을 흘린다.",
      "example_en": "Being naturally tender and sensitive, she easily sheds tears at others' circumstances."
    },
    {
      "korean": "살갑다",
      "english": "warm, affectionate; showing personal warmth and closeness in a touching way",
      "example": "오랫만에 만난 이모가 살갑게 안아주셔서 마음이 따뜻해졌다.",
      "example_en": "My aunt, whom I hadn't seen in a long time, hugged me warmly, and it warmed my heart."
    },
    {
      "korean": "무뚝뚝하다",
      "english": "blunt, curt; not very expressive and seemingly unfriendly in manner",
      "example": "아버지는 무뚝뚝하지만 행동으로 사랑을 표현하시는 분이다.",
      "example_en": "My father is blunt and curt, but he's someone who expresses love through actions."
    }
  ]
}
