{
  "관용어 (Korean Idioms)": [
    {
      "korean": "백번 찍어 안 넘어가는 나무 없다",
      "english": "No tree can withstand a hundred chops; persistence conquers all",
      "example": "백번 찍어 안 넘어가는 나무 없다고, 계속 연락하니까 결국 만나 줬다.",
      "example_en": "As they say, no tree withstands a hundred chops — I kept reaching out and they finally agreed to meet."
    },
    {
      "korean": "실패는 성공의 어머니",
      "english": "Failure is the mother of success; learn from failure and grow",
      "example": "실패는 성공의 어머니라고, 이번 경험을 교훈으로 삼자.",
      "example_en": "Failure is the mother of success — let's take this experience as a lesson."
    },
    {
      "korean": "갈 데까지 가다",
      "english": "To go as far as it goes; to reach a breaking point or dead end",
      "example": "부부 관계가 갈 데까지 가서 결국 이혼까지 갔다.",
      "example_en": "The marriage reached a breaking point and they ended up divorcing."
    },
    {
      "korean": "엎질러진 물이다",
      "english": "Spilled water; what's done is done and cannot be undone",
      "example": "이미 엎질러진 물이니까 후회해 봤자 소용없다.",
      "example_en": "It's already spilled water — there's no point in regretting it now."
    },
    {
      "korean": "바닥을 치다",
      "english": "To hit rock bottom; to reach the lowest point before recovery",
      "example": "주가가 바닥을 치고 나서 서서히 반등하기 시작했다.",
      "example_en": "After hitting rock bottom, the stock price slowly began to recover."
    },
    {
      "korean": "뜻이 있는 곳에 길이 있다",
      "english": "Where there's a will, there's a way",
      "example": "뜻이 있는 곳에 길이 있다고, 포기하지 않으면 방법이 생긴다.",
      "example_en": "Where there's a will, there's a way — if you don't give up, a solution will appear."
    },
    {
      "korean": "물에 빠진 사람 지푸라기라도 잡는다",
      "english": "A drowning person will grab even a straw; desperation leads to grasping at anything",
      "example": "물에 빠진 사람 지푸라기라도 잡는다고, 안 되는 줄 알면서도 일단 시도해 봤다.",
      "example_en": "Like a drowning person clutching at straws, I gave it a shot even though I knew it probably wouldn't work."
    },
    {
      "korean": "구르는 돌에는 이끼가 끼지 않는다",
      "english": "A rolling stone gathers no moss; staying active prevents stagnation",
      "example": "구르는 돌에는 이끼가 끼지 않는다고, 꾸준히 움직여야 발전한다.",
      "example_en": "A rolling stone gathers no moss — you have to keep moving to make progress."
    },
    {
      "korean": "바늘 도둑이 소 도둑 된다",
      "english": "A needle thief becomes a cow thief; small misdeeds lead to bigger ones",
      "example": "바늘 도둑이 소 도둑 된다고, 작은 거짓말도 허용하면 안 된다.",
      "example_en": "As they say, a needle thief becomes a cow thief — you shouldn't tolerate even small lies."
    },
    {
      "korean": "고생 끝에 낙이 온다",
      "english": "Joy comes at the end of hardship; after the storm comes the calm",
      "example": "고생 끝에 낙이 온다더니, 힘든 시기를 넘기니 좋은 일이 생겼다.",
      "example_en": "They say joy comes after hardship — good things happened after I got through the tough times."
    },
    {
      "korean": "꿩 대신 닭",
      "english": "A chicken instead of a pheasant; a substitute when the ideal isn't available",
      "example": "원하는 호텔이 만석이라 꿩 대신 닭으로 근처 숙소에 묵었다.",
      "example_en": "The hotel I wanted was fully booked, so I settled for a nearby place as a substitute."
    },
    {
      "korean": "빈대 잡으려다 초가삼간 태운다",
      "english": "Burning down a thatched house to catch a bedbug; causing greater harm while fixing a minor problem",
      "example": "하나를 고치려다 전체를 망가뜨렸으니 빈대 잡으려다 초가삼간 태운 꼴이다.",
      "example_en": "I tried to fix one thing and ruined everything — like burning down the house to catch a bug."
    },
    {
      "korean": "등잔 밑이 어둡다",
      "english": "It's darkest under the lamp; overlooking what's right in front of you",
      "example": "가장 가까운 가족의 고민을 몰랐다니, 등잔 밑이 어둡다.",
      "example_en": "I didn't even notice my own family's worries — it really is darkest under the lamp."
    },
    {
      "korean": "모르는 게 약이다",
      "english": "Not knowing is the best medicine; ignorance is bliss",
      "example": "차라리 모르는 게 약이다. 알고 나서 더 힘들어졌다.",
      "example_en": "Ignorance really is bliss — I've been struggling more since I found out."
    },
    {
      "korean": "서당 개 삼 년이면 풍월을 읊는다",
      "english": "A dog at a village school recites poetry after three years; even a slow learner absorbs knowledge over time",
      "example": "서당 개 삼 년이면 풍월을 읊는다고, 엄마 옆에서 보다 보니 요리를 배웠다.",
      "example_en": "As they say, even a dog at school learns — I picked up cooking just by watching my mom over the years."
    },
    {
      "korean": "호미로 막을 것을 가래로 막는다",
      "english": "Using a shovel for what a hoe could handle; letting a small problem grow into a big one through delay",
      "example": "처음에 빨리 처리했으면 됐을 일인데 호미로 막을 것을 가래로 막는 꼴이 됐다.",
      "example_en": "It would have been easy to handle at first, but by delaying, a small problem became a huge ordeal."
    },
    {
      "korean": "한 귀로 듣고 한 귀로 흘리다",
      "english": "In one ear and out the other; not paying attention to what is said",
      "example": "아무리 조언해도 한 귀로 듣고 한 귀로 흘린다.",
      "example_en": "No matter how much advice I give, it goes in one ear and out the other."
    },
    {
      "korean": "아는 것이 힘이다",
      "english": "Knowledge is power; being informed gives you an advantage",
      "example": "아는 것이 힘이라고, 공부해 두면 언젠가 반드시 쓸모가 있다.",
      "example_en": "Knowledge is power — what you study will definitely come in handy someday."
    },
    {
      "korean": "하늘이 무너져도 솟아날 구멍이 있다",
      "english": "Even if the sky collapses, there's a hole to escape through; there's always a way out",
      "example": "하늘이 무너져도 솟아날 구멍이 있다고, 너무 절망하지 마.",
      "example_en": "They say there's always a way out even if the sky falls — don't despair too much."
    },
    {
      "korean": "재수가 없으면 뒤로 넘어져도 코가 깨진다",
      "english": "When you're unlucky, you break your nose even falling backward; when it rains, it pours",
      "example": "오늘 버스도 놓치고 지갑도 잃어버렸다. 재수가 없으면 뒤로 넘어져도 코가 깨진다.",
      "example_en": "I missed the bus and lost my wallet today. When it rains, it really pours."
    },
    {
      "korean": "되로 주고 말로 받는다",
      "english": "Give by the small measure, receive by the large; what goes around comes around, amplified",
      "example": "되로 주고 말로 받는다고, 남에게 나쁘게 하면 더 크게 돌아온다.",
      "example_en": "As the saying goes, you'll get back more than you gave — treat others badly and it comes back worse."
    },
    {
      "korean": "팔자가 세다",
      "english": "To have a tough destiny; to be fated for hardship (lit. 'one's fortune character is strong')",
      "example": "그녀는 어릴 때부터 고생이 많아서 팔자가 세다고들 한다.",
      "example_en": "She's been through so much hardship since childhood that people say she has a tough fate."
    },
    {
      "korean": "복이 터지다",
      "english": "For a flood of good luck to burst forth; to hit the jackpot (lit. 'fortune bursts open')",
      "example": "승진도 하고 로또도 당첨됐다니, 복이 터진 거다.",
      "example_en": "A promotion and a lottery win — your luck has really burst wide open."
    },
    {
      "korean": "제 풀에 넘어지다",
      "english": "To collapse on one's own; to give in or fail without external pressure (lit. 'fall by one's own grass')",
      "example": "경쟁자가 아무것도 안 했는데 상대가 제 풀에 넘어졌다.",
      "example_en": "The competitor didn't do anything, but the opponent collapsed on their own."
    },
    {
      "korean": "될 놈은 된다",
      "english": "What's destined to succeed will succeed; some things are just meant to be",
      "example": "아무 준비 없이 갔는데 합격했다니, 될 놈은 된다.",
      "example_en": "He went without any preparation and still passed — some things are just meant to be."
    },
    {
      "korean": "제 무덤을 파다",
      "english": "To dig one's own grave; to bring about one's own ruin through foolish actions",
      "example": "거짓말을 계속하다가 결국 제 무덤을 팠다.",
      "example_en": "He kept lying and eventually dug his own grave."
    },
    {
      "korean": "겉 다르고 속 다르다",
      "english": "Different on the outside and inside; what you see is not what you get",
      "example": "그 사람은 겉 다르고 속 달라서 겉모습만 보고 판단하면 안 된다.",
      "example_en": "That person is different inside and out — you shouldn't judge by appearances alone."
    },
    {
      "korean": "보기 좋은 떡이 먹기도 좋다",
      "english": "A good-looking rice cake tastes good too; presentation matters",
      "example": "보기 좋은 떡이 먹기도 좋다고, 음식은 담음새도 중요하다.",
      "example_en": "As they say, a good-looking rice cake tastes better — the presentation of food matters too."
    },
    {
      "korean": "겉핥기",
      "english": "Surface licking; only scratching the surface; superficial understanding or effort",
      "example": "겉핥기 식으로 공부하면 실력이 늘지 않는다.",
      "example_en": "If you study in a superficial, surface-level way, your skills won't improve."
    },
    {
      "korean": "꼬리가 길면 잡힌다",
      "english": "If the tail is long, it gets caught; wrongdoing is eventually exposed over time",
      "example": "꼬리가 길면 잡힌다더니, 결국 비리가 전부 드러났다.",
      "example_en": "They say a long tail gets caught — the corruption was eventually fully exposed."
    },
    {
      "korean": "같은 값이면 다홍치마",
      "english": "If it's the same price, pick the red skirt; all else being equal, choose the better-looking option",
      "example": "같은 값이면 다홍치마라고, 성능이 비슷하면 디자인이 예쁜 걸로 사자.",
      "example_en": "If the price is the same, pick the prettier one — if the specs are similar, let's buy the one with the better design."
    },
    {
      "korean": "양의 탈을 쓴 늑대",
      "english": "A wolf in sheep's clothing; someone hiding malicious intent behind a kind exterior",
      "example": "그 사람은 양의 탈을 쓴 늑대처럼 착한 척하면서 뒤로는 나쁜 짓을 한다.",
      "example_en": "That person is like a wolf in sheep's clothing — acting kind while doing bad things behind the scenes."
    },
    {
      "korean": "번데기 앞에서 주름 잡다",
      "english": "To put on airs in front of a chrysalis; to bluff before someone who knows the truth (lit. 'wrinkling in front of a pupa')",
      "example": "나한테 번데기 앞에서 주름 잡지 마. 다 아는 사이잖아.",
      "example_en": "Don't try to bluff in front of me — we both know the real situation."
    },
    {
      "korean": "눈 가리고 아웅",
      "english": "Covering one's eyes and saying 'meow'; a transparent and pathetic deception that fools no one",
      "example": "누가 봐도 뻔한 거짓말인데 눈 가리고 아웅이다.",
      "example_en": "It's an obvious lie that anyone can see through — a pathetic attempt at deception."
    },
    {
      "korean": "한술 더 뜨다",
      "english": "To go one step further; to outdo someone, especially in a negative way (lit. 'scoop one more spoon')",
      "example": "화가 나서 소리를 질렀더니 그 사람은 한술 더 떠서 물건을 던졌다.",
      "example_en": "I yelled in anger, and he took it one step further and threw things."
    },
    {
      "korean": "눈독을 들이다",
      "english": "To set one's sights on something; to covet (lit. 'set poison eyes on')",
      "example": "그 한정판 운동화에 눈독을 들이고 있었는데 이미 품절이다.",
      "example_en": "I had my eye on those limited edition sneakers, but they're already sold out."
    },
    {
      "korean": "손사래를 치다",
      "english": "To wave one's hands in refusal; to frantically deny or decline",
      "example": "한턱내라고 하니까 손사래를 치며 거절했다.",
      "example_en": "When I asked him to treat us, he waved his hands and firmly refused."
    },
    {
      "korean": "김이 새다",
      "english": "For steam to leak out; to lose enthusiasm or momentum (lit. 'steam escapes')",
      "example": "신나게 준비하고 있었는데 취소 소식에 김이 샜다.",
      "example_en": "I was excitedly preparing, but the news of the cancellation killed all my enthusiasm."
    },
    {
      "korean": "파김치가 되다",
      "english": "To become wilted green-onion kimchi; to be completely worn out and exhausted",
      "example": "야근을 일주일째 하다 보니 파김치가 됐다.",
      "example_en": "After a full week of overtime, I'm completely wiped out."
    },
    {
      "korean": "속 빈 강정",
      "english": "A hollow rice puff; something that looks good on the outside but has no substance inside",
      "example": "이력서는 화려한데 실력이 없으니 속 빈 강정이다.",
      "example_en": "The resume is impressive, but there's no real skill behind it — just a hollow shell."
    },
    {
      "korean": "찬물도 위아래가 있다",
      "english": "Even cold water has an upper and lower part; there is a proper order and hierarchy in everything",
      "example": "찬물도 위아래가 있다고, 윗사람한테는 예의를 지켜야지.",
      "example_en": "Even cold water has an order — you should show proper respect to your seniors."
    },
    {
      "korean": "다리를 놓다",
      "english": "To build a bridge; to introduce or connect people as an intermediary or matchmaker",
      "example": "친구가 다리를 놓아 줘서 좋은 사람을 소개받았다.",
      "example_en": "My friend played matchmaker and introduced me to a great person."
    },
    {
      "korean": "미꾸라지 한 마리가 온 웅덩이를 흐린다",
      "english": "One loach muddies the whole pond; one bad apple spoils the bunch",
      "example": "미꾸라지 한 마리가 온 웅덩이를 흐린다고, 한 사람 때문에 팀 전체 이미지가 나빠졌다.",
      "example_en": "One bad apple spoils the bunch — one person's actions ruined the entire team's reputation."
    },
    {
      "korean": "시치미를 떼다",
      "english": "To feign innocence; to play dumb as if one knows nothing (from falconry: removing the name tag from a stolen hawk)",
      "example": "분명히 알면서도 시치미를 떼는 모습이 얄밉다.",
      "example_en": "It's infuriating how he plays dumb even though he clearly knows."
    },
    {
      "korean": "제 코가 석 자",
      "english": "One's own nose is three feet long; too preoccupied with one's own troubles to help others",
      "example": "나도 제 코가 석 자라 남을 도와줄 여유가 없다.",
      "example_en": "I'm too swamped with my own problems to have any room to help others."
    }
  ]
}