{
  "관용어 (Korean Idioms)": [
    {
      "korean": "눈이 돌아가다",
      "english": "To lose one's mind; to go crazy with greed or anger (lit. 'eyes rolling')",
      "example": "세일 소식을 듣자마자 눈이 돌아가서 다 사 버렸다.",
      "example_en": "As soon as I heard about the sale, I went crazy and bought everything."
    },
    {
      "korean": "코앞에 닥치다",
      "english": "To be imminent; right around the corner (lit. 'approaching the tip of one's nose')",
      "example": "시험이 코앞에 닥쳤는데 아직 준비를 못 했다.",
      "example_en": "The exam is right around the corner but I still haven't prepared."
    },
    {
      "korean": "입이 가볍다",
      "english": "To be loose-lipped; unable to keep secrets (lit. 'light mouth')",
      "example": "그 사람은 입이 가벼워서 비밀을 말하면 안 돼.",
      "example_en": "He's loose-lipped, so you shouldn't tell him secrets."
    },
    {
      "korean": "귀를 기울이다",
      "english": "To listen attentively; to lend an ear (lit. 'tilt one's ear')",
      "example": "학생들이 선생님의 이야기에 귀를 기울였다.",
      "example_en": "The students listened attentively to the teacher's story."
    },
    {
      "korean": "손이 모자라다",
      "english": "To be short-handed; not enough people to help (lit. 'hands are insufficient')",
      "example": "주문이 밀려서 손이 모자란다.",
      "example_en": "Orders are piling up and we're short-handed."
    },
    {
      "korean": "발이 묶이다",
      "english": "To be stuck; unable to leave or go somewhere (lit. 'feet are tied')",
      "example": "폭설 때문에 공항에서 발이 묶였다.",
      "example_en": "I was stranded at the airport because of heavy snow."
    },
    {
      "korean": "배가 아프다",
      "english": "To be jealous of someone's success (lit. 'stomach hurts')",
      "example": "친구가 승진했다는 소식에 솔직히 배가 아팠다.",
      "example_en": "Honestly, I was jealous when I heard my friend got promoted."
    },
    {
      "korean": "등을 돌리다",
      "english": "To turn one's back on someone; to abandon (lit. 'turn one's back')",
      "example": "어려울 때 모두가 등을 돌렸다.",
      "example_en": "When times got tough, everyone turned their backs on me."
    },
    {
      "korean": "머리를 맞대다",
      "english": "To put heads together; to brainstorm collectively (lit. 'press heads together')",
      "example": "팀원들이 머리를 맞대고 해결책을 찾았다.",
      "example_en": "The team members put their heads together and found a solution."
    },
    {
      "korean": "눈에 불을 켜다",
      "english": "To search with fierce intensity; to be on high alert (lit. 'light a fire in one's eyes')",
      "example": "경찰이 눈에 불을 켜고 범인을 찾고 있다.",
      "example_en": "The police are searching with fierce intensity for the suspect."
    },
    {
      "korean": "코빼기도 안 보이다",
      "english": "No trace of someone; completely absent (lit. 'can't even see the bridge of the nose')",
      "example": "약속 시간이 지났는데 코빼기도 안 보인다.",
      "example_en": "The meeting time has passed and there's no sign of them."
    },
    {
      "korean": "입을 모으다",
      "english": "To speak unanimously; to say the same thing in one voice (lit. 'gather mouths')",
      "example": "전문가들이 입을 모아 경제 회복을 전망했다.",
      "example_en": "Experts unanimously predicted an economic recovery."
    },
    {
      "korean": "발을 끊다",
      "english": "To stop visiting; to cut ties with a place (lit. 'sever one's feet')",
      "example": "그 식당은 서비스가 나빠서 발을 끊었다.",
      "example_en": "I stopped going to that restaurant because the service was bad."
    },
    {
      "korean": "눈 깜짝할 사이",
      "english": "In the blink of an eye; in an instant (lit. 'while blinking an eye')",
      "example": "눈 깜짝할 사이에 아이가 이렇게 컸다.",
      "example_en": "The child grew up this much in the blink of an eye."
    },
    {
      "korean": "손을 보다",
      "english": "To fix or repair something; also to teach someone a lesson (lit. 'look at one's hands')",
      "example": "고장 난 시계를 좀 손을 봐야겠다.",
      "example_en": "I need to fix the broken clock."
    },
    {
      "korean": "입이 귀에 걸리다",
      "english": "To grin from ear to ear; to beam with joy (lit. 'mouth hangs on the ears')",
      "example": "합격 소식을 듣고 입이 귀에 걸렸다.",
      "example_en": "After hearing the news of passing, I was grinning from ear to ear."
    },
    {
      "korean": "발을 동동 구르다",
      "english": "To stamp one's feet in frustration or anxiety (lit. 'stomp feet thump-thump')",
      "example": "버스가 눈앞에서 떠나자 발을 동동 굴렀다.",
      "example_en": "I stamped my feet in frustration as the bus left right before my eyes."
    },
    {
      "korean": "눈을 붙이다",
      "english": "To catch some sleep; to doze off briefly (lit. 'attach one's eyes')",
      "example": "밤새 일하다가 잠깐 눈을 붙였다.",
      "example_en": "I caught a brief nap after working all night."
    },
    {
      "korean": "손을 씻다",
      "english": "To wash one's hands of something; to quit a shady business (lit. 'wash hands')",
      "example": "그는 도박에서 손을 씻고 새 출발을 했다.",
      "example_en": "He washed his hands of gambling and made a fresh start."
    },
    {
      "korean": "머리가 굳다",
      "english": "To become set in one's ways; inflexible thinking (lit. 'head hardens')",
      "example": "나이가 드니까 머리가 굳어서 새로운 걸 배우기 힘들다.",
      "example_en": "As I get older, my thinking gets rigid and it's hard to learn new things."
    },
    {
      "korean": "등골이 빠지다",
      "english": "To work oneself to the bone; back-breaking labor (lit. 'spine comes out')",
      "example": "등골이 빠지게 일해도 월급은 그대로다.",
      "example_en": "Even though I work myself to the bone, the salary stays the same."
    },
    {
      "korean": "귀가 따갑다",
      "english": "To hear something so often it stings; tired of hearing (lit. 'ears sting')",
      "example": "일찍 자라는 말을 귀가 따갑게 들었다.",
      "example_en": "I've heard 'go to bed early' so many times my ears sting."
    },
    {
      "korean": "목을 매다",
      "english": "To stake everything on something; to be desperate about (lit. 'hang by the neck')",
      "example": "그 프로젝트에 목을 매고 있으니 꼭 성공해야 한다.",
      "example_en": "I've staked everything on that project, so it must succeed."
    },
    {
      "korean": "입을 다물다",
      "english": "To keep one's mouth shut; to remain silent (lit. 'close one's mouth')",
      "example": "그 사건에 대해 모두가 입을 다물었다.",
      "example_en": "Everyone kept their mouths shut about the incident."
    },
    {
      "korean": "손발이 맞다",
      "english": "To work well together; to be in perfect sync (lit. 'hands and feet match')",
      "example": "오래 같이 일해서 이제 손발이 잘 맞는다.",
      "example_en": "We've worked together so long that we're in perfect sync now."
    },
    {
      "korean": "하룻강아지 범 무서운 줄 모른다",
      "english": "A day-old puppy doesn't fear the tiger; the young and inexperienced are fearless",
      "example": "신입이 사장한테 직접 건의하다니, 하룻강아지 범 무서운 줄 모르는구나.",
      "example_en": "The new hire made a suggestion directly to the CEO — talk about not knowing what they're up against."
    },
    {
      "korean": "우물 안 개구리",
      "english": "A frog in a well; someone with a narrow worldview",
      "example": "여행을 다녀와 보니 내가 우물 안 개구리였다는 걸 깨달았다.",
      "example_en": "After traveling, I realized I had been a frog in a well."
    },
    {
      "korean": "소 잃고 외양간 고친다",
      "english": "Fixing the barn after losing the cow; too late to prevent damage",
      "example": "사고가 난 후에야 안전 점검을 하다니, 소 잃고 외양간 고치는 격이다.",
      "example_en": "Doing safety inspections only after an accident is like locking the barn after the cow is gone."
    },
    {
      "korean": "호랑이도 제 말 하면 온다",
      "english": "Speak of the devil (lit. 'speak of the tiger and it comes')",
      "example": "호랑이도 제 말 하면 온다더니, 방금 네 이야기를 하고 있었어.",
      "example_en": "Speak of the devil — we were just talking about you."
    },
    {
      "korean": "까마귀 날자 배 떨어진다",
      "english": "An unfortunate coincidence; bad timing creates suspicion (lit. 'the crow flies off and the pear falls')",
      "example": "내가 지나가자마자 꽃병이 깨졌는데, 까마귀 날자 배 떨어진 격이다.",
      "example_en": "The vase broke right when I walked by — just an unfortunate coincidence."
    },
    {
      "korean": "개천에서 용 나다",
      "english": "A dragon rising from a stream; a great person from humble origins",
      "example": "가난한 집안에서 의사가 되다니, 개천에서 용 났다.",
      "example_en": "Becoming a doctor from a poor family — a dragon has risen from the stream."
    },
    {
      "korean": "빈 수레가 요란하다",
      "english": "An empty cart rattles the loudest; those who know least talk the most",
      "example": "아는 것도 없으면서 목소리만 크다니, 빈 수레가 요란하다.",
      "example_en": "Talking so loud without knowing anything — the empty cart rattles the most."
    },
    {
      "korean": "바람 앞의 등불",
      "english": "A candle in the wind; a precarious and fragile situation",
      "example": "회사의 경영 상태가 바람 앞의 등불이다.",
      "example_en": "The company's financial state is like a candle in the wind."
    },
    {
      "korean": "닭 쫓던 개 지붕 쳐다보듯",
      "english": "Like a dog that chased a chicken staring at the roof; helplessly watching after losing one's chance",
      "example": "기회를 놓치고 닭 쫓던 개 지붕 쳐다보듯 멍하니 서 있었다.",
      "example_en": "After missing the opportunity, I stood there helplessly staring into space."
    },
    {
      "korean": "원숭이도 나무에서 떨어진다",
      "english": "Even monkeys fall from trees; even experts make mistakes",
      "example": "그렇게 실력 있는 선수도 실수하네, 원숭이도 나무에서 떨어지는 법이지.",
      "example_en": "Even such a skilled player makes mistakes — even monkeys fall from trees."
    },
    {
      "korean": "가는 날이 장날",
      "english": "The day you go happens to be market day; an unexpected coincidence",
      "example": "가는 날이 장날이라고, 도착하자마자 비가 쏟아졌다.",
      "example_en": "Just my luck — it started pouring the moment I arrived."
    },
    {
      "korean": "세 살 버릇 여든까지 간다",
      "english": "Habits formed at age three last until eighty; old habits die hard",
      "example": "세 살 버릇 여든까지 간다고, 어릴 때부터 올바른 습관을 길러야 한다.",
      "example_en": "As they say, habits from age three last to eighty — you should build good habits from childhood."
    },
    {
      "korean": "구름 잡는 이야기",
      "english": "A story of catching clouds; vague or unrealistic talk",
      "example": "구체적인 계획 없이 구름 잡는 이야기만 하고 있다.",
      "example_en": "Without any concrete plan, they're just talking about pie in the sky."
    },
    {
      "korean": "비 온 뒤에 땅이 굳어진다",
      "english": "The ground hardens after rain; adversity makes one stronger",
      "example": "비 온 뒤에 땅이 굳어진다고, 이번 위기를 잘 넘기면 더 강해질 거야.",
      "example_en": "They say the ground hardens after rain — if we get through this crisis, we'll be stronger."
    },
    {
      "korean": "뱁새가 황새 따라가면 가랑이 찢어진다",
      "english": "If a small bird tries to follow a crane, its legs will split; don't overreach beyond your means",
      "example": "부자 친구를 따라 쓰다가는 뱁새가 황새 따라가면 가랑이 찢어진다.",
      "example_en": "If you keep spending like your rich friend, you'll tear yourself apart trying to keep up."
    },
    {
      "korean": "그림의 떡",
      "english": "A rice cake in a painting; something desirable but unattainable",
      "example": "저 명품 가방은 나에게 그림의 떡이다.",
      "example_en": "That luxury bag is like a painting of rice cake to me — I can only look."
    },
    {
      "korean": "누워서 떡 먹기",
      "english": "Eating rice cake while lying down; something extremely easy",
      "example": "이 정도 문제는 나에게 누워서 떡 먹기지.",
      "example_en": "A problem like this is a walk in the park for me."
    },
    {
      "korean": "국수를 먹다",
      "english": "To eat noodles; to attend someone's wedding (noodles are served at Korean weddings)",
      "example": "언제 국수 먹여 줄 거야?",
      "example_en": "When are you going to let us eat your wedding noodles? (When are you getting married?)"
    },
    {
      "korean": "떡 줄 사람은 생각도 않는데 김칫국부터 마신다",
      "english": "Drinking kimchi broth before being offered rice cake; counting chickens before they hatch",
      "example": "합격도 안 했는데 월급부터 계산하다니, 떡 줄 사람은 생각도 않는데 김칫국부터 마신다.",
      "example_en": "You haven't even passed yet but you're calculating your salary — you're counting your chickens before they hatch."
    },
    {
      "korean": "찬밥 신세",
      "english": "Cold-rice treatment; being neglected or left out (lit. 'the fate of cold rice')",
      "example": "새 직원이 오고 나서 나는 찬밥 신세가 됐다.",
      "example_en": "After the new employee came, I became old news — treated like cold rice."
    },
    {
      "korean": "밥 먹듯 하다",
      "english": "To do something as regularly as eating rice; to do habitually or constantly",
      "example": "그 사람은 거짓말을 밥 먹듯 한다.",
      "example_en": "That person lies as often as they eat — it's a daily habit."
    },
    {
      "korean": "죽도 밥도 안 되다",
      "english": "Neither porridge nor rice; something that turned out to be neither one thing nor another",
      "example": "이것저것 하다 보니 죽도 밥도 안 됐다.",
      "example_en": "I tried doing this and that and ended up with nothing — neither here nor there."
    },
    {
      "korean": "떡 본 김에 제사 지낸다",
      "english": "Since you see the rice cake, hold the memorial rite; seize the opportunity while it's there",
      "example": "떡 본 김에 제사 지낸다고, 재료가 있으니 오늘 바로 만들자.",
      "example_en": "Since we already have the ingredients, let's just make it today — strike while the iron's hot."
    },
    {
      "korean": "밥값을 하다",
      "english": "To earn one's keep; to pull one's weight (lit. 'earn the price of rice')",
      "example": "이번 프로젝트에서 제대로 밥값 좀 해 봐.",
      "example_en": "Try to really pull your weight on this project."
    },
    {
      "korean": "콩으로 메주를 쑨다 해도 안 믿는다",
      "english": "Wouldn't believe it even if told meju is made from beans; to completely distrust someone",
      "example": "그 사람이 하는 말은 콩으로 메주를 쑨다 해도 안 믿겠다.",
      "example_en": "I wouldn't believe a word that person says, even if they stated the obvious."
    },
    {
      "korean": "눈치가 빠르다",
      "english": "To be quick at reading the room; perceptive and socially aware (lit. 'fast nunchi')",
      "example": "눈치가 빨라서 분위기를 금방 파악한다.",
      "example_en": "She's so perceptive that she reads the room in an instant."
    },
    {
      "korean": "정이 들다",
      "english": "To grow fond of; to become emotionally attached over time",
      "example": "처음엔 싫었는데 살다 보니 이 동네에 정이 들었다.",
      "example_en": "I didn't like it at first, but after living here a while, I've grown attached to this neighborhood."
    },
    {
      "korean": "뒷담화를 하다",
      "english": "To gossip behind someone's back; to talk about someone when they're not around",
      "example": "뒷담화를 하다가 본인한테 들킨 적이 있다.",
      "example_en": "I once got caught gossiping behind someone's back."
    },
    {
      "korean": "미운 정 고운 정",
      "english": "Feelings of both love and hate; a love-hate bond formed over time",
      "example": "오래 사귀다 보니 미운 정 고운 정 다 들었다.",
      "example_en": "After being together so long, we've built up both love and resentment."
    },
    {
      "korean": "말이 통하다",
      "english": "To communicate well; to be on the same wavelength (lit. 'words connect')",
      "example": "그 친구하고는 말이 잘 통해서 같이 있으면 편하다.",
      "example_en": "I communicate well with that friend, so it's comfortable being together."
    },
    {
      "korean": "마음이 맞다",
      "english": "To be like-minded; to click with someone (lit. 'hearts match')",
      "example": "처음 만났는데 마음이 맞아서 금방 친해졌다.",
      "example_en": "We just met, but we clicked right away and became friends quickly."
    },
    {
      "korean": "낯이 뜨겁다",
      "english": "To feel embarrassed or ashamed (lit. 'face is hot')",
      "example": "칭찬을 너무 많이 받아서 낯이 뜨거웠다.",
      "example_en": "I received so many compliments that I felt embarrassed."
    },
    {
      "korean": "체면을 차리다",
      "english": "To save face; to keep up appearances",
      "example": "체면을 차리느라 도움을 요청하지 못했다.",
      "example_en": "I couldn't ask for help because I was trying to save face."
    },
    {
      "korean": "뒤끝이 있다",
      "english": "To hold grudges; to harbor resentment after a conflict",
      "example": "그 사람은 뒤끝이 있어서 한번 싸우면 오래 간다.",
      "example_en": "He holds grudges, so once you fight with him, it lasts a long time."
    },
    {
      "korean": "눈치를 보다",
      "english": "To read the room; to gauge others' reactions cautiously (lit. 'look at nunchi')",
      "example": "상사 눈치를 보느라 자기 의견을 말하지 못했다.",
      "example_en": "I couldn't express my opinion because I was too busy reading my boss's mood."
    },
    {
      "korean": "정이 떨어지다",
      "english": "To lose affection; to fall out of love (lit. 'affection drops')",
      "example": "계속 실망시키더니 이제 정이 떨어졌다.",
      "example_en": "After being disappointed over and over, I've lost all affection."
    },
    {
      "korean": "피도 눈물도 없다",
      "english": "To be cold-hearted and merciless (lit. 'no blood, no tears')",
      "example": "그렇게 잘라 버리다니 피도 눈물도 없는 사람이다.",
      "example_en": "Cutting people off like that — what a cold-hearted person."
    },
    {
      "korean": "마음을 놓다",
      "english": "To feel at ease; to let one's guard down (lit. 'release one's heart')",
      "example": "검사 결과가 정상이라 이제 마음을 놓았다.",
      "example_en": "The test results came back normal, so now I can relax."
    },
    {
      "korean": "사돈 남 말 하다",
      "english": "The pot calling the kettle black; criticizing others for faults you share",
      "example": "너도 똑같이 하면서 사돈 남 말 하고 있네.",
      "example_en": "You do the same thing and yet here you are pointing fingers — pot, meet kettle."
    },
    {
      "korean": "찬물을 끼얹다",
      "english": "To pour cold water on; to dampen someone's enthusiasm",
      "example": "신나서 이야기하는데 찬물을 끼얹지 마.",
      "example_en": "Don't pour cold water on me when I'm excitedly talking about it."
    },
    {
      "korean": "발 벗고 나서다",
      "english": "To eagerly step up to help; to jump in with both feet (lit. 'take off shoes and step forward')",
      "example": "이웃이 어려움에 처하자 모두가 발 벗고 나섰다.",
      "example_en": "When the neighbor was in trouble, everyone eagerly stepped up to help."
    },
    {
      "korean": "삽질을 하다",
      "english": "To do pointless or wasted work (lit. 'to shovel')",
      "example": "방향을 잘못 잡아서 하루 종일 삽질만 했다.",
      "example_en": "I went in the wrong direction and ended up doing pointless work all day."
    },
    {
      "korean": "쇠뿔도 단김에 빼라",
      "english": "Strike while the iron is hot; do it while you have the momentum (lit. 'pull the ox horn while it's hot')",
      "example": "쇠뿔도 단김에 빼라고, 결심했으면 바로 시작해.",
      "example_en": "Strike while the iron's hot — if you've made up your mind, start right away."
    },
    {
      "korean": "작심삼일",
      "english": "A resolution that lasts only three days; failing to keep a commitment",
      "example": "다이어트를 시작했지만 또 작심삼일이 되고 말았다.",
      "example_en": "I started a diet, but once again it only lasted three days."
    },
    {
      "korean": "빛 좋은 개살구",
      "english": "A pretty but tasteless wild apricot; all show, no substance",
      "example": "그 식당은 인테리어만 화려하고 빛 좋은 개살구다.",
      "example_en": "That restaurant has fancy decor but the food is nothing special — all style, no substance."
    },
    {
      "korean": "천리 길도 한 걸음부터",
      "english": "A journey of a thousand li begins with a single step",
      "example": "천리 길도 한 걸음부터라고, 작은 것부터 시작해 보자.",
      "example_en": "A journey of a thousand miles begins with a single step — let's start with the small things."
    },
    {
      "korean": "돌다리도 두들겨 보고 건너라",
      "english": "Knock on a stone bridge before crossing; look before you leap",
      "example": "돌다리도 두들겨 보고 건너라고, 계약 전에 꼼꼼히 확인해.",
      "example_en": "Look before you leap — check everything carefully before signing the contract."
    },
    {
      "korean": "티끌 모아 태산",
      "english": "Gather dust to make a mountain; every little bit adds up",
      "example": "티끌 모아 태산이라고, 매일 조금씩 저축하면 큰돈이 된다.",
      "example_en": "Every little bit adds up — if you save a little each day, it becomes a large sum."
    },
    {
      "korean": "팔을 걷어붙이다",
      "english": "To roll up one's sleeves; to get down to serious work",
      "example": "더 이상 미룰 수 없어서 팔을 걷어붙이고 일을 시작했다.",
      "example_en": "I couldn't put it off any longer, so I rolled up my sleeves and got to work."
    },
    {
      "korean": "하나를 보면 열을 안다",
      "english": "See one thing and know ten; you can judge the whole from a part",
      "example": "하나를 보면 열을 안다고, 그 사람의 행동만 봐도 성격을 알 수 있다.",
      "example_en": "As the saying goes, you can tell ten things from one — just watching their behavior reveals their character."
    },
    {
      "korean": "백지장도 맞들면 낫다",
      "english": "Even a sheet of paper is lighter when held by two; teamwork makes things easier",
      "example": "백지장도 맞들면 낫다고, 같이 하면 금방 끝낼 수 있어.",
      "example_en": "Two heads are better than one — if we work together, we can finish quickly."
    },
    {
      "korean": "소 귀에 경 읽기",
      "english": "Reading scriptures to a cow; wasting your breath on someone who won't listen",
      "example": "그 사람한테 아무리 조언해 봤자 소 귀에 경 읽기다.",
      "example_en": "No matter how much advice you give that person, it's like talking to a wall."
    },
    {
      "korean": "될성부른 나무는 떡잎부터 알아본다",
      "english": "A tree destined to grow tall is recognized from its first leaves; talent shows early",
      "example": "될성부른 나무는 떡잎부터 알아본다더니, 어릴 때부터 재능이 보였다.",
      "example_en": "They say you can spot talent early — even as a child, the gift was obvious."
    },
    {
      "korean": "급할수록 돌아가라",
      "english": "The more urgent it is, take the longer path; haste makes waste",
      "example": "급할수록 돌아가라고, 서두르지 말고 차근차근 하자.",
      "example_en": "Haste makes waste — let's not rush and take it step by step."
    },
    {
      "korean": "우물을 파도 한 우물을 파라",
      "english": "Even if you dig a well, dig one well deep; focus on one thing rather than many",
      "example": "이것저것 손대지 말고 우물을 파도 한 우물을 파라.",
      "example_en": "Don't dabble in everything — if you're going to dig, dig one well deep."
    }
  ]
}
