{
  "주제별 단어 — 미디어 (Topic: Media)": [
    {
      "korean": "취재",
      "english": "news coverage; reporting; gathering material for a story",
      "example": "기자가 현장에 나가서 직접 취재한 내용을 바탕으로 기사를 작성했다.",
      "example_en": "The reporter wrote the article based on material gathered firsthand at the scene."
    },
    {
      "korean": "특종",
      "english": "exclusive story; scoop",
      "example": "그 신문사는 정치인의 비리를 특종으로 보도해 큰 반향을 일으켰다.",
      "example_en": "The newspaper caused a huge stir by breaking an exclusive story about the politician's corruption."
    },
    {
      "korean": "오보",
      "english": "misreport; false report; incorrect news",
      "example": "속보 경쟁이 치열해지면서 오보가 늘어나는 추세이다.",
      "example_en": "As competition for breaking news intensifies, misreports have been on the rise."
    },
    {
      "korean": "속보",
      "english": "breaking news; flash report",
      "example": "방송 중에 속보가 들어와 갑자기 프로그램이 중단되었다.",
      "example_en": "Breaking news came in during the broadcast, and the program was suddenly interrupted."
    },
    {
      "korean": "사설",
      "english": "editorial (newspaper opinion piece)",
      "example": "오늘자 사설은 정부의 부동산 정책을 강하게 비판하고 있다.",
      "example_en": "Today's editorial strongly criticizes the government's real estate policy."
    },
    {
      "korean": "기자회견",
      "english": "press conference",
      "example": "대통령이 긴급 기자회견을 열어 국민에게 직접 입장을 밝혔다.",
      "example_en": "The president held an emergency press conference to personally explain their position to the public."
    },
    {
      "korean": "제보",
      "english": "tip-off; anonymous report to the media",
      "example": "시민의 제보 덕분에 불법 폐기물 투기 사실이 세상에 알려졌다.",
      "example_en": "Thanks to a citizen's tip-off, the illegal dumping of waste was brought to light."
    },
    {
      "korean": "탐사보도",
      "english": "investigative reporting; investigative journalism",
      "example": "수개월간의 탐사보도 끝에 대기업의 조직적 탈세가 드러났다.",
      "example_en": "After months of investigative reporting, the conglomerate's systematic tax evasion was uncovered."
    },
    {
      "korean": "논조",
      "english": "editorial tone; stance of a media outlet",
      "example": "그 방송사의 논조가 갑자기 바뀌어 시청자들 사이에서 의혹이 일었다.",
      "example_en": "The broadcaster's editorial tone suddenly changed, raising suspicions among viewers."
    },
    {
      "korean": "출입기자",
      "english": "beat reporter; press corps reporter assigned to an institution",
      "example": "국회 출입기자들이 법안 처리 과정을 실시간으로 전하고 있다.",
      "example_en": "Beat reporters at the National Assembly are delivering real-time updates on the legislation process."
    },
    {
      "korean": "생방송",
      "english": "live broadcast; live airing",
      "example": "생방송 중에 앵커가 말실수를 해서 큰 화제가 되었다.",
      "example_en": "The anchor made a verbal slip during the live broadcast, which became a hot topic."
    },
    {
      "korean": "녹화",
      "english": "recording (video/TV show taping)",
      "example": "예능 프로그램 녹화가 예정보다 세 시간이나 늦게 끝났다.",
      "example_en": "The recording of the variety show ended three hours later than scheduled."
    },
    {
      "korean": "중계",
      "english": "live relay; live coverage (of sports or events)",
      "example": "올림픽 개막식 중계를 보려고 온 가족이 텔레비전 앞에 모였다.",
      "example_en": "The whole family gathered in front of the TV to watch the live coverage of the Olympic opening ceremony."
    },
    {
      "korean": "자막",
      "english": "subtitles; captions; on-screen text",
      "example": "외국 영화를 볼 때 자막 없이 보는 연습을 하고 있다.",
      "example_en": "I've been practicing watching foreign films without subtitles."
    },
    {
      "korean": "방영",
      "english": "airing; broadcasting of a program",
      "example": "논란이 된 다큐멘터리가 결국 방영 취소되었다.",
      "example_en": "The controversial documentary was ultimately pulled from airing."
    },
    {
      "korean": "송출",
      "english": "signal transmission; broadcast feed",
      "example": "기술적 오류로 인해 잠시 방송 송출이 중단되었습니다.",
      "example_en": "Broadcast transmission was briefly interrupted due to a technical error."
    },
    {
      "korean": "진행자",
      "english": "host; presenter; MC",
      "example": "토론 프로그램의 진행자가 중립적인 태도를 유지하지 못해 비판을 받았다.",
      "example_en": "The debate show's host was criticized for failing to maintain a neutral stance."
    },
    {
      "korean": "방청객",
      "english": "studio audience; spectators at a live taping",
      "example": "방청객들의 반응이 좋아서 그 장면이 하이라이트로 편집되었다.",
      "example_en": "The studio audience's reaction was so good that the scene was edited into the highlight reel."
    },
    {
      "korean": "촬영",
      "english": "filming; shooting (video or photo)",
      "example": "악천후 때문에 야외 촬영 일정을 모두 연기할 수밖에 없었다.",
      "example_en": "Due to severe weather, all the outdoor filming schedules had to be postponed."
    },
    {
      "korean": "편파방송",
      "english": "biased broadcasting; slanted coverage",
      "example": "시민단체가 편파방송에 대한 항의 서명을 받기 시작했다.",
      "example_en": "A civic group began collecting protest signatures against the biased broadcasting."
    },
    {
      "korean": "댓글",
      "english": "comment (online); reply",
      "example": "악성 댓글이 사회 문제로 대두되면서 관련 법 개정 논의가 활발하다.",
      "example_en": "As malicious comments have emerged as a social issue, discussions on revising related laws are active."
    },
    {
      "korean": "조회수",
      "english": "view count; number of views",
      "example": "그 영상은 업로드 하루 만에 조회수 백만을 돌파했다.",
      "example_en": "The video surpassed one million views just one day after being uploaded."
    },
    {
      "korean": "구독자",
      "english": "subscriber (to a channel or publication)",
      "example": "구독자 수가 십만 명을 넘기면서 본격적으로 수익이 나기 시작했다.",
      "example_en": "Once the subscriber count exceeded 100,000, revenue started coming in earnestly."
    },
    {
      "korean": "검색어",
      "english": "search term; search keyword",
      "example": "사건이 터지자마자 관련 검색어가 실시간 순위 상위에 올랐다.",
      "example_en": "As soon as the incident broke, related search terms shot to the top of the real-time rankings."
    },
    {
      "korean": "게시물",
      "english": "post (online); posting",
      "example": "문제가 된 게시물은 이미 삭제되었지만 캡처본이 빠르게 퍼졌다.",
      "example_en": "The problematic post had already been deleted, but screenshots spread rapidly."
    },
    {
      "korean": "누리꾼",
      "english": "netizen; internet user",
      "example": "누리꾼들이 직접 팩트체크에 나서 허위 정보를 바로잡았다.",
      "example_en": "Netizens took it upon themselves to fact-check and correct the misinformation."
    },
    {
      "korean": "악플",
      "english": "hate comment; malicious online comment",
      "example": "연예인들이 악플로 인한 정신적 고통을 호소하는 사례가 늘고 있다.",
      "example_en": "More and more celebrities are speaking out about the psychological distress caused by hate comments."
    },
    {
      "korean": "여론조작",
      "english": "opinion manipulation; astroturfing",
      "example": "댓글을 이용한 여론조작 사건이 적발되어 수사가 진행 중이다.",
      "example_en": "A case of opinion manipulation using online comments was uncovered, and an investigation is underway."
    },
    {
      "korean": "허위정보",
      "english": "misinformation; disinformation; false information",
      "example": "선거철마다 허위정보가 급증해 유권자들의 판단을 흐리고 있다.",
      "example_en": "Misinformation surges every election season, clouding voters' judgment."
    },
    {
      "korean": "게시판",
      "english": "online forum; bulletin board; message board",
      "example": "익명 게시판에 올라온 글이 큰 논란을 불러일으켰다.",
      "example_en": "A post on an anonymous forum sparked a major controversy."
    },
    {
      "korean": "발행",
      "english": "publication; issuance (of print media)",
      "example": "창간 50주년을 맞아 기념 특별판이 발행되었다.",
      "example_en": "A special commemorative edition was published to mark the 50th anniversary of the founding."
    },
    {
      "korean": "인쇄",
      "english": "printing; print production",
      "example": "디지털 시대에도 인쇄 매체를 선호하는 독자층이 여전히 존재한다.",
      "example_en": "Even in the digital age, there is still a readership that prefers print media."
    },
    {
      "korean": "교정",
      "english": "proofreading; copyediting",
      "example": "교정 단계에서 오탈자를 잡아내지 못하면 신문의 신뢰도에 영향을 준다.",
      "example_en": "If typos aren't caught at the proofreading stage, it affects the newspaper's credibility."
    },
    {
      "korean": "편집",
      "english": "editing; compilation of media content",
      "example": "기사를 쓰는 것도 중요하지만 편집에 따라 뉘앙스가 완전히 달라질 수 있다.",
      "example_en": "Writing the article is important, but the nuance can change entirely depending on the editing."
    },
    {
      "korean": "연재",
      "english": "serialization; serial publication",
      "example": "인기 작가의 소설이 신문에 연재되면서 구독률이 크게 올랐다.",
      "example_en": "Subscription rates rose significantly when the popular author's novel began serialization in the newspaper."
    },
    {
      "korean": "기고",
      "english": "contributed article; op-ed submission",
      "example": "저명한 학자가 기고한 칼럼이 큰 반향을 일으켰다.",
      "example_en": "A column contributed by a renowned scholar generated a huge response."
    },
    {
      "korean": "창간",
      "english": "founding; launch of a publication",
      "example": "그 잡지는 창간 이후 한 번도 휴간 없이 매달 발행되고 있다.",
      "example_en": "The magazine has been published monthly without a single hiatus since its founding."
    },
    {
      "korean": "구독",
      "english": "subscription (to a publication or channel)",
      "example": "종이 신문 구독을 끊고 디지털 구독으로 전환하는 사람이 늘고 있다.",
      "example_en": "More people are canceling their print newspaper subscriptions and switching to digital."
    },
    {
      "korean": "독자",
      "english": "reader (of a publication)",
      "example": "독자 투고란을 통해 다양한 시민들의 목소리를 실을 수 있었다.",
      "example_en": "Through the reader submission section, the voices of various citizens could be featured."
    },
    {
      "korean": "지면",
      "english": "page space; print space (in a newspaper or magazine)",
      "example": "광고가 늘면서 실제 기사에 할애할 수 있는 지면이 줄어들었다.",
      "example_en": "As advertisements increased, the page space available for actual articles shrank."
    }
  ]
}
