{
  "주제별 단어 — 교육 (Topic: Education)": [
    {
      "korean": "입학",
      "english": "enrollment; admission (to a school)",
      "example": "올해 초등학교에 입학하는 아이들 수가 급격히 줄었다.",
      "example_en": "The number of children enrolling in elementary school this year has dropped sharply."
    },
    {
      "korean": "졸업",
      "english": "graduation",
      "example": "대학교 졸업까지 남은 학점을 확인해 봤더니 생각보다 많았다.",
      "example_en": "When I checked how many credits I had left until university graduation, there were more than I thought."
    },
    {
      "korean": "담임",
      "english": "homeroom teacher; class teacher",
      "example": "새 학기에 담임 선생님이 바뀌어서 학생들이 긴장하고 있었다.",
      "example_en": "The students were nervous because the homeroom teacher changed at the start of the new semester."
    },
    {
      "korean": "교과서",
      "english": "textbook",
      "example": "교과서 개정 작업에 수년이 걸리는 경우가 많다.",
      "example_en": "Revising textbooks often takes several years."
    },
    {
      "korean": "학년",
      "english": "school year; grade level",
      "example": "한국에서는 3월에 새 학년이 시작된다.",
      "example_en": "In Korea, the new school year starts in March."
    },
    {
      "korean": "학급",
      "english": "class (group of students); homeroom class",
      "example": "한 학급당 학생 수를 줄이는 것이 교육의 질을 높이는 데 효과적이다.",
      "example_en": "Reducing the number of students per class is effective in improving the quality of education."
    },
    {
      "korean": "학부모",
      "english": "parents of students; school parents",
      "example": "학부모 상담 기간에 교사와 학부모가 직접 만나 이야기를 나눈다.",
      "example_en": "During the parent consultation period, teachers and parents meet in person to talk."
    },
    {
      "korean": "등교",
      "english": "going to school; attending school",
      "example": "폭설로 인해 등교 시간이 한 시간 늦춰졌다.",
      "example_en": "Due to heavy snowfall, the school start time was pushed back by one hour."
    },
    {
      "korean": "하교",
      "english": "leaving school; getting out of school",
      "example": "하교 후에 학원에 가는 학생들이 대부분이다.",
      "example_en": "Most students go to hagwon after getting out of school."
    },
    {
      "korean": "교칙",
      "english": "school rules; school regulations",
      "example": "교칙 위반으로 징계를 받은 학생이 반발하고 있다.",
      "example_en": "The student who was disciplined for violating school rules is pushing back."
    },
    {
      "korean": "학과",
      "english": "department; academic major (at university)",
      "example": "인기 학과에 지원자가 몰리면서 경쟁률이 치솟았다.",
      "example_en": "Competition rates soared as applicants flocked to popular departments."
    },
    {
      "korean": "학점",
      "english": "credits; GPA",
      "example": "취업 준비를 위해 학점 관리에 신경을 많이 썼다.",
      "example_en": "I put a lot of effort into managing my GPA in preparation for job hunting."
    },
    {
      "korean": "등록금",
      "english": "tuition fees",
      "example": "등록금 인상에 반대하는 학생들이 시위를 벌였다.",
      "example_en": "Students protesting against tuition fee increases held a demonstration."
    },
    {
      "korean": "장학금",
      "english": "scholarship",
      "example": "성적 우수 장학금을 받아서 등록금 부담을 크게 줄일 수 있었다.",
      "example_en": "I was able to greatly reduce the tuition burden by receiving a merit-based scholarship."
    },
    {
      "korean": "전공",
      "english": "major; field of specialization",
      "example": "전공을 바꾸려면 학과 사무실에 서류를 제출해야 한다.",
      "example_en": "To change your major, you need to submit paperwork to the department office."
    },
    {
      "korean": "복수전공",
      "english": "double major",
      "example": "복수전공을 하면 취업 시 경쟁력이 높아진다고 생각하는 학생들이 많다.",
      "example_en": "Many students think that having a double major increases their competitiveness when job hunting."
    },
    {
      "korean": "휴학",
      "english": "leave of absence (from university)",
      "example": "군 복무를 위해 2년간 휴학을 했다.",
      "example_en": "I took a two-year leave of absence for military service."
    },
    {
      "korean": "대학원",
      "english": "graduate school",
      "example": "대학원에 진학하려면 학부 성적과 연구 경험이 중요하다.",
      "example_en": "To get into graduate school, undergraduate grades and research experience are important."
    },
    {
      "korean": "논문",
      "english": "thesis; academic paper",
      "example": "졸업 논문 주제를 정하느라 몇 달을 고민했다.",
      "example_en": "I agonized for months trying to decide on a thesis topic."
    },
    {
      "korean": "학술",
      "english": "academic; scholarly",
      "example": "국제 학술 대회에서 연구 결과를 발표할 기회를 얻었다.",
      "example_en": "I got the opportunity to present my research at an international academic conference."
    },
    {
      "korean": "수능",
      "english": "CSAT (College Scholastic Ability Test); Korean SAT",
      "example": "수능 성적에 따라 지원할 수 있는 대학이 결정된다.",
      "example_en": "The universities you can apply to are determined by your CSAT scores."
    },
    {
      "korean": "내신",
      "english": "school record; GPA from high school transcript",
      "example": "수시 전형에서는 내신 성적이 매우 중요한 비중을 차지한다.",
      "example_en": "In the rolling admission process, your school record carries a very significant weight."
    },
    {
      "korean": "모의고사",
      "english": "practice exam; mock test",
      "example": "매달 치르는 모의고사 성적 변화를 그래프로 만들어 관리했다.",
      "example_en": "I tracked the changes in my monthly mock test scores by making a graph."
    },
    {
      "korean": "벼락치기",
      "english": "cramming (studying at the last minute)",
      "example": "벼락치기로 공부해서 시험은 통과했지만 금방 다 잊어버렸다.",
      "example_en": "I crammed and passed the exam, but I forgot everything quickly."
    },
    {
      "korean": "재수",
      "english": "retaking the college entrance exam (after a gap year)",
      "example": "원하는 대학에 떨어져서 재수를 결심했다.",
      "example_en": "I didn't get into the university I wanted, so I decided to retake the exam after a year."
    },
    {
      "korean": "족보",
      "english": "old exam papers (slang); past exam archive",
      "example": "선배한테 시험 족보를 구해서 출제 경향을 분석했다.",
      "example_en": "I got old exam papers from a senior and analyzed the question trends."
    },
    {
      "korean": "과제",
      "english": "assignment; homework; task",
      "example": "기말 과제 제출 기한이 내일까지인데 아직 시작도 못 했다.",
      "example_en": "The final assignment is due tomorrow and I haven't even started yet."
    },
    {
      "korean": "중간고사",
      "english": "midterm exam",
      "example": "중간고사 기간에는 도서관 자리 잡기가 하늘의 별 따기다.",
      "example_en": "During midterm season, getting a seat in the library is nearly impossible."
    },
    {
      "korean": "기말고사",
      "english": "final exam",
      "example": "기말고사가 끝나자마자 여행 계획을 세우기 시작했다.",
      "example_en": "As soon as finals were over, I started making travel plans."
    },
    {
      "korean": "커트라인",
      "english": "cutoff score; minimum passing score",
      "example": "이번 시험 커트라인이 작년보다 높아져서 불합격자가 많이 나왔다.",
      "example_en": "The cutoff score for this exam went up from last year, so there were many who didn't pass."
    },
    {
      "korean": "강의",
      "english": "lecture; class session",
      "example": "그 교수님 강의는 내용이 알차서 매번 수강 신청 경쟁이 치열하다.",
      "example_en": "That professor's lectures are so rich in content that course registration is fiercely competitive every time."
    },
    {
      "korean": "수강 신청",
      "english": "course registration",
      "example": "수강 신청 첫날 서버가 다운되는 바람에 원하는 강의를 못 들었다.",
      "example_en": "The server crashed on the first day of course registration, so I couldn't get the class I wanted."
    },
    {
      "korean": "교수법",
      "english": "teaching method; pedagogy",
      "example": "학생 참여를 유도하는 교수법이 강의식보다 효과적이라는 연구 결과가 많다.",
      "example_en": "Many studies show that teaching methods that encourage student participation are more effective than lecture-style ones."
    },
    {
      "korean": "과외",
      "english": "private tutoring",
      "example": "대학생 때 과외 아르바이트로 생활비를 벌었다.",
      "example_en": "In college, I earned my living expenses through private tutoring side jobs."
    },
    {
      "korean": "학원",
      "english": "hagwon; private academy; cram school",
      "example": "한국 학생들은 학교가 끝나면 학원을 여러 개 다니는 경우가 흔하다.",
      "example_en": "It's common for Korean students to attend multiple hagwons after school ends."
    },
    {
      "korean": "사교육",
      "english": "private education (tutoring, hagwons, etc.)",
      "example": "사교육비 부담이 커지면서 저출산 문제의 원인 중 하나로 지목되고 있다.",
      "example_en": "The growing burden of private education costs is being pointed to as one of the causes of the low birthrate problem."
    },
    {
      "korean": "공교육",
      "english": "public education",
      "example": "공교육의 질을 높여야 사교육 의존도를 낮출 수 있다.",
      "example_en": "Dependence on private education can only be reduced by improving the quality of public education."
    },
    {
      "korean": "학습",
      "english": "learning; study (the process of acquiring knowledge)",
      "example": "효과적인 학습을 위해서는 복습이 필수적이다.",
      "example_en": "Review is essential for effective learning."
    },
    {
      "korean": "교양",
      "english": "general education (courses); liberal arts; culture/refinement",
      "example": "전공 수업 외에도 교양 과목을 다양하게 들어야 졸업할 수 있다.",
      "example_en": "In addition to major courses, you need to take a variety of general education courses to graduate."
    },
    {
      "korean": "유학",
      "english": "studying abroad",
      "example": "영어 실력을 키우기 위해 미국으로 유학을 떠났다.",
      "example_en": "I went abroad to study in the United States to improve my English skills."
    }
  ]
}
