{
  "고급 동사 (Advanced Verbs)": [
    {
      "korean": "통치하다",
      "english": "to govern; to rule; to reign over a territory or people",
      "example": "고대 왕조는 수백 년간 광대한 영토를 통치하며 독자적인 문화를 꽃피웠다.",
      "example_en": "The ancient dynasty governed a vast territory for centuries, cultivating its own unique culture."
    },
    {
      "korean": "군림하다",
      "english": "to reign supreme; to lord over; to dominate unchallenged",
      "example": "그 기업은 20년 넘게 국내 시장에서 독보적으로 군림해 왔다.",
      "example_en": "That company has reigned supreme in the domestic market for over 20 years."
    },
    {
      "korean": "집행하다",
      "english": "to execute; to enforce; to carry out (a law, order, or sentence)",
      "example": "법원의 판결이 내려졌지만 실제로 집행하기까지는 상당한 시간이 걸렸다.",
      "example_en": "The court's ruling was handed down, but it took considerable time to actually execute it."
    },
    {
      "korean": "위임하다",
      "english": "to delegate; to entrust authority or responsibility to another",
      "example": "대표는 해외 출장 기간 동안 주요 업무를 부대표에게 위임했다.",
      "example_en": "The CEO delegated key responsibilities to the vice president during the overseas business trip."
    },
    {
      "korean": "탄핵하다",
      "english": "to impeach; to formally charge a public official with misconduct",
      "example": "국회는 헌법 위반을 근거로 대통령을 탄핵하기로 의결했다.",
      "example_en": "The National Assembly voted to impeach the president on the grounds of constitutional violations."
    },
    {
      "korean": "비준하다",
      "english": "to ratify; to formally approve a treaty or agreement",
      "example": "양국 정상은 무역 협정에 서명했으나 의회의 비준이 아직 남아 있다.",
      "example_en": "The leaders of both countries signed the trade agreement, but parliamentary ratification is still pending."
    },
    {
      "korean": "선포하다",
      "english": "to proclaim; to declare officially and publicly",
      "example": "정부는 국가 비상사태를 선포하고 군 병력을 긴급 투입했다.",
      "example_en": "The government proclaimed a national state of emergency and urgently deployed military forces."
    },
    {
      "korean": "징집하다",
      "english": "to conscript; to draft into military service",
      "example": "전시에는 평소 면제 대상이던 시민까지 징집하는 경우가 있었다.",
      "example_en": "During wartime, even citizens who were normally exempt were sometimes conscripted."
    },
    {
      "korean": "관할하다",
      "english": "to have jurisdiction over; to administer; to be in charge of an area or matter",
      "example": "해당 사건은 서울중앙지방법원이 관할하는 것으로 결정되었다.",
      "example_en": "It was decided that the Seoul Central District Court would have jurisdiction over the case."
    },
    {
      "korean": "통솔하다",
      "english": "to command; to lead and direct (troops, an organization)",
      "example": "장군은 수만 명의 병력을 통솔하며 전쟁을 승리로 이끌었다.",
      "example_en": "The general commanded tens of thousands of troops and led the war to victory."
    },
    {
      "korean": "구상하다",
      "english": "to conceive; to envision; to plan out creatively",
      "example": "건축가는 도시의 역사적 맥락을 살린 새로운 문화 공간을 구상했다.",
      "example_en": "The architect conceived a new cultural space that preserved the city's historical context."
    },
    {
      "korean": "빚어내다",
      "english": "to mold; to create; to give shape to (literally or figuratively)",
      "example": "도예가가 흙 한 덩이로 섬세한 찻잔을 빚어내는 과정은 그 자체로 예술이었다.",
      "example_en": "The process of the potter molding a delicate teacup from a lump of clay was art in itself."
    },
    {
      "korean": "조율하다",
      "english": "to tune; to harmonize; to coordinate and adjust for balance",
      "example": "지휘자는 각 파트의 소리를 섬세하게 조율하여 완벽한 앙상블을 만들어 냈다.",
      "example_en": "The conductor delicately harmonized the sound of each section to create a perfect ensemble."
    },
    {
      "korean": "묘사하다",
      "english": "to depict; to describe vividly; to portray in detail",
      "example": "그 소설은 전쟁의 참상을 적나라하게 묘사하여 독자들에게 깊은 충격을 주었다.",
      "example_en": "The novel vividly depicted the horrors of war, deeply shocking its readers."
    },
    {
      "korean": "윤색하다",
      "english": "to embellish; to polish; to touch up writing or speech for refinement",
      "example": "작가는 초고를 여러 차례 윤색하여 문장의 결을 한층 다듬었다.",
      "example_en": "The writer embellished the draft multiple times, further refining the texture of the sentences."
    },
    {
      "korean": "각색하다",
      "english": "to adapt (a story for a different medium); to dramatize",
      "example": "원작 소설을 영화로 각색하는 과정에서 일부 줄거리가 크게 변경되었다.",
      "example_en": "In the process of adapting the original novel into a film, some plot points were significantly changed."
    },
    {
      "korean": "조각하다",
      "english": "to sculpt; to carve; to engrave a form from raw material",
      "example": "그는 대리석 원석에서 인체의 곡선을 정밀하게 조각해 냈다.",
      "example_en": "He precisely sculpted the curves of the human body from a raw block of marble."
    },
    {
      "korean": "주조하다",
      "english": "to cast (metal); to mint; to forge into a mold",
      "example": "고려 시대에는 청동으로 대형 범종을 주조하는 기술이 매우 발달했다.",
      "example_en": "During the Goryeo Dynasty, the technique of casting large bronze temple bells was highly advanced."
    },
    {
      "korean": "연출하다",
      "english": "to direct; to stage; to orchestrate (a performance or scene)",
      "example": "감독은 배우들의 미세한 표정 변화까지 세심하게 연출했다.",
      "example_en": "The director meticulously staged even the subtle changes in the actors' facial expressions."
    },
    {
      "korean": "채색하다",
      "english": "to color in; to paint; to apply color to a surface or drawing",
      "example": "복원 전문가가 퇴색된 벽화를 원래의 색감으로 채색하는 작업을 시작했다.",
      "example_en": "The restoration specialist began the work of painting the faded mural back to its original colors."
    },
    {
      "korean": "항거하다",
      "english": "to resist; to rise up against; to defy authority",
      "example": "시민들은 부당한 법령에 항거하여 대규모 시위를 벌였다.",
      "example_en": "Citizens staged massive protests in defiance of the unjust decree."
    },
    {
      "korean": "격퇴하다",
      "english": "to repulse; to repel; to drive back (an enemy or attack)",
      "example": "수비대는 열세에도 불구하고 적군의 공격을 성공적으로 격퇴했다.",
      "example_en": "Despite being outnumbered, the garrison successfully repulsed the enemy's attack."
    },
    {
      "korean": "교전하다",
      "english": "to engage in battle; to exchange fire; to fight in combat",
      "example": "국경 지대에서 양측 군대가 수 시간에 걸쳐 교전한 것으로 알려졌다.",
      "example_en": "It was reported that troops from both sides engaged in battle for several hours in the border area."
    },
    {
      "korean": "선동하다",
      "english": "to agitate; to incite; to stir up a crowd toward action",
      "example": "극단주의 지도자가 대중을 선동하여 폭력 사태를 야기했다.",
      "example_en": "The extremist leader incited the public, causing a violent incident."
    },
    {
      "korean": "압도하다",
      "english": "to overwhelm; to overpower; to dominate completely",
      "example": "신인 선수가 경험 많은 상대를 압도하며 결승에 진출했다.",
      "example_en": "The rookie overwhelmed the experienced opponent and advanced to the finals."
    },
    {
      "korean": "교란하다",
      "english": "to disrupt; to throw into confusion; to disturb the order of",
      "example": "적군은 전파 교란 작전으로 아군의 통신망을 교란하려 했다.",
      "example_en": "The enemy tried to disrupt our communication network through a signal-jamming operation."
    },
    {
      "korean": "반박하다",
      "english": "to refute; to rebut; to counter an argument with evidence",
      "example": "피고 측 변호사가 검찰의 주장을 조목조목 반박하여 재판의 흐름이 바뀌었다.",
      "example_en": "The defense attorney rebutted the prosecution's claims point by point, shifting the course of the trial."
    },
    {
      "korean": "농단하다",
      "english": "to monopolize and manipulate (power); to abuse authority behind the scenes",
      "example": "측근들이 국정을 농단한 사실이 밝혀지면서 정권이 흔들렸다.",
      "example_en": "When it was revealed that close aides had manipulated state affairs, the regime was shaken."
    },
    {
      "korean": "도발하다",
      "english": "to provoke; to make a deliberate provocation",
      "example": "상대 팀이 노골적으로 도발했지만 그는 냉정하게 경기에 집중했다.",
      "example_en": "Although the opposing team openly provoked him, he stayed calm and focused on the game."
    },
    {
      "korean": "제압하다",
      "english": "to subdue; to suppress; to bring under control by force",
      "example": "경찰 특공대가 인질범을 신속하게 제압하여 인질 전원을 구출했다.",
      "example_en": "The police special forces swiftly subdued the hostage-taker and rescued all the hostages."
    },
    {
      "korean": "쇄신하다",
      "english": "to reform; to overhaul; to renovate a system or organization",
      "example": "새 경영진은 낡은 조직 문화를 쇄신하겠다고 취임 일성을 밝혔다.",
      "example_en": "The new management declared overhauling the outdated organizational culture as their first order of business."
    },
    {
      "korean": "변모하다",
      "english": "to transform; to undergo a metamorphosis; to change in form or character",
      "example": "한때 황폐했던 항구 도시가 관광 명소로 완전히 변모했다.",
      "example_en": "The once-desolate port city completely transformed into a tourist attraction."
    },
    {
      "korean": "퇴화하다",
      "english": "to degenerate; to devolve; to atrophy from disuse",
      "example": "동굴 속에서 오래 살아온 어류는 시력이 퇴화하여 눈이 거의 없다.",
      "example_en": "Fish that have lived in caves for a long time have degenerated eyesight, with almost no visible eyes."
    },
    {
      "korean": "숙성하다",
      "english": "to mature; to ripen; to age or ferment over time",
      "example": "된장은 최소 일 년 이상 숙성해야 깊은 맛이 난다.",
      "example_en": "Doenjang needs to be aged for at least a year to develop a deep flavor."
    },
    {
      "korean": "증폭하다",
      "english": "to amplify; to intensify; to magnify in scale or degree",
      "example": "소셜 미디어가 작은 논란을 순식간에 증폭하여 사회적 이슈로 만들었다.",
      "example_en": "Social media amplified a minor controversy into a social issue in an instant."
    },
    {
      "korean": "정제하다",
      "english": "to refine; to purify; to remove impurities from",
      "example": "원유를 정제하는 과정에서 다양한 석유 화학 제품이 생산된다.",
      "example_en": "Various petrochemical products are produced in the process of refining crude oil."
    },
    {
      "korean": "침식하다",
      "english": "to erode; to eat away at gradually",
      "example": "거짓 정보의 범람이 민주주의의 토대를 서서히 침식하고 있다.",
      "example_en": "The flood of false information is gradually eroding the foundations of democracy."
    },
    {
      "korean": "응축하다",
      "english": "to condense; to concentrate; to compress into a dense essence",
      "example": "시인은 복잡한 감정을 짧은 한 행에 응축하는 데 천재적이었다.",
      "example_en": "The poet was a genius at condensing complex emotions into a single short line."
    },
    {
      "korean": "발효하다",
      "english": "to ferment; to take effect (of a law or agreement coming into force)",
      "example": "김치는 적정 온도에서 천천히 발효해야 제맛이 나고, 조약도 양국이 비준해야 발효한다.",
      "example_en": "Kimchi must ferment slowly at the right temperature for proper flavor, and a treaty takes effect only when both countries ratify it."
    },
    {
      "korean": "소멸하다",
      "english": "to be extinguished; to vanish; to expire or cease to exist",
      "example": "공소시효가 소멸하면 아무리 명백한 증거가 있어도 기소할 수 없다.",
      "example_en": "Once the statute of limitations expires, prosecution is impossible no matter how clear the evidence."
    }
  ]
}
