{
  "주제별 단어 — 패션 (Topic: Fashion)": [
    {
      "korean": "헐렁하다",
      "english": "loose-fitting; baggy; oversized",
      "example": "요즘은 헐렁한 실루엣의 옷이 유행이다.",
      "example_en": "These days, loose-fitting silhouettes are in fashion.",
      "notes": "Common collocations: 헐렁한 옷, 헐렁한 실루엣. Related: 오버핏, 넉넉하다. Implies comfort over body-hugging silhouettes."
    },
    {
      "korean": "달라붙다",
      "english": "to cling; to fit tightly; skin-tight",
      "example": "몸에 달라붙는 원피스는 체형이 그대로 드러나서 부담스럽다.",
      "example_en": "A clingy dress reveals your body shape completely, which can feel uncomfortable.",
      "notes": "Collocation: 몸에 달라붙다. Related: 타이트하다, 꼭 맞다. Often used negatively in fashion context."
    },
    {
      "korean": "주름",
      "english": "wrinkle; crease; pleat",
      "example": "셔츠에 주름이 잡혀서 다림질을 해야 한다.",
      "example_en": "The shirt has creases, so I need to iron it.",
      "notes": "Collocations: 주름이 생기다, 주름을 펴다, 다림질하다. Related: 구김, 누더기. Can be aesthetic (pleats) or unfashionable (wrinkles)."
    },
    {
      "korean": "무늬",
      "english": "pattern; print; design",
      "example": "체크무늬 셔츠는 캐주얼한 느낌을 주기에 좋다.",
      "example_en": "A checkered pattern shirt is good for giving a casual vibe.",
      "notes": "Common patterns: 체크무늬, 줄무늬, 꽃무늬, 동물 무늬. Related: 패턴, 프린트. Native Korean word preferred over 패턴."
    },
    {
      "korean": "차림",
      "english": "outfit; attire; how one is dressed",
      "example": "격식 있는 자리에 평상복 차림으로 나타나면 실례가 된다.",
      "example_en": "Showing up in casual attire to a formal occasion is considered rude.",
      "notes": "Collocations: 단정한 차림, 평상복 차림, 정장 차림. Usage: describes complete outfit appropriateness for occasion."
    },
    {
      "korean": "단정하다",
      "english": "neat; tidy; well-groomed",
      "example": "면접 때는 단정한 복장과 깔끔한 헤어스타일이 중요하다.",
      "example_en": "For interviews, neat attire and a tidy hairstyle are important.",
      "notes": "Collocations: 단정한 복장, 단정한 모습. Slightly formal/conservative connotation. Related: 깔끔하다, 멋있다."
    },
    {
      "korean": "촌스럽다",
      "english": "tacky; unfashionable; outdated-looking",
      "example": "예전에는 촌스럽다고 여겨졌던 스타일이 레트로 유행으로 다시 돌아왔다.",
      "example_en": "Styles once considered tacky have come back as retro trends.",
      "notes": "Related: 나이 들어 보이다, 올드하다, 구린. Antonym: 세련되다. Often describes fashion perceived as outdated or unsophisticated."
    },
    {
      "korean": "화려하다",
      "english": "flashy; flamboyant; colorful; splendid",
      "example": "시상식에서 배우들은 화려한 드레스를 입고 레드카펫을 밟았다.",
      "example_en": "At the awards ceremony, actors walked the red carpet in flashy dresses.",
      "notes": "Collocations: 화려한 드레스, 화려한 색상. Related: 화사하다, 화려해 보이다. Can be positive (elegant) or negative (overdone)."
    },
    {
      "korean": "수수하다",
      "english": "plain; modest; understated",
      "example": "그녀는 늘 수수한 옷차림이지만 분위기가 있다.",
      "example_en": "She always dresses modestly but has a certain presence.",
      "notes": "Collocations: 수수한 옷차림, 수수한 스타일. Opposite: 화려하다. Implies quiet sophistication and timelessness."
    },
    {
      "korean": "깔끔하다",
      "english": "clean-cut; crisp; polished (in appearance)",
      "example": "흰 셔츠에 검은 바지, 깔끔한 코디의 정석이다.",
      "example_en": "A white shirt with black pants — the textbook of clean-cut coordination.",
      "notes": "Collocations: 깔끔한 코디, 깔끔한 모습. Related: 단정하다. Emphasizes simplicity and orderliness in styling."
    },
    {
      "korean": "면",
      "english": "cotton (fabric)",
      "example": "여름에는 통기성이 좋은 면 소재의 옷이 가장 편하다.",
      "example_en": "In summer, cotton fabric clothes with good breathability are the most comfortable.",
      "notes": "Collocations: 면 소재, 순면(100% cotton). Related: 통기성, 흡수성. Most versatile and affordable fabric for everyday wear."
    },
    {
      "korean": "마",
      "english": "linen; hemp fabric",
      "example": "마 소재는 시원하지만 구김이 잘 가는 게 단점이다.",
      "example_en": "Linen is cool, but the downside is that it wrinkles easily.",
      "notes": "Native Korean fabric term. Collocations: 마 소재, 마 바지. Usage: prized for breathability but requires careful maintenance."
    },
    {
      "korean": "명주",
      "english": "silk; silk fabric",
      "example": "한복에 사용되는 명주는 광택이 있어서 고급스러운 느낌을 준다.",
      "example_en": "The silk used in hanbok has a sheen that gives a luxurious feel.",
      "notes": "Sino-Korean 明珠 (bright pearl). Associated with luxury and traditional Korean dress. Related: 비단(silk), 광택(sheen)."
    },
    {
      "korean": "가죽",
      "english": "leather; hide",
      "example": "인조 가죽 재킷은 진짜 가죽보다 가격이 저렴하면서 관리가 쉽다.",
      "example_en": "Faux leather jackets are cheaper than real leather and easier to maintain.",
      "notes": "Collocations: 가죽 재킷, 인조 가죽, 진짜 가죽. Related: 동물성 소재, 비건 가죽. Premium fabric often used for outerwear."
    },
    {
      "korean": "모직",
      "english": "wool fabric; woolen; worsted",
      "example": "겨울 코트는 모직 소재가 보온성이 뛰어나다.",
      "example_en": "For winter coats, wool fabric has excellent heat retention.",
      "notes": "Sino-Korean 毛織. Collocations: 모직 코트, 모직 소재. High heat retention makes it ideal for cold-weather garments."
    },
    {
      "korean": "니트",
      "english": "knit; knitwear; knitted fabric",
      "example": "가을에는 니트 스웨터 하나면 간편하게 스타일링할 수 있다.",
      "example_en": "In autumn, a single knit sweater is enough for easy styling.",
      "notes": "English loanword. Collocations: 니트 스웨터, 니트 원피스. Versatile autumn/winter staple; relates to texture rather than fiber content."
    },
    {
      "korean": "데님",
      "english": "denim; jean fabric",
      "example": "데님 재킷은 사계절 내내 활용할 수 있는 만능 아이템이다.",
      "example_en": "A denim jacket is a versatile item you can wear in all four seasons.",
      "notes": "English loanword. Collocations: 데님 재킷, 데님 바지. Timeless, durable fabric that serves as fashion staple across seasons."
    },
    {
      "korean": "벨벳",
      "english": "velvet",
      "example": "벨벳 소재는 빛에 따라 색감이 다르게 보여서 고급스럽다.",
      "example_en": "Velvet looks luxurious because its color appears different depending on the light.",
      "notes": "English loanword. Collocations: 벨벳 드레스, 벨벳 소재. Luxurious tactile fabric; light-reflective surface adds sophistication."
    },
    {
      "korean": "합성섬유",
      "english": "synthetic fiber; man-made fabric",
      "example": "합성섬유는 가격이 싸지만 피부가 예민한 사람에겐 안 맞을 수 있다.",
      "example_en": "Synthetic fibers are cheap, but may not suit people with sensitive skin.",
      "notes": "Sino-Korean 合成纖維 (combined + fiber). Affordable but may cause skin irritation. Related: 폴리에스터, 나일론, 아크릴."
    },
    {
      "korean": "원단",
      "english": "textile; fabric; cloth (as material)",
      "example": "이 원단은 촉감이 부드러워서 고급 정장에 많이 사용된다.",
      "example_en": "This textile is soft to the touch, so it's often used for high-end suits.",
      "notes": "Native Korean 원단 (원 + 단). Generic term for fabric as material/yardage. Related: 천, 소재. Used when discussing fabric quality or sourcing."
    },
    {
      "korean": "빈티지",
      "english": "vintage (style); retro fashion",
      "example": "요즘 빈티지 스타일이 인기라 구제 시장을 찾는 젊은층이 늘었다.",
      "example_en": "Vintage style is popular lately, so more young people are visiting thrift markets.",
      "notes": "English loanword. Collocations: 빈티지 스타일, 빈티지 룩, 구제(thrift). Often associated with sustainability and nostalgia."
    },
    {
      "korean": "오버핏",
      "english": "oversized fit; relaxed fit",
      "example": "오버핏 코트가 몇 년째 가을 패션의 대세다.",
      "example_en": "Oversized fit coats have been the dominant autumn fashion trend for several years.",
      "notes": "English loanword. Collocations: 오버핏 코트, 오버핏 실루엣. Modern trend emphasizing comfort and volume over body-conforming cuts."
    },
    {
      "korean": "미니멀",
      "english": "minimal; minimalist (style)",
      "example": "군더더기 없는 미니멀 스타일이 직장인들 사이에서 인기다.",
      "example_en": "A no-frills minimal style is popular among office workers.",
      "notes": "English loanword. Related: 심플, 깔끔. Emphasizes essential items, neutral colors, and functional design in wardrobe."
    },
    {
      "korean": "레이어드",
      "english": "layered (styling); layering",
      "example": "환절기에는 레이어드 코디로 온도 변화에 대비하는 게 좋다.",
      "example_en": "During seasonal transitions, it's good to layer outfits to prepare for temperature changes.",
      "notes": "English loanword (layered). Collocations: 레이어드 코디, 레이어드 룩. Both practical (temperature control) and aesthetic technique."
    },
    {
      "korean": "코디",
      "english": "outfit coordination; styling; coord",
      "example": "하루 아침에 입을 코디를 미리 정해 놓으면 시간이 절약된다.",
      "example_en": "Deciding your outfit coordination the night before saves time in the morning.",
      "notes": "English loanword (coordination). Collocations: 코디를 하다, 룩 코디. Essential term in modern Korean fashion vocabulary."
    },
    {
      "korean": "시스루",
      "english": "see-through; sheer (fabric/style)",
      "example": "시스루 소재 블라우스는 안에 이너를 입어야 부담이 없다.",
      "example_en": "With a see-through blouse, you need to wear an inner layer to feel comfortable.",
      "notes": "English loanword (see-through). Collocations: 시스루 블라우스, 시스루 시즌. Requires layering with appropriate undergarments."
    },
    {
      "korean": "스트릿패션",
      "english": "street fashion; streetwear",
      "example": "홍대 주변은 스트릿패션의 성지로 불린다.",
      "example_en": "The area around Hongdae is called the mecca of street fashion.",
      "notes": "English loanword. Associated with youth culture and trendy neighborhoods like Hongdae. Represents casual, experimental street style."
    },
    {
      "korean": "하이엔드",
      "english": "high-end; luxury (fashion)",
      "example": "하이엔드 브랜드의 옷을 중고로 사는 리셀 문화가 확산되고 있다.",
      "example_en": "The resale culture of buying high-end brand clothes secondhand is spreading.",
      "notes": "English loanword. Related: 명품, 럭셔리. Indicates premium brands and luxury price points; increasingly accessible through resale markets."
    },
    {
      "korean": "애슬레저",
      "english": "athleisure; athletic-leisure wear",
      "example": "재택근무가 늘면서 애슬레저 시장이 폭발적으로 성장했다.",
      "example_en": "As remote work increased, the athleisure market grew explosively.",
      "notes": "English loanword (athletic + leisure). Collocations: 애슬레저 룩, 애슬레저 시장. Grew with remote work; blurs boundary between sportswear and everyday wear."
    },
    {
      "korean": "젠더리스",
      "english": "genderless; gender-neutral (fashion)",
      "example": "젠더리스 패션이 확산되면서 남녀 구분 없는 옷이 많아졌다.",
      "example_en": "With genderless fashion spreading, more clothing items are made without gender distinction.",
      "notes": "English loanword. Related: 유니섹스, 중성적. Modern trend rejecting traditional gendered clothing categories."
    },
    {
      "korean": "한복",
      "english": "hanbok; traditional Korean clothing",
      "example": "설날에 한복을 입고 세배하는 풍습이 아직도 이어지고 있다.",
      "example_en": "The custom of wearing hanbok and performing the New Year's bow on Seollal still continues.",
      "notes": "Sino-Korean 韓服 (Korean + clothing). Worn on holidays (Seollal, Chuseok) and formal occasions. Components: 저고리(jeogori), 치마(skirt), 바지(pants)."
    },
    {
      "korean": "생활한복",
      "english": "modernized hanbok; everyday hanbok",
      "example": "생활한복은 전통 한복을 현대적으로 재해석한 일상복이다.",
      "example_en": "Modernized hanbok is everyday clothing that reinterprets traditional hanbok in a contemporary way.",
      "notes": "Simplified, comfortable version of traditional hanbok designed for everyday wear. Related: 개량한복. Growing trend among younger generations."
    },
    {
      "korean": "동대문",
      "english": "Dongdaemun (fashion district); wholesale fashion market",
      "example": "동대문 시장은 새벽까지 문을 열어서 도매 바이어들이 몰린다.",
      "example_en": "Dongdaemun market stays open until dawn, attracting wholesale buyers.",
      "notes": "Famous Seoul fashion district; major wholesale and trendy retail hub. Opens early mornings for bulk buyers; hub for fast-fashion trend-setting."
    },
    {
      "korean": "맞춤복",
      "english": "custom-tailored clothing; bespoke suit",
      "example": "기성복보다 맞춤복이 핏이 좋지만 가격이 두세 배 비싸다.",
      "example_en": "Custom-tailored clothing fits better than ready-to-wear, but costs two to three times more.",
      "notes": "Sino-Korean 맞춤 + 服. Premium option for perfect fit and quality. Related: 테일러메이드, 맞춤 옷. Involves fittings and time investment."
    },
    {
      "korean": "기성복",
      "english": "ready-to-wear; off-the-rack clothing",
      "example": "SPA 브랜드의 등장으로 저렴한 기성복 시장이 급성장했다.",
      "example_en": "With the emergence of SPA brands, the affordable ready-to-wear market grew rapidly.",
      "notes": "Sino-Korean 既成服. Standard sizes produced in bulk; democratized fashion access. SPA brands offer affordable trendy pieces."
    },
    {
      "korean": "유행",
      "english": "trend; fashion trend; vogue",
      "example": "패션 유행은 20년 주기로 돌고 돈다는 말이 있다.",
      "example_en": "There's a saying that fashion trends go in 20-year cycles.",
      "notes": "Sino-Korean 流行 (flow + behavior). Collocations: 유행을 따르다, 유행이 지나가다. Fashion cycles and trend forecasting are cultural phenomena."
    },
    {
      "korean": "꾸안꾸",
      "english": "effortlessly stylish; dressed-up but looking natural",
      "example": "꾸안꾸 스타일은 꾸민 듯 안 꾸민 듯 자연스러운 게 핵심이다.",
      "example_en": "The key to 'effortlessly stylish' is looking natural as if you dressed up but also didn't.",
      "notes": "Native Korean compound: 꾸밈 + 안 + 꾸밈 (styled + not styled). Aesthetic ideal in Korean fashion emphasizing studied casualness; highly curated but appearing effortless."
    },
    {
      "korean": "개성",
      "english": "individuality; personal style; uniqueness",
      "example": "자신만의 개성을 살린 패션이 획일적인 유행보다 중요하다.",
      "example_en": "Fashion that brings out your own individuality is more important than uniform trends.",
      "notes": "Sino-Korean 個性 (individual + nature). Collocations: 개성 있는 스타일, 개성을 드러내다. Encourages personal expression over trend conformity."
    },
    {
      "korean": "착장",
      "english": "outfit; ensemble; what one is wearing",
      "example": "오늘의 착장을 SNS에 올리는 것이 일종의 자기 표현이 됐다.",
      "example_en": "Posting today's outfit on social media has become a form of self-expression.",
      "notes": "Sino-Korean 着裝 (wear + dress). Collocations: 오늘의 착장, 착장 사진. Modern usage: common in social media fashion documentation."
    },
    {
      "korean": "패피",
      "english": "fashionista; fashion-forward person (slang for 패션피플)",
      "example": "서울 패션위크에 모인 패피들의 스타일이 다양했다.",
      "example_en": "The styles of the fashionistas gathered at Seoul Fashion Week were diverse.",
      "notes": "Slang abbreviation of 패션피플 (fashion people). Used for fashion-conscious, trendsetting individuals. Related: 패션 블로거, 인플루언서."
    }
  ]
}
