{
  "주제별 단어 — 음식 (Topic: Food)": [
    {
      "korean": "졸이다",
      "english": "to simmer down; to reduce (a sauce or liquid by boiling)",
      "example": "간장 양념을 약불에서 천천히 졸여야 고기에 맛이 잘 배요.",
      "example_en": "You need to slowly reduce the soy sauce marinade on low heat so the flavor absorbs into the meat.",
      "notes": "Often used with 양념 (marinade) or 소스 (sauce). Compare: 끓이다 (boil) is hotter; 졸이다 is gentler reduction."
    },
    {
      "korean": "데치다",
      "english": "to blanch (briefly boil and then shock in cold water)",
      "example": "시금치를 끓는 물에 살짝 데쳐서 찬물에 헹궈 주세요.",
      "example_en": "Briefly blanch the spinach in boiling water and rinse it in cold water.",
      "notes": "Essential cooking prep technique; commonly used with 소금 (salt) added to water. Related: 삶다 (boil)."
    },
    {
      "korean": "무치다",
      "english": "to dress; to season and mix (vegetables with sauce)",
      "example": "콩나물을 참기름과 소금으로 무치면 간단한 반찬이 돼요.",
      "example_en": "If you toss bean sprouts with sesame oil and salt, it makes a simple side dish.",
      "notes": "Typically done with 참기름 (sesame oil) and 소금 (salt). Korean staple for quick side dishes (반찬)."
    },
    {
      "korean": "조리다",
      "english": "to braise; to simmer in seasoned liquid until absorbed",
      "example": "감자를 간장 양념에 조려서 윤기 나게 만들었어요.",
      "example_en": "I braised the potatoes in soy sauce seasoning until they had a glossy finish.",
      "notes": "Key technique for braised dishes like 찜 (steamed) and 구이 (grilled) preparations. Implies slow, gentle cooking."
    },
    {
      "korean": "우려내다",
      "english": "to extract flavor by steeping or simmering (broth, tea)",
      "example": "다시마와 멸치로 육수를 우려내면 깊은 맛이 나요.",
      "example_en": "If you steep kelp and anchovies to make stock, you get a deep flavor.",
      "notes": "Common with 육수 (broth), 고명 (garnish), and 국물 (soup liquid). Used for tea and dashi-like stocks."
    },
    {
      "korean": "삭히다",
      "english": "to ferment; to age until mellowed (e.g., skate, fish sauce)",
      "example": "홍어를 제대로 삭히려면 최소 일주일은 걸려요.",
      "example_en": "It takes at least a week to properly ferment skate fish.",
      "notes": "Used for pungent fermented foods like 홍어 (skate) and 젓갈 (fermented seafood). Traditional Korean preservation method."
    },
    {
      "korean": "재우다",
      "english": "to marinate; to let soak in seasoning",
      "example": "고기를 양념에 하루 정도 재워야 맛이 제대로 배요.",
      "example_en": "You need to marinate the meat in the sauce for about a day for the flavor to properly absorb.",
      "notes": "Precedes cooking to infuse flavor. Often done overnight (밤새 재우다). Related: 불리다 (soak)."
    },
    {
      "korean": "버무리다",
      "english": "to toss and mix together with seasoning (by hand)",
      "example": "김장할 때 배추에 양념을 골고루 버무리는 게 핵심이에요.",
      "example_en": "The key when making kimchi is to evenly toss the seasoning into the cabbage.",
      "notes": "Hands-on mixing technique; often creates a coating. Common with 나물 (seasoned vegetables)."
    },
    {
      "korean": "간을 맞추다",
      "english": "to adjust the seasoning; to season to taste",
      "example": "국이 거의 다 됐으니까 마지막에 간을 맞춰 보세요.",
      "example_en": "The soup is almost done, so try adjusting the seasoning at the end.",
      "notes": "Essential seasoning phrase; 간이 안 맞다 = underseasonedm 간이 맞다 = perfectly seasoned."
    },
    {
      "korean": "치대다",
      "english": "to knead (dough) thoroughly by pressing and folding",
      "example": "반죽을 충분히 치대야 쫄깃한 식감이 나와요.",
      "example_en": "You need to knead the dough thoroughly to get a chewy texture.",
      "notes": "Specific to dough work; implies vigorous folding and pressing. Used for bread and Korean dessert doughs."
    },
    {
      "korean": "멸치액젓",
      "english": "anchovy fish sauce (fermented anchovy extract used as seasoning)",
      "example": "김치를 담글 때 멸치액젓을 넣으면 감칠맛이 확 살아나요.",
      "example_en": "Adding anchovy fish sauce when making kimchi really brings out the umami.",
      "notes": "Pungent but essential umami base; use sparingly. Related: 새우젓 (fermented shrimp), 소금 (salt)."
    },
    {
      "korean": "들기름",
      "english": "perilla oil (nutty-flavored oil pressed from perilla seeds)",
      "example": "나물 무칠 때 참기름 대신 들기름을 쓰면 더 고소해요.",
      "example_en": "Using perilla oil instead of sesame oil when seasoning greens makes it nuttier.",
      "notes": "Distinctly nutty Korean flavor; more fragrant than soy oil. Drizzle over finished dishes, not for cooking."
    },
    {
      "korean": "천일염",
      "english": "sun-dried sea salt (natural sea salt evaporated by sunlight)",
      "example": "김장용 배추를 절일 때는 천일염을 써야 맛이 깔끔해요.",
      "example_en": "When salting cabbage for kimchi-making, you should use sun-dried sea salt for a clean taste.",
      "notes": "Premium sea salt from coastal areas like 신안 (Shinan). Coarser texture than table salt; used for pickling."
    },
    {
      "korean": "조청",
      "english": "grain syrup; rice malt syrup (traditional Korean sweetener)",
      "example": "약고추장 만들 때 설탕 대신 조청을 넣으면 훨씬 깊은 맛이 나요.",
      "example_en": "Using grain syrup instead of sugar when making seasoned gochujang gives a much deeper flavor.",
      "notes": "Traditional sweetener less cloying than refined sugar. Used in 고추장 (red chili paste) and desserts."
    },
    {
      "korean": "새우젓",
      "english": "salted fermented shrimp (pungent condiment and seasoning)",
      "example": "보쌈 먹을 때 새우젓에 찍어 먹으면 정말 맛있어요.",
      "example_en": "Dipping bossam in salted fermented shrimp is really delicious.",
      "notes": "Pungent umami condiment; goes with 김장 (kimchi making). Use 한 스푼 (one spoon) at a time."
    },
    {
      "korean": "육수",
      "english": "broth; stock (base liquid for soups and stews)",
      "example": "육수를 제대로 내면 따로 조미료를 안 넣어도 맛있어요.",
      "example_en": "If you make the broth properly, it tastes good without adding any extra seasoning.",
      "notes": "Foundation of Korean cooking; 사골육수 (beef bone broth) is most popular. Takes hours of simmering."
    },
    {
      "korean": "양념장",
      "english": "seasoning sauce; marinade (prepared sauce mixture for flavoring)",
      "example": "불고기 양념장은 집집마다 비율이 조금씩 달라요.",
      "example_en": "Every household has a slightly different ratio for their bulgogi marinade.",
      "notes": "Ready-made sauce base for marinades and dipping. Common types: 간장양념장, 고추양념장 (chili-based)."
    },
    {
      "korean": "청주",
      "english": "cheongju; clear rice wine (used in cooking to remove odors)",
      "example": "생선 비린내를 잡으려면 청주를 한 숟갈 넣어 보세요.",
      "example_en": "Try adding a spoonful of rice wine to get rid of the fishy smell.",
      "notes": "Clear rice wine for cooking; removes 비린내 (fishy odor). Add near end of cooking."
    },
    {
      "korean": "고추냉이",
      "english": "wasabi; horseradish (pungent green condiment)",
      "example": "회를 먹을 때 고추냉이를 너무 많이 풀면 눈물이 나요.",
      "example_en": "If you use too much wasabi when eating raw fish, it'll bring you to tears.",
      "notes": "Japanese wasabi, not indigenous to Korea; different from Korean 겨자 (mustard). Serves green aesthetic on sushi."
    },
    {
      "korean": "깻잎",
      "english": "perilla leaf (aromatic leaf used as a wrap or garnish)",
      "example": "삼겹살 구울 때 깻잎에 싸 먹으면 느끼한 맛이 잡혀요.",
      "example_en": "Wrapping grilled pork belly in perilla leaves cuts through the greasiness.",
      "notes": "Perilla leaf; wrapped around grilled meat or used as 생채 (fresh side dish). Slightly minty, distinctive aroma."
    },
    {
      "korean": "곱빼기",
      "english": "double portion; extra-large serving (at a restaurant)",
      "example": "배가 너무 고파서 냉면을 곱빼기로 시켰어요.",
      "example_en": "I was so hungry that I ordered a double portion of cold noodles.",
      "notes": "Restaurant slang for larger portion; doubles both main dish and side dishes. Common at ramyeon shops."
    },
    {
      "korean": "상차림",
      "english": "table setting; laid-out spread of dishes",
      "example": "한정식 상차림을 보면 반찬이 스무 가지가 넘어요.",
      "example_en": "A traditional Korean full-course table setting comes with over twenty side dishes.",
      "notes": "Formal table presentation of all dishes; ~7-9 dishes at a proper Korean meal. Status indicator in traditional settings."
    },
    {
      "korean": "반주",
      "english": "alcoholic drink to accompany a meal",
      "example": "저녁에 갈비찜에 반주 한잔하는 게 소소한 낙이에요.",
      "example_en": "Having a drink with braised short ribs in the evening is my small pleasure.",
      "notes": "Alcoholic pairing with food; culture of drinking socially with meals. Common: 소주, 맥주 (beer), 막걸리."
    },
    {
      "korean": "대기표",
      "english": "waiting number; queue ticket (at a popular restaurant)",
      "example": "그 맛집은 항상 줄이 길어서 대기표를 받고 30분은 기다려야 해요.",
      "example_en": "That popular restaurant always has a long line, so you have to take a number and wait at least 30 minutes.",
      "notes": "Drawn at popular restaurants during peak hours; shows wait time. Part of casual dining experience."
    },
    {
      "korean": "단골집",
      "english": "one's regular restaurant; go-to eatery",
      "example": "이 칼국수집은 10년 넘게 다닌 단골집이에요.",
      "example_en": "This knife-cut noodle place is a spot I've been a regular at for over 10 years.",
      "notes": "Repeat customer relationship; you get special treatment and discounts. Implies loyalty."
    },
    {
      "korean": "인분",
      "english": "serving; portion (counter for number of servings)",
      "example": "삼겹살 3인분이랑 된장찌개 하나 주세요.",
      "example_en": "Three servings of pork belly and one soybean paste stew, please.",
      "notes": "Counter for servings (한 인분 = one serving); helps quantify portions. Restaurant standard for pricing."
    },
    {
      "korean": "후식",
      "english": "dessert; after-meal treat",
      "example": "식사 후에 후식으로 수정과가 나왔어요.",
      "example_en": "After the meal, cinnamon persimmon punch came out as dessert.",
      "notes": "Meal finale; can be 디저트 (Western dessert) or 식혜 (traditional rice punch). Often served free or with coffee."
    },
    {
      "korean": "합석",
      "english": "sharing a table (with strangers at a busy restaurant)",
      "example": "점심시간이라 자리가 없어서 합석해도 되냐고 물어봤어요.",
      "example_en": "It was lunchtime and there were no seats, so I asked if I could share a table.",
      "notes": "Communal dining at crowded restaurants; strangers share tables. Unique Korean restaurant culture."
    },
    {
      "korean": "불판",
      "english": "grill plate; BBQ griddle (for Korean barbecue)",
      "example": "불판이 너무 뜨거우니까 고기를 빨리 뒤집어야 안 타요.",
      "example_en": "The grill plate is really hot, so you need to flip the meat quickly or it'll burn.",
      "notes": "Metal griddle for 불고기 (Korean BBQ); heated from below. Table-top grilling experience."
    },
    {
      "korean": "별미",
      "english": "delicacy; special local treat; unusual dish worth trying",
      "example": "제주도에 가면 꼭 먹어 봐야 할 별미가 많아요.",
      "example_en": "There are many delicacies you must try when you visit Jeju Island.",
      "notes": "Regional specialty worth seeking out; implies quality and uniqueness. Often handmade or traditional recipes."
    },
    {
      "korean": "쫄깃하다",
      "english": "chewy; pleasantly elastic (texture of noodles, rice cakes)",
      "example": "이 떡볶이는 떡이 쫄깃해서 식감이 정말 좋아요.",
      "example_en": "The rice cakes in this tteokbokki are so chewy that the texture is really great.",
      "notes": "Positive texture descriptor; ~chewy-bouncy. Prized in Korean noodles, rice cakes, and seafood."
    },
    {
      "korean": "바삭하다",
      "english": "crispy; crunchy (fried food, crackers, roasted items)",
      "example": "튀김옷이 바삭하게 잘 입혀져서 식감이 최고예요.",
      "example_en": "The batter was fried perfectly crispy, making the texture outstanding.",
      "notes": "Crispy, crunchy texture; oppositeq느끼하다 (greasy). Ideal for 튀김 (fried) and toasted items."
    },
    {
      "korean": "담백하다",
      "english": "mild; clean-tasting; light (not greasy or heavy)",
      "example": "이 두부 요리는 양념이 세지 않아서 담백하고 깔끔해요.",
      "example_en": "This tofu dish is mild and clean because the seasoning isn't overpowering.",
      "notes": "Light, clean taste; no heaviness or richness. Korean preference for balanced, subtle flavoring."
    },
    {
      "korean": "고소하다",
      "english": "nutty; savory; toasty (pleasant rich aroma, like sesame)",
      "example": "갓 볶은 참깨를 뿌리니까 고소한 냄새가 확 퍼졌어요.",
      "example_en": "When I sprinkled freshly roasted sesame seeds, a nutty aroma spread instantly.",
      "notes": "Warm, nutty, toasty aroma; from 참기름 (sesame oil), 들기름 (perilla oil), roasted grains. Comforting flavor."
    },
    {
      "korean": "느끼하다",
      "english": "greasy; overly rich; heavy (unpleasantly oily or fatty)",
      "example": "크림파스타가 너무 느끼해서 반밖에 못 먹었어요.",
      "example_en": "The cream pasta was so greasy that I could only eat half of it.",
      "notes": "Overly rich, fatty, greasy sensation; negative descriptor. Opposite: 담백하다."
    },
    {
      "korean": "감칠맛",
      "english": "umami; savory depth of flavor",
      "example": "된장을 오래 숙성시키면 감칠맛이 훨씬 깊어져요.",
      "example_en": "When you age doenjang for a long time, the umami deepens significantly.",
      "notes": "Umami/savory fifth taste; from fermented seafood, soy, mushrooms. Key to Korean flavor depth."
    },
    {
      "korean": "칼칼하다",
      "english": "sharp-spicy and refreshing (brisk heat in soups/stews)",
      "example": "해장국이 칼칼해서 속이 확 풀리는 느낌이에요.",
      "example_en": "The hangover soup has a sharp spiciness that really settles your stomach.",
      "notes": "Sharp, brisk spiciness with refreshing sting; found in 찌개 (stew), 국 (soup). Less intense than 맵다."
    },
    {
      "korean": "걸쭉하다",
      "english": "thick; viscous (consistency of soup, porridge, or sauce)",
      "example": "호박죽을 좀 더 걸쭉하게 끓이고 싶으면 찹쌀가루를 넣으세요.",
      "example_en": "If you want to make the pumpkin porridge thicker, add some glutinous rice flour.",
      "notes": "Thick, viscous, starchy consistency; describes soups and porridges. Texture indicator in cooking."
    },
    {
      "korean": "구수하다",
      "english": "rich and earthy; pleasantly savory (grain, roasted, or fermented aroma)",
      "example": "누룽지를 끓이면 구수한 냄새가 온 집 안에 퍼져요.",
      "example_en": "When you boil scorched rice, a rich earthy aroma fills the whole house.",
      "notes": "Rich, earthy, pleasantly savory aroma; from fermentation, roasting, or grains. Deeply satisfying."
    },
    {
      "korean": "쌉싸름하다",
      "english": "slightly bitter; pleasantly bittersweet (greens, herbs, dark chocolate)",
      "example": "봄나물은 약간 쌉싸름한 맛이 있어서 입맛을 돋워 줘요.",
      "example_en": "Spring greens have a slightly bitter taste that stimulates the appetite.",
      "notes": "Pleasantly bittersweet, slightly astringent; found in greens, bitter melon, dark foods. Mature palate preference."
    }
  ]
}