{
  "주제별 단어 — 주거 (Topic: Housing)": [
    {
      "korean": "전세",
      "english": "jeonse (long-term deposit rental) — lump sum deposit for occupancy term, no monthly rent",
      "example": "전세 아파트에 살면 이자 수익까지 고려할 수 있어서 어떤 면에선 저축하는 느낌이다.",
      "example_en": "If you live in a jeonse apartment, you can even consider the interest income, so in some ways it feels like saving money.",
      "notes": "전세 계약, 전세금 인상; 월세/전월세와 대비; 한국 특유의 임차인 제도. Sino-Korean: 傳世 (전/傳 + 세/世)."
    },
    {
      "korean": "월세",
      "english": "monthly rent — regular monthly payment without large deposit",
      "example": "사회 초년생이라 대출받을 여유가 없어서 월세로 시작했다.",
      "example_en": "As a new worker, I didn't have the means to get a loan, so I started with monthly rent.",
      "notes": "월세 올리기, 월세 내기; 전세와 함께 사용되는 주요 임차 방식. Sino-Korean: 月稅 (월/月 + 세/稅)."
    },
    {
      "korean": "오피스텔",
      "english": "officetel — compact residential/office hybrid unit, smaller than apartment",
      "example": "오피스텔은 자취생에게 인기가 많은데 관리가 까다롭다는 게 단점이다.",
      "example_en": "Officetels are popular with students living alone, but the downside is that management can be complicated.",
      "notes": "오피스텔 월세, 원룸과 비교; 신혼부부/직장인 선호. 영어차용어: office + tel(ephone)."
    },
    {
      "korean": "빌라",
      "english": "villa — multi-unit residential building, between apartment and detached house",
      "example": "빌라는 아파트보다 저렴하지만 배수가 자주 막혀서 신경 써야 한다.",
      "example_en": "Villas are cheaper than apartments, but you have to be careful because drainage clogs frequently.",
      "notes": "빌라 구조, 빌라 배수 문제; 다세대주택과 유사하지만 더 작음. 영어차용어: villa (이탈리아 건축 양식)."
    },
    {
      "korean": "다세대주택",
      "english": "multi-family house — shared building with multiple independent units",
      "example": "이 지역의 다세대주택은 좁지만 가성비가 뛰어나다.",
      "example_en": "Multi-family houses in this area are small but offer great value for money.",
      "notes": "다세대주택 임대, 투자용 인기; 단독주택/빌라와 구분. Sino-Korean: 多世代住宅 (여러 + 세대 + 집)."
    },
    {
      "korean": "단독주택",
      "english": "detached house — standalone residential house with private yard",
      "example": "단독주택을 구매하려니 토지 가격이 너무 올라서 포기했다.",
      "example_en": "I gave up on buying a detached house because land prices went up too much.",
      "notes": "단독주택 가격, 토지; 전원주택과 구분 (도시 근처). Sino-Korean: 單獨住宅 (혼자 + 독립적 + 집)."
    },
    {
      "korean": "신축",
      "english": "newly built — brand new construction not yet occupied",
      "example": "신축 아파트는 가격이 비싸지만 시설이 최신식이라서 인기가 많다.",
      "example_en": "Newly built apartments are expensive, but they're popular because the facilities are state-of-the-art.",
      "notes": "신축 프리미엄, 신축 분양; 중고/기존과 대비. Sino-Korean: 新築 (새 + 짓다)."
    },
    {
      "korean": "중고 아파트",
      "english": "preowned apartment — previously occupied apartment for resale",
      "example": "중고 아파트는 신축보다 저렴해서 요즘 구매자들이 많이 찾는다.",
      "example_en": "Preowned apartments are cheaper than newly built ones, so many buyers are looking for them these days.",
      "notes": "중고 가격, 중고 매입; 신축과의 가격 차이. Sino-Korean: 中古 (다른 사람의 + 오래된)."
    },
    {
      "korean": "투룸",
      "english": "two-room unit — apartment with two separate rooms plus living area",
      "example": "신혼부부들이 투룸이나 쓰리룸을 많이 찾는 편이다.",
      "example_en": "Newlyweds tend to look for two-room or three-room units.",
      "notes": "투룸 평면, 투룸 월세; 원룸/쓰리룸 비교. 영어차용어: two-room의 음역."
    },
    {
      "korean": "원룸",
      "english": "one-room unit — studio apartment with single large room and bathroom",
      "example": "대학가 원룸 월세가 50만 원대인데 요즘 내릴 기미가 안 보인다.",
      "example_en": "One-room rentals near universities are in the 500,000-won range, but there's no sign of them dropping these days.",
      "notes": "원룸 시장, 원룸 가격; 자취생/독신자 대상. 영어차용어: one-room의 음역."
    },
    {
      "korean": "리모델링",
      "english": "remodeling — large-scale renovation changing structure or layout",
      "example": "20년 된 주택을 리모델링해서 새집처럼 만들었다.",
      "example_en": "We remodeled a 20-year-old house to make it look brand new.",
      "notes": "리모델링 공사, 리모델링 비용; 인테리어와 다름 (구조 변경). 영어차용어: remodeling."
    },
    {
      "korean": "인테리어",
      "english": "interior — decorating and finishing interior spaces",
      "example": "인테리어 비용이 생각보다 많이 들어서 예산을 초과했다.",
      "example_en": "Interior costs were more than expected, so we went over budget.",
      "notes": "인테리어 공사, 인테리어 업체; 리모델링보다 가벼움. 영어차용어: interior design."
    },
    {
      "korean": "도배",
      "english": "wallpapering — applying wallpaper or wall coating",
      "example": "곰팡이가 심해서 도배를 다시 해야 한다.",
      "example_en": "The mold is so bad that we need to redo the wallpapering.",
      "notes": "도배 시공, 곰팡이로 인한 도배 필요; 방수/방음과 함께 필요. 순우리말 기원."
    },
    {
      "korean": "방음",
      "english": "soundproofing — insulation against noise",
      "example": "옆집 소음이 심해서 벽에 방음재를 붙였는데 효과가 없다.",
      "example_en": "The noise from the next apartment is bad, so we put soundproofing material on the wall, but it didn't work.",
      "notes": "방음재, 방음 공사; 층간소음 대응책. Sino-Korean: 防音 (막을 + 소리)."
    },
    {
      "korean": "방수",
      "english": "waterproofing — protection against water leakage",
      "example": "지하방은 방수가 잘되지 않으면 비 올 때마다 습기 때문에 고생한다.",
      "example_en": "If a semi-basement isn't well waterproofed, you struggle with moisture every time it rains.",
      "notes": "방수 처리, 방수 공사; 지하방/반지하 필수. Sino-Korean: 防水 (막을 + 물)."
    },
    {
      "korean": "싱크대",
      "english": "kitchen sink — sink unit with counter for kitchen",
      "example": "싱크대 배수가 막혀서 배관공을 불렀다.",
      "example_en": "The kitchen sink drain got clogged, so I called a plumber.",
      "notes": "싱크대 배수, 싱크대 교체; 주방 필수 설비. 영어차용어: sink + 대(台, 대사관의 대)."
    },
    {
      "korean": "욕실 타일",
      "english": "bathroom tile — ceramic tile for bathroom surfaces",
      "example": "욕실 타일에 곰팡이가 많이 슬었으니 타일을 교체해야 한다.",
      "example_en": "There's a lot of mold on the bathroom tiles, so we need to replace them.",
      "notes": "욕실 타일 교체, 곰팡이 제거; 욕실 관리의 주요 부분. 영어차용어: tile (포르투갈 도자기 기원)."
    },
    {
      "korean": "냉난방",
      "english": "cooling and heating — air conditioning and heating systems",
      "example": "오래된 건물은 냉난방 효율이 떨어져서 전기료가 많이 나온다.",
      "example_en": "Older buildings have poor cooling and heating efficiency, so electricity bills are high.",
      "notes": "냉난방 비용, 냉난방 효율; 에너지 소비의 주요 원인. Sino-Korean: 冷暖房 (차가운/따뜻한 + 방)."
    },
    {
      "korean": "보일러",
      "english": "boiler — heating system for hot water and room heating",
      "example": "겨울에 보일러가 고장 나면 난방을 못 하니까 미리 점검해야 한다.",
      "example_en": "If the boiler breaks down in winter, you can't have heating, so you need to check it in advance.",
      "notes": "보일러 점검, 보일러 수리; 겨울 생활 필수. 영어차용어: boiler."
    },
    {
      "korean": "시공",
      "english": "construction — actual building or renovation work",
      "example": "시공 기간이 예상보다 길어져서 입주가 미뤄졌다.",
      "example_en": "The construction period was longer than expected, so move-in was delayed.",
      "notes": "시공 기간, 시공 업체; 설계와 구분. Sino-Korean: 施工 (베풀 + 공사)."
    },
    {
      "korean": "공인중개사",
      "english": "licensed real estate agent — official intermediary for property transactions",
      "example": "좋은 공인중개사를 만나면 계약 과정이 훨씬 수월하다.",
      "example_en": "If you meet a good licensed real estate agent, the contract process is much smoother.",
      "notes": "공인중개사 수수료, 공인중개소; 공식 자격 필수. Sino-Korean: 公認 (공식적으로 인정) + 仲介人 (중개자)."
    },
    {
      "korean": "계약",
      "english": "contract — formal agreement for property rental or purchase",
      "example": "전세 계약을 체결할 때 명의 이전이 제대로 되는지 확인해야 한다.",
      "example_en": "When signing a jeonse contract, you must verify that the name transfer is properly done.",
      "notes": "계약서 작성, 계약 체결; 법률 문제 예방 필수. Sino-Korean: 契約 (약속 + 계약)."
    },
    {
      "korean": "등기",
      "english": "registration — legal registration of property ownership",
      "example": "부동산을 구매한 후 등기를 하지 않으면 법적 문제가 생길 수 있다.",
      "example_en": "If you don't register a property after purchase, it can cause legal problems.",
      "notes": "등기부등본, 소유권 등기; 법적 소유권 증명. Sino-Korean: 登記 (오를 + 기록)."
    },
    {
      "korean": "보증금",
      "english": "deposit — security deposit for rental agreements",
      "example": "전세 보증금이 올라서 이사를 고민하게 됐다.",
      "example_en": "Because the jeonse deposit increased, I'm now considering moving.",
      "notes": "보증금 반환, 보증금 인상; 전세 계약의 핵심. Sino-Korean: 保證金 (보장할 + 돈)."
    },
    {
      "korean": "계약금",
      "english": "down payment — initial payment when signing property contract",
      "example": "아파트를 계약할 때 계약금으로 보통 5%를 내야 한다.",
      "example_en": "When signing an apartment contract, you usually need to pay a down payment of 5%.",
      "notes": "계약금 비율, 잔금과의 구분; 분양/구매 시 필수. Sino-Korean: 契約金 (계약 + 돈)."
    },
    {
      "korean": "잔금",
      "english": "final payment — remaining balance due at closing",
      "example": "잔금 지불은 소유권 이전 당일에 이루어진다.",
      "example_en": "The final payment is made on the day of ownership transfer.",
      "notes": "잔금 납부, 소유권 이전; 계약금 이후 최종 결제. Sino-Korean: 殘金 (남은 + 돈)."
    },
    {
      "korean": "담보",
      "english": "collateral — property pledged as security for a loan",
      "example": "주택을 담보로 잡고 은행에서 대출받는 것이 일반적이다.",
      "example_en": "It's common to borrow from a bank using a house as collateral.",
      "notes": "담보 인정, 주택담보대출; 금융 거래의 중요 개념. Sino-Korean: 擔保 (맡길 + 보장)."
    },
    {
      "korean": "이사",
      "english": "moving — relocation to a new residence",
      "example": "큰 이사인데 친구들에게 도움을 청했다.",
      "example_en": "It was a big move, so I asked friends for help.",
      "notes": "이사 업체, 이사 비용, 이사짐; 전국적 서비스 산업. Sino-Korean: 移徙 (옮길 + 옮길)."
    },
    {
      "korean": "취득세",
      "english": "acquisition tax — tax on property purchase",
      "example": "부동산을 구매할 때 취득세가 생각보다 많이 나온다.",
      "example_en": "When buying real estate, the acquisition tax is higher than expected.",
      "notes": "취득세 세율, 취득세 계산; 구매 시 필수 비용. Sino-Korean: 取得稅 (얻을 + 세금)."
    },
    {
      "korean": "종부세",
      "english": "property tax — annual tax on real property holdings",
      "example": "다주택자는 종부세를 내야 하기 때문에 부담이 크다.",
      "example_en": "Multi-property owners have to pay property tax, so the burden is heavy.",
      "notes": "종부세 대상, 종부세 세율; 부동산 보유 시 연간 납부. Sino-Korean: 綜合不動産稅 (종합 + 부동산 + 세금)."
    },
    {
      "korean": "이웃",
      "english": "neighbor — person living next door or in nearby area",
      "example": "이웃과의 관계가 좋으면 동네 생활이 편하다.",
      "example_en": "If you have a good relationship with neighbors, living in the neighborhood is easier.",
      "notes": "이웃 관계, 이웃과의 분쟁; 공동생활 문화의 기초. 순우리말 기원."
    },
    {
      "korean": "층간소음",
      "english": "noise between floors — sound disturbance from above or below",
      "example": "층간소음 때문에 윗집 주민과 싸우는 일이 자주 생긴다.",
      "example_en": "Disputes with upstairs residents often happen because of noise between floors.",
      "notes": "층간소음 분쟁, 층간소음 조치; 한국 아파트 문화의 주요 갈등. Sino-Korean: 層間 (층 + 사이) + 騷音 (소란)."
    },
    {
      "korean": "공동생활",
      "english": "shared living — communal residential arrangement",
      "example": "아파트에서 공동생활을 하려면 주민 간 매너가 중요하다.",
      "example_en": "For shared living in an apartment, good manners between residents are important.",
      "notes": "공동생활 규칙, 공동 시설 이용; 아파트 문화의 핵심. Sino-Korean: 共同 (함께 + 함께) + 生活 (살다)."
    },
    {
      "korean": "관리사",
      "english": "property manager — person managing building maintenance and services",
      "example": "관리사가 성실하면 아파트 관리가 잘 된다.",
      "example_en": "If the property manager is diligent, apartment maintenance is good.",
      "notes": "관리사 업무, 관리비 납부; 아파트 관리의 중심 인물. Sino-Korean: 管理人 (관리 + 사람)."
    },
    {
      "korean": "경비실",
      "english": "security office — guard booth at building entrance",
      "example": "경비실에 소포가 왔다고 전화가 왔다.",
      "example_en": "The security office called to say a package arrived.",
      "notes": "경비실 방문, 경비요청; 아파트 안전의 최일선. Sino-Korean: 警備 (경비 + 경비) + 室 (방)."
    },
    {
      "korean": "주택가",
      "english": "residential area — neighborhood with houses",
      "example": "조용한 주택가에 살고 싶어서 강남보다 강북을 찾고 있다.",
      "example_en": "I want to live in a quiet residential area, so I'm looking in areas north of the river rather than south.",
      "notes": "주택가 조용함, 주택가 가격; 도시 지역과 구분. Sino-Korean: 住宅 (집) + 街 (거리)."
    },
    {
      "korean": "아파트 단지",
      "english": "apartment complex — large residential compound with multiple buildings",
      "example": "큰 아파트 단지는 편의시설이 풍부해서 생활이 편하다.",
      "example_en": "Large apartment complexes have abundant amenities, so living is convenient.",
      "notes": "단지 내 편의시설, 아파트 단지 문화; 대규모 주거공간. Sino-Korean: 團地 (모임 + 땅)."
    },
    {
      "korean": "골목",
      "english": "alley — narrow lane between buildings",
      "example": "골목 깊숙한 곳에 숨은 맛집들이 많다.",
      "example_en": "There are many hidden restaurants deep in the alleys.",
      "notes": "골목 문화, 골목 상권; 서울/도시의 특징적 공간. 순우리말 기원."
    },
    {
      "korean": "지역",
      "english": "area — district or neighborhood region",
      "example": "학군이 좋은 지역은 주택 가격이 높은 편이다.",
      "example_en": "Areas with good school districts tend to have higher housing prices.",
      "notes": "지역 선택, 지역 선호도; 주택구매의 핵심 고려사항. Sino-Korean: 地域 (땅 + 지역)."
    },
    {
      "korean": "매물",
      "english": "property for sale — item/property available for sale or lease",
      "example": "지금은 좋은 매물이 많지 않아서 대기하는 중이다.",
      "example_en": "Right now there aren't many good properties available, so we're waiting.",
      "notes": "매물 부족, 좋은 매물 찾기; 부동산 거래의 핵심 용어. Sino-Korean: 賣物 (팔 + 물건)."
    }
  ]
}
