{
  "고급 부사 (Advanced Adverbs)": [
    {
      "korean": "슬쩍",
      "english": "sneakily, stealthily; doing something discreetly so others won't notice",
      "example": "그는 회의 중에 슬쩍 자리를 빠져나갔다.",
      "example_en": "He sneaked out of his seat during the meeting.",
      "notes": "Sneakily; discreetly so others won't notice. Related: 몰래, 은근히."
    },
    {
      "korean": "넌지시",
      "english": "subtly, in a roundabout way; hinting without being direct",
      "example": "그녀는 넌지시 이직할 생각이 있다고 내비쳤다.",
      "example_en": "She subtly hinted that she was thinking of changing jobs.",
      "notes": "Subtly; hinting without being direct. Related: 에돌려, 한번 말씀해."
    },
    {
      "korean": "기꺼이",
      "english": "willingly, gladly; with genuine pleasure or readiness",
      "example": "도움이 필요하시면 기꺼이 도와드리겠습니다.",
      "example_en": "If you need help, I will gladly assist you.",
      "notes": "Willingly; with genuine pleasure. Related: 흔쾌히, 기쁘게."
    },
    {
      "korean": "거침없이",
      "english": "without hesitation, boldly; speaking or acting freely without holding back",
      "example": "그는 거침없이 자기 의견을 쏟아냈다.",
      "example_en": "He poured out his opinions without hesitation.",
      "notes": "Without hesitation; speaking freely. Related: 활발하게, 마음껏."
    },
    {
      "korean": "묵묵히",
      "english": "silently, without complaint; enduring or working steadily without a word",
      "example": "아버지는 평생 묵묵히 가족을 위해 일하셨다.",
      "example_en": "My father worked silently for his family his entire life.",
      "notes": "Silently; without complaint steadily. Related: 조용히, 말없이."
    },
    {
      "korean": "태연히",
      "english": "calmly, nonchalantly; maintaining composure in a tense or awkward situation",
      "example": "거짓말이 들통났는데도 그는 태연히 웃고 있었다.",
      "example_en": "Even after his lie was exposed, he was smiling nonchalantly.",
      "notes": "Calmly; nonchalantly maintaining composure. Related: 담담하게, 아무렇지 않게."
    },
    {
      "korean": "서슴없이",
      "english": "unhesitatingly, readily; doing something bold without a moment's pause",
      "example": "그녀는 서슴없이 수백만 원짜리 기부를 결정했다.",
      "example_en": "She unhesitatingly decided to donate several million won.",
      "notes": "Unhesitatingly; boldly without pause. Related: 거리낌 없이, 과감하게."
    },
    {
      "korean": "빈틈없이",
      "english": "flawlessly, without gaps; thoroughly with no room for error",
      "example": "보안팀이 행사장을 빈틈없이 점검했다.",
      "example_en": "The security team inspected the venue thoroughly without any gaps.",
      "notes": "Flawlessly; thoroughly without gaps. Related: 꼼꼼히, 세밀하게."
    },
    {
      "korean": "고스란히",
      "english": "entirely, intact; remaining completely as-is without loss or change",
      "example": "어머니가 보내주신 반찬이 고스란히 남아 있었다.",
      "example_en": "The side dishes my mother sent remained entirely untouched.",
      "notes": "Entirely; intact remaining completely. Related: 온전히, 그대로."
    },
    {
      "korean": "더듬더듬",
      "english": "fumblingly, haltingly; speaking or acting clumsily while searching for the right words or way",
      "example": "그는 한국어를 더듬더듬 말했지만 의미는 충분히 전달됐다.",
      "example_en": "He spoke Korean haltingly, but his meaning came across well enough.",
      "notes": "Fumblingly; haltingly while searching. Related: 어눌하게, 자꾸자꾸."
    },
    {
      "korean": "턱없이",
      "english": "absurdly, ridiculously; to an unreasonable degree, typically describing insufficiency",
      "example": "이 프로젝트에 배정된 예산은 턱없이 부족하다.",
      "example_en": "The budget allocated for this project is absurdly insufficient.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "한결",
      "english": "noticeably, considerably; a clear degree of improvement or change",
      "example": "운동을 시작하고 나서 몸이 한결 가벼워졌다.",
      "example_en": "After starting to exercise, my body felt noticeably lighter.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "유독",
      "english": "particularly, uniquely; standing out from the rest in a distinctive way",
      "example": "올해는 유독 겨울이 길게 느껴진다.",
      "example_en": "This year, winter feels particularly long.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "한층",
      "english": "a notch more, even further; indicating a step-up in degree or intensity",
      "example": "새 안경을 쓰니 세상이 한층 선명하게 보인다.",
      "example_en": "With my new glasses, the world looks even clearer.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "미처",
      "english": "(not) yet, (not) in time; failing to do something before the moment passes (used with negatives)",
      "example": "급하게 나오느라 우산을 미처 챙기지 못했다.",
      "example_en": "I left in such a hurry that I didn't manage to grab my umbrella in time.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "자못",
      "english": "quite, considerably; more than expected (slightly literary tone)",
      "example": "그의 연설은 자못 진지한 분위기 속에서 이루어졌다.",
      "example_en": "His speech took place in a quite serious atmosphere.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "그지없이",
      "english": "boundlessly, infinitely; to an extreme degree with no limit",
      "example": "합격 소식을 듣고 그지없이 기뻤다.",
      "example_en": "I was boundlessly happy when I heard the news that I passed.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "차마",
      "english": "(cannot) bring oneself to; unable to do something due to moral weight or emotional difficulty",
      "example": "그 사진을 차마 눈 뜨고 볼 수가 없었다.",
      "example_en": "I couldn't bring myself to look at that photo with my eyes open.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "여간",
      "english": "(not) ordinary, (not) easy; emphasizing that something is no small matter (used with negatives)",
      "example": "이번 시험은 여간 어려운 게 아니었다.",
      "example_en": "This exam was no ordinary level of difficult.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "도무지",
      "english": "(not) at all, absolutely (not); complete inability to understand or do something",
      "example": "설명을 들어도 도무지 이해가 안 된다.",
      "example_en": "Even after hearing the explanation, I can't understand it at all.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "이따금",
      "english": "occasionally, from time to time; at irregular but infrequent intervals",
      "example": "이따금 고향 친구에게서 연락이 온다.",
      "example_en": "From time to time, I get a call from a friend back home.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "더러",
      "english": "sometimes, once in a while; occasionally and somewhat randomly",
      "example": "아무리 꼼꼼한 사람도 더러 실수를 하기 마련이다.",
      "example_en": "Even the most meticulous person makes mistakes once in a while.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "줄곧",
      "english": "continuously, all along; without interruption from start to present",
      "example": "그는 입사한 이후로 줄곧 같은 부서에서 일해 왔다.",
      "example_en": "He has been working in the same department continuously since he joined the company.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "이내",
      "english": "soon after, before long; something happening shortly after a preceding event",
      "example": "비가 잠깐 내리더니 이내 그쳤다.",
      "example_en": "It rained briefly and then stopped before long.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "진즉에",
      "english": "earlier, long ago; expressing regret that something should have been done sooner",
      "example": "진즉에 말했으면 이렇게까지 안 됐을 텐데.",
      "example_en": "If you had said something earlier, it wouldn't have come to this.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "여태껏",
      "english": "until now, all this time; emphasizing the length of time something has continued",
      "example": "여태껏 그 사실을 모르고 있었다니 믿기지 않는다.",
      "example_en": "I can't believe I didn't know that fact all this time.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "문득",
      "english": "suddenly, out of the blue; a thought or feeling arising unexpectedly",
      "example": "길을 걷다가 문득 어릴 적 기억이 떠올랐다.",
      "example_en": "While walking down the street, a childhood memory suddenly came to mind.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "간간이",
      "english": "here and there, at intervals; sporadically with gaps in between",
      "example": "흐린 하늘 사이로 간간이 햇살이 비쳤다.",
      "example_en": "Sunlight peeked through the cloudy sky here and there.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "느지막이",
      "english": "rather late, toward the late end; at a somewhat delayed time",
      "example": "주말이라 느지막이 일어나서 브런치를 먹었다.",
      "example_en": "Since it was the weekend, I got up rather late and had brunch.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "이윽고",
      "english": "after a while, presently; following a pause or passage of time (literary/narrative tone)",
      "example": "긴 침묵이 흐른 뒤 이윽고 그가 입을 열었다.",
      "example_en": "After a long silence, he finally opened his mouth.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "굳이",
      "english": "insistently, going out of one's way; doing something unnecessary or despite it being inadvisable",
      "example": "안 해도 될 일을 굳이 왜 하려고 해?",
      "example_en": "Why are you insisting on doing something you don't even need to do?",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "어차피",
      "english": "anyway, in any case; the outcome remains the same regardless",
      "example": "어차피 늦은 거 서두를 필요 없어.",
      "example_en": "We're late anyway, so there's no need to rush.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "하물며",
      "english": "let alone, much less; if even the easier case is difficult, the harder one goes without saying",
      "example": "어른도 힘든 일인데 하물며 아이가 할 수 있겠어?",
      "example_en": "It's hard even for adults, let alone a child -- how could they manage?",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "정작",
      "english": "when it actually comes down to it; contrasting preparation or talk with the actual moment",
      "example": "평소에는 할 말이 많더니 정작 발표할 때는 아무 말도 못 했다.",
      "example_en": "He usually had a lot to say, but when it actually came time to present, he couldn't say a word.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "애당초",
      "english": "from the very beginning, in the first place; the root cause or starting point of a situation",
      "example": "애당초 계획 자체가 무리였다는 걸 이제야 깨달았다.",
      "example_en": "I only now realize that the plan itself was unreasonable from the very beginning.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "괜스레",
      "english": "for no reason, without cause; feeling or doing something without a clear basis",
      "example": "오랜만에 그 노래를 들으니 괜스레 눈물이 났다.",
      "example_en": "Hearing that song after a long time, tears came for no particular reason.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "으레",
      "english": "customarily, as a matter of course; something expected or habitual",
      "example": "명절이면 으레 고향을 찾는 사람들로 도로가 막힌다.",
      "example_en": "During holidays, the roads are invariably jammed with people heading to their hometowns.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "기필코",
      "english": "at all costs, by all means; a strong resolve to accomplish something no matter what",
      "example": "이번에는 기필코 합격하겠다는 각오로 공부했다.",
      "example_en": "I studied with the determination to pass at all costs this time.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "공연히",
      "english": "for no good reason, needlessly; doing something pointless that only causes trouble",
      "example": "공연히 참견했다가 오히려 욕만 먹었다.",
      "example_en": "I needlessly meddled and only ended up getting scolded.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "하마터면",
      "english": "almost, nearly; narrowly avoiding a negative outcome (always implies relief)",
      "example": "하마터면 기차를 놓칠 뻔했다.",
      "example_en": "I almost missed the train.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "주룩주룩",
      "english": "streaming down, pouring; the sound and sight of rain falling heavily in sheets",
      "example": "하늘이 갑자기 어두워지더니 비가 주룩주룩 쏟아지기 시작했다.",
      "example_en": "The sky suddenly darkened and rain began pouring down in sheets.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "살금살금",
      "english": "stealthily, on tiptoe; moving quietly so as not to be noticed",
      "example": "아이가 살금살금 부엌에 들어가서 과자를 꺼내 먹었다.",
      "example_en": "The child tiptoed into the kitchen and snuck some cookies.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "울컥",
      "english": "with a sudden surge of emotion; choking up unexpectedly",
      "example": "졸업식에서 은사님 얼굴을 보자마자 울컥 눈물이 쏟아졌다.",
      "example_en": "The moment I saw my mentor's face at graduation, tears suddenly welled up.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "허둥지둥",
      "english": "in a fluster, frantically; rushing around in a panicked, disorderly way",
      "example": "알람을 못 듣고 늦잠을 자서 허둥지둥 준비하고 나갔다.",
      "example_en": "I overslept because I didn't hear the alarm and rushed out in a fluster.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "쿨쿨",
      "english": "sound asleep, snoring away; the sound of someone sleeping deeply",
      "example": "옆자리 동료가 회의 중에 쿨쿨 잠들어 있었다.",
      "example_en": "The colleague sitting next to me was snoring away during the meeting.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "두리번두리번",
      "english": "looking around searchingly; turning one's head repeatedly to find something or someone",
      "example": "처음 온 식당에서 두리번두리번 자리를 찾았다.",
      "example_en": "At the restaurant I was visiting for the first time, I looked around searchingly for a seat.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "오들오들",
      "english": "trembling, shivering; shaking from cold, fear, or nervousness",
      "example": "영하 20도의 날씨에 얇은 옷을 입고 오들오들 떨었다.",
      "example_en": "I shivered in thin clothes in minus-20-degree weather.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "찔끔찔끔",
      "english": "in tiny trickles, little by little; giving, crying, or leaking in small reluctant amounts",
      "example": "아이가 주사 맞기 싫다며 찔끔찔끔 눈물을 흘렸다.",
      "example_en": "The child shed tiny tears, saying they didn't want to get the shot.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "시끌벅적",
      "english": "boisterously, noisily; a loud, lively commotion of many people",
      "example": "명절에 친척들이 모이면 집 안이 시끌벅적 활기가 넘친다.",
      "example_en": "When relatives gather during the holidays, the house overflows with boisterous energy.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "성큼성큼",
      "english": "with big strides, striding briskly; walking with large, confident steps",
      "example": "면접에 합격했다는 소식을 듣고 성큼성큼 걸어 나왔다.",
      "example_en": "After hearing the news that I passed the interview, I walked out with big, confident strides.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "급속히",
      "english": "rapidly, at a swift pace; changing or progressing very quickly",
      "example": "스마트폰 보급 이후 소통 방식이 급속히 변화했다.",
      "example_en": "Communication methods changed rapidly after the spread of smartphones.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "맹렬히",
      "english": "fiercely, furiously; with intense force or aggression",
      "example": "야당은 정부의 정책에 맹렬히 반대하고 나섰다.",
      "example_en": "The opposition party fiercely came out against the government's policy.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "한껏",
      "english": "to the fullest, to the maximum; putting in all one's effort or enjoying something fully",
      "example": "오늘은 쉬는 날이니까 한껏 여유를 즐기자.",
      "example_en": "It's a day off today, so let's enjoy our leisure to the fullest.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "단숨에",
      "english": "in one go, in a single breath; completing something swiftly without pause",
      "example": "재미있는 소설이라 단숨에 끝까지 읽어 버렸다.",
      "example_en": "It was such an interesting novel that I read it to the end in one go.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "죽어라",
      "english": "like crazy, desperately; working or trying extremely hard as if one's life depended on it",
      "example": "시험 전날 죽어라 공부했는데도 결과가 안 좋았다.",
      "example_en": "I studied like crazy the night before the exam, but the results still weren't good.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "급기야",
      "english": "finally, in the end; reaching an extreme point after a series of escalations",
      "example": "갈등이 계속되더니 급기야 두 사람은 절교를 선언했다.",
      "example_en": "The conflict continued until finally the two declared an end to their friendship.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "다짜고짜",
      "english": "without preamble, without any explanation; acting abruptly before the other party can react",
      "example": "그는 다짜고짜 화부터 내서 상황 파악이 안 됐다.",
      "example_en": "He got angry without any preamble, so I couldn't figure out what was going on.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "대뜸",
      "english": "abruptly, right off the bat; doing or saying something suddenly without any lead-up",
      "example": "인사도 없이 대뜸 '돈 빌려줘'라고 해서 당황했다.",
      "example_en": "I was taken aback when, without even a greeting, they abruptly said 'Lend me money.'",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "후다닥",
      "english": "in a flash, hurriedly; scrambling to do something very quickly",
      "example": "비가 갑자기 내려서 후다닥 빨래를 걷어 들였다.",
      "example_en": "It suddenly started raining, so I scrambled to bring in the laundry.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "불쑥",
      "english": "suddenly, out of nowhere; appearing or speaking up unexpectedly",
      "example": "오랜만에 친구가 불쑥 집에 찾아와서 깜짝 놀랐다.",
      "example_en": "I was startled when a friend I hadn't seen in ages showed up at my house out of nowhere.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "십중팔구",
      "english": "nine times out of ten, most likely; expressing very high probability",
      "example": "이 시간에 전화를 안 받으면 십중팔구 자고 있는 거야.",
      "example_en": "If he's not answering the phone at this hour, nine times out of ten he's asleep.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "필시",
      "english": "surely, certainly; expressing strong conviction with a slightly literary tone",
      "example": "이렇게 준비를 철저히 했으니 필시 좋은 결과가 있을 것이다.",
      "example_en": "Since we prepared this thoroughly, there will surely be good results.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "좀처럼",
      "english": "hardly, seldom; something that rarely happens or is very difficult to achieve (used with negatives)",
      "example": "그는 좀처럼 화를 내지 않는 사람인데 오늘은 얼굴이 붉어졌다.",
      "example_en": "He's a person who hardly ever gets angry, but today his face turned red.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "영락없이",
      "english": "unmistakably, to a T; looking or being exactly like something with no room for doubt",
      "example": "아들이 자라면서 영락없이 아버지를 닮아 가고 있다.",
      "example_en": "As the son grows, he's coming to resemble his father to a T.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "틀림없이",
      "english": "without a doubt, for certain; expressing firm conviction about a fact",
      "example": "이 글씨체는 틀림없이 그 사람이 쓴 것이다.",
      "example_en": "This handwriting was without a doubt written by that person.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "웬만하면",
      "english": "if at all possible, under normal circumstances; unless something unusual happens",
      "example": "웬만하면 주말에는 외출을 삼가고 집에서 쉬려고 한다.",
      "example_en": "If at all possible, I try to avoid going out on weekends and rest at home.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "만에 하나",
      "english": "on the off chance, one in ten thousand; expressing very low but not impossible probability",
      "example": "만에 하나 사고가 나더라도 보험이 있으니 걱정하지 마세요.",
      "example_en": "Even on the off chance that an accident occurs, there's insurance, so don't worry.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "혹여",
      "english": "by any chance, in case; worrying about an unlikely but possible event (formal/literary)",
      "example": "혹여 실수라도 할까 봐 서류를 세 번이나 확인했다.",
      "example_en": "I checked the documents three times, in case I might have made a mistake.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "과연",
      "english": "indeed, as expected; confirming what was anticipated or wondered about",
      "example": "소문대로 과연 그 식당 음식이 맛있었다.",
      "example_en": "Indeed, as rumored, the food at that restaurant was delicious.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "여지없이",
      "english": "without exception, without fail; leaving no room for deviation",
      "example": "약속 시간에 늦으면 여지없이 잔소리를 듣는다.",
      "example_en": "If I'm late for an appointment, I get a scolding without fail.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "터무니없이",
      "english": "absurdly, outrageously; to a degree that defies all reason",
      "example": "그 가게는 터무니없이 비싼 가격을 매겨 놓고 명품이라고 주장한다.",
      "example_en": "That store charges absurdly high prices and claims the items are luxury goods.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "마땅히",
      "english": "rightfully, as one ought to; something that is naturally expected or deserved",
      "example": "잘못을 저질렀으면 마땅히 사과해야 한다.",
      "example_en": "If you've done something wrong, you ought to apologize.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "고작",
      "english": "merely, at most; expressing disappointment that the amount or degree is less than expected",
      "example": "한 달을 꼬박 일했는데 받은 돈이 고작 이 정도야?",
      "example_en": "I worked a whole month, and the pay is merely this much?",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "가뜩이나",
      "english": "as if things weren't bad enough already; the situation was already problematic before worsening further",
      "example": "가뜩이나 바쁜데 갑자기 추가 업무까지 들어왔다.",
      "example_en": "I was already busy enough, and then additional work suddenly came in on top of that.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "무턱대고",
      "english": "recklessly, without thinking; acting impulsively without proper consideration",
      "example": "무턱대고 사업을 시작했다가 큰 손해를 봤다.",
      "example_en": "He recklessly started a business without thinking and ended up taking a big loss.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "기막히게",
      "english": "amazingly, incredibly; to a breathtaking degree (can express admiration or exasperation)",
      "example": "그 두 사람의 노래 호흡이 기막히게 잘 맞았다.",
      "example_en": "The two singers' harmony was amazingly in sync.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "쓸데없이",
      "english": "pointlessly, for no good reason; doing something that serves no useful purpose",
      "example": "쓸데없이 남의 일에 관심을 가지면 피곤해진다.",
      "example_en": "If you take a pointless interest in other people's business, you'll just tire yourself out.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "부질없이",
      "english": "in vain, futilely; doing something that will yield no meaningful result",
      "example": "이미 지나간 일을 부질없이 후회해 봤자 달라지는 건 없다.",
      "example_en": "Futilely regretting what's already past won't change anything.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "한결같이",
      "english": "consistently, steadfastly; remaining unchanged in attitude or behavior over time",
      "example": "그녀는 20년째 한결같이 같은 자리에서 봉사 활동을 하고 있다.",
      "example_en": "She has been steadfastly volunteering in the same place for 20 years.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "덮어놓고",
      "english": "blindly, without consideration; accepting or doing something without examining it first",
      "example": "남들이 좋다고 하니까 덮어놓고 따라 하면 안 된다.",
      "example_en": "You shouldn't blindly follow along just because others say it's good.",
      "notes": "Related concepts and usage variations in natural Korean."
    }
  ]
}