{
  "고급 동사 (Advanced Verbs)": [
    {
      "korean": "추론하다",
      "english": "to infer; to deduce; to reason",
      "example": "주어진 단서만으로 범인의 동기를 추론하기는 쉽지 않았다.",
      "example_en": "It was not easy to infer the culprit's motive from the given clues alone.",
      "notes": "To infer; deduce logically. Used in analytical/academic contexts. Related: 유추하다, 분석하다."
    },
    {
      "korean": "간파하다",
      "english": "to see through; to penetrate; to discern the truth of",
      "example": "그녀는 상대방의 거짓말을 단번에 간파했다.",
      "example_en": "She saw through the other person's lie at once.",
      "notes": "To see through deception/truth. Related: 꿰뚫다, 파악하다."
    },
    {
      "korean": "숙고하다",
      "english": "to deliberate; to ponder deeply; to give careful thought to",
      "example": "중대한 결정을 앞두고 며칠간 숙고한 끝에 사직서를 냈다.",
      "example_en": "After deliberating for days before a major decision, he submitted his resignation.",
      "notes": "To deliberate deeply before major decision. More formal than 생각하다. Related: 검토하다, 고민하다."
    },
    {
      "korean": "반추하다",
      "english": "to reflect on; to ruminate; to look back and reconsider",
      "example": "지난 실패를 반추하며 같은 실수를 되풀이하지 않겠다고 다짐했다.",
      "example_en": "Reflecting on past failures, she resolved not to repeat the same mistakes.",
      "notes": "To reflect/ruminate on past. Related: 곱씹다, 성찰하다."
    },
    {
      "korean": "탐구하다",
      "english": "to explore; to investigate; to inquire deeply into",
      "example": "이 책은 인간 본성의 어두운 면을 깊이 탐구한다.",
      "example_en": "This book deeply explores the dark side of human nature.",
      "notes": "To explore/investigate deeply. Academic context. Related: 연구하다, 조사하다."
    },
    {
      "korean": "사색하다",
      "english": "to contemplate; to meditate; to engage in deep thought",
      "example": "삶의 의미에 대해 홀로 사색하는 시간이 그에게는 꼭 필요했다.",
      "example_en": "He needed time alone to contemplate the meaning of life.",
      "notes": "To contemplate; meditate. Literary tone. Related: 명상하다, 생각에 잠기다."
    },
    {
      "korean": "변별하다",
      "english": "to discern; to distinguish; to differentiate",
      "example": "진실과 거짓을 변별하는 능력은 비판적 사고의 핵심이다.",
      "example_en": "The ability to discern truth from falsehood is at the core of critical thinking.",
      "notes": "To distinguish/differentiate. Formal. Related: 구분하다, 분별하다."
    },
    {
      "korean": "착안하다",
      "english": "to conceive an idea from; to be inspired by; to hit upon",
      "example": "자연 현상에서 착안하여 혁신적인 소재를 개발했다.",
      "example_en": "Inspired by natural phenomena, they developed an innovative material.",
      "notes": "To hit upon idea from inspiration. Related: 착각하다, 아이디어를 얻다."
    },
    {
      "korean": "응용하다",
      "english": "to apply (knowledge or theory); to put into practice",
      "example": "대학에서 배운 이론을 실무에 응용하는 것은 별개의 문제이다.",
      "example_en": "Applying theories learned in college to actual work is a separate matter entirely.",
      "notes": "To apply theory/knowledge practically. Related: 활용하다, 적용하다."
    },
    {
      "korean": "유추하다",
      "english": "to analogize; to infer by analogy; to extrapolate",
      "example": "과거 사례로부터 유추하면 이번에도 비슷한 결과가 나올 가능성이 높다.",
      "example_en": "Extrapolating from past cases, there is a high chance of a similar outcome this time.",
      "notes": "To analogize; extrapolate. Related: 추론하다, 예상하다."
    },
    {
      "korean": "사무치다",
      "english": "to pierce one's heart; to cut deep emotionally; to be heartrending",
      "example": "고향을 떠난 지 십 년이 지나자 그리움이 뼛속까지 사무쳤다.",
      "example_en": "After ten years away from home, longing pierced him to the bone.",
      "notes": "To pierce emotionally; cut deep. Poetic. Related: 애절하다, 마음이 아프다."
    },
    {
      "korean": "자책하다",
      "english": "to blame oneself; to reproach oneself; to feel guilty",
      "example": "친구를 도와주지 못한 자신을 끊임없이 자책했다.",
      "example_en": "He endlessly blamed himself for not being able to help his friend.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "분개하다",
      "english": "to be indignant; to be outraged; to burn with righteous anger",
      "example": "시민들은 권력자의 부정부패에 분개하여 거리로 나섰다.",
      "example_en": "Citizens, outraged by the corruption of those in power, took to the streets.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "상심하다",
      "english": "to be deeply hurt; to be heartbroken; to be crestfallen",
      "example": "오랜 연인과의 이별에 크게 상심하여 한동안 아무것도 할 수 없었다.",
      "example_en": "Deeply heartbroken by the breakup with his long-time partner, he couldn't do anything for a while.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "격앙되다",
      "english": "to become agitated; to get worked up; to be inflamed",
      "example": "토론이 진행될수록 양측의 감정이 격앙되어 고성이 오갔다.",
      "example_en": "As the debate progressed, emotions on both sides became inflamed and voices were raised.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "한탄하다",
      "english": "to lament; to deplore; to bemoan",
      "example": "세상이 각박해진 것을 한탄하며 옛 시절을 그리워했다.",
      "example_en": "He lamented how harsh the world had become and longed for the old days.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "경외하다",
      "english": "to revere; to stand in awe of; to hold in deep respect",
      "example": "그의 학문적 업적 앞에서 누구나 경외하지 않을 수 없었다.",
      "example_en": "No one could help but stand in awe before his academic achievements.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "매료되다",
      "english": "to be captivated; to be fascinated; to be utterly charmed",
      "example": "처음 한국에 왔을 때 전통 음악의 깊은 울림에 완전히 매료되었다.",
      "example_en": "When I first came to Korea, I was completely captivated by the deep resonance of traditional music.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "통곡하다",
      "english": "to wail; to cry out in grief; to weep bitterly",
      "example": "장례식장에서 유가족들이 통곡하는 소리가 끊이지 않았다.",
      "example_en": "The sound of the bereaved family wailing at the funeral hall never ceased.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "감격하다",
      "english": "to be deeply moved; to be overwhelmed with emotion",
      "example": "수십 년 만에 고향 땅을 밟자 감격하여 눈물이 쏟아졌다.",
      "example_en": "Upon setting foot on his homeland after decades, he was so deeply moved that tears poured down.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "관통하다",
      "english": "to penetrate; to pierce through; to run through",
      "example": "터널이 산맥을 관통하여 양쪽 도시의 이동 시간이 절반으로 줄었다.",
      "example_en": "The tunnel pierced through the mountain range, cutting travel time between the two cities in half.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "봉쇄하다",
      "english": "to blockade; to seal off; to lock down",
      "example": "경찰이 시위 현장 주변 도로를 전면 봉쇄했다.",
      "example_en": "Police completely sealed off the roads around the protest site.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "강탈하다",
      "english": "to seize by force; to plunder; to rob",
      "example": "식민 지배 세력은 현지인의 토지와 자원을 강탈했다.",
      "example_en": "The colonial rulers seized the locals' land and resources by force.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "질주하다",
      "english": "to sprint; to dash; to race at full speed",
      "example": "결승선을 향해 질주하는 선수의 표정에는 비장함이 서려 있었다.",
      "example_en": "The face of the athlete sprinting toward the finish line was filled with fierce determination.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "난무하다",
      "english": "to run rampant; to fly about in chaos; to swirl wildly",
      "example": "근거 없는 소문이 온라인에서 난무하여 사회적 혼란을 부추겼다.",
      "example_en": "Groundless rumors ran rampant online, fueling social chaos.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "유린하다",
      "english": "to trample on; to violate; to desecrate",
      "example": "독재 정권은 국민의 기본권을 조직적으로 유린했다.",
      "example_en": "The dictatorship systematically trampled on the people's fundamental rights.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "해부하다",
      "english": "to dissect; to anatomize; to analyze in fine detail",
      "example": "평론가는 그 영화의 서사 구조를 날카롭게 해부했다.",
      "example_en": "The critic sharply dissected the film's narrative structure.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "도약하다",
      "english": "to leap forward; to make a breakthrough; to take a big step",
      "example": "반도체 기술의 발전으로 한국 경제가 한 단계 더 도약했다.",
      "example_en": "Advances in semiconductor technology allowed the Korean economy to leap forward another level.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "소탕하다",
      "english": "to wipe out; to mop up; to eradicate",
      "example": "군 당국은 산악 지대에 은거하던 잔여 세력을 소탕했다.",
      "example_en": "Military authorities wiped out the remaining forces hiding in the mountainous region.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "천착하다",
      "english": "to delve deeply into; to dig into; to devote oneself to studying",
      "example": "그 학자는 평생 동아시아 고대사에 천착해 왔다.",
      "example_en": "That scholar has spent his entire life delving deeply into ancient East Asian history.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "회유하다",
      "english": "to appease; to win over; to conciliate",
      "example": "정부는 강경 대응 대신 반대 세력을 회유하는 전략을 택했다.",
      "example_en": "Instead of a hardline response, the government chose a strategy of appeasing the opposition.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "사주하다",
      "english": "to instigate; to put someone up to something; to abet",
      "example": "검찰은 배후에서 범행을 사주한 인물을 추적하고 있다.",
      "example_en": "The prosecution is tracking down the person who instigated the crime from behind the scenes.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "매도하다",
      "english": "to denounce; to condemn; to vilify",
      "example": "언론이 확인도 없이 그를 범죄자로 매도하는 것은 부당하다.",
      "example_en": "It is unjust for the media to denounce him as a criminal without verification.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "중재하다",
      "english": "to mediate; to arbitrate; to act as intermediary",
      "example": "양국 간의 분쟁을 중재하기 위해 유엔이 특사를 파견했다.",
      "example_en": "The UN dispatched a special envoy to mediate the dispute between the two countries.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "포섭하다",
      "english": "to co-opt; to recruit to one's side; to bring into one's fold",
      "example": "야당은 무소속 의원들을 포섭하여 과반 의석을 확보하려 했다.",
      "example_en": "The opposition party tried to recruit independent lawmakers to secure a majority of seats.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "옹호하다",
      "english": "to advocate; to defend; to champion",
      "example": "그녀는 소수자의 권리를 옹호하는 데 앞장서 왔다.",
      "example_en": "She has been at the forefront of advocating for minority rights.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "참견하다",
      "english": "to meddle; to interfere; to butt in",
      "example": "남의 가정사에 함부로 참견하면 오히려 관계만 나빠진다.",
      "example_en": "If you carelessly meddle in someone else's family affairs, it only worsens the relationship.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "응대하다",
      "english": "to attend to; to deal with; to respond to (a person or situation)",
      "example": "고객의 불만에 성의 있게 응대하는 것이 서비스업의 기본이다.",
      "example_en": "Sincerely attending to customer complaints is the foundation of the service industry.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "순응하다",
      "english": "to conform; to comply; to adapt oneself to",
      "example": "변화하는 시대에 무조건 순응하기보다는 주체적으로 판단해야 한다.",
      "example_en": "Rather than blindly conforming to a changing era, one should make independent judgments.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "견제하다",
      "english": "to keep in check; to restrain; to counterbalance",
      "example": "삼권분립은 권력 기관이 서로를 견제하도록 설계된 제도이다.",
      "example_en": "The separation of powers is a system designed so that branches of government keep each other in check.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "통치하다",
      "english": "to govern; to rule; to reign over a territory or people",
      "example": "고대 왕조는 수백 년간 광대한 영토를 통치하며 독자적인 문화를 꽃피웠다.",
      "example_en": "The ancient dynasty governed a vast territory for centuries, cultivating its own unique culture.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "군림하다",
      "english": "to reign supreme; to lord over; to dominate unchallenged",
      "example": "그 기업은 20년 넘게 국내 시장에서 독보적으로 군림해 왔다.",
      "example_en": "That company has reigned supreme in the domestic market for over 20 years.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "집행하다",
      "english": "to execute; to enforce; to carry out (a law, order, or sentence)",
      "example": "법원의 판결이 내려졌지만 실제로 집행하기까지는 상당한 시간이 걸렸다.",
      "example_en": "The court's ruling was handed down, but it took considerable time to actually execute it.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "위임하다",
      "english": "to delegate; to entrust authority or responsibility to another",
      "example": "대표는 해외 출장 기간 동안 주요 업무를 부대표에게 위임했다.",
      "example_en": "The CEO delegated key responsibilities to the vice president during the overseas business trip.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "탄핵하다",
      "english": "to impeach; to formally charge a public official with misconduct",
      "example": "국회는 헌법 위반을 근거로 대통령을 탄핵하기로 의결했다.",
      "example_en": "The National Assembly voted to impeach the president on the grounds of constitutional violations.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "비준하다",
      "english": "to ratify; to formally approve a treaty or agreement",
      "example": "양국 정상은 무역 협정에 서명했으나 의회의 비준이 아직 남아 있다.",
      "example_en": "The leaders of both countries signed the trade agreement, but parliamentary ratification is still pending.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "선포하다",
      "english": "to proclaim; to declare officially and publicly",
      "example": "정부는 국가 비상사태를 선포하고 군 병력을 긴급 투입했다.",
      "example_en": "The government proclaimed a national state of emergency and urgently deployed military forces.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "징집하다",
      "english": "to conscript; to draft into military service",
      "example": "전시에는 평소 면제 대상이던 시민까지 징집하는 경우가 있었다.",
      "example_en": "During wartime, even citizens who were normally exempt were sometimes conscripted.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "관할하다",
      "english": "to have jurisdiction over; to administer; to be in charge of an area or matter",
      "example": "해당 사건은 서울중앙지방법원이 관할하는 것으로 결정되었다.",
      "example_en": "It was decided that the Seoul Central District Court would have jurisdiction over the case.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "통솔하다",
      "english": "to command; to lead and direct (troops, an organization)",
      "example": "장군은 수만 명의 병력을 통솔하며 전쟁을 승리로 이끌었다.",
      "example_en": "The general commanded tens of thousands of troops and led the war to victory.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "구상하다",
      "english": "to conceive; to envision; to plan out creatively",
      "example": "건축가는 도시의 역사적 맥락을 살린 새로운 문화 공간을 구상했다.",
      "example_en": "The architect conceived a new cultural space that preserved the city's historical context.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "빚어내다",
      "english": "to mold; to create; to give shape to (literally or figuratively)",
      "example": "도예가가 흙 한 덩이로 섬세한 찻잔을 빚어내는 과정은 그 자체로 예술이었다.",
      "example_en": "The process of the potter molding a delicate teacup from a lump of clay was art in itself.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "조율하다",
      "english": "to tune; to harmonize; to coordinate and adjust for balance",
      "example": "지휘자는 각 파트의 소리를 섬세하게 조율하여 완벽한 앙상블을 만들어 냈다.",
      "example_en": "The conductor delicately harmonized the sound of each section to create a perfect ensemble.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "묘사하다",
      "english": "to depict; to describe vividly; to portray in detail",
      "example": "그 소설은 전쟁의 참상을 적나라하게 묘사하여 독자들에게 깊은 충격을 주었다.",
      "example_en": "The novel vividly depicted the horrors of war, deeply shocking its readers.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "윤색하다",
      "english": "to embellish; to polish; to touch up writing or speech for refinement",
      "example": "작가는 초고를 여러 차례 윤색하여 문장의 결을 한층 다듬었다.",
      "example_en": "The writer embellished the draft multiple times, further refining the texture of the sentences.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "각색하다",
      "english": "to adapt (a story for a different medium); to dramatize",
      "example": "원작 소설을 영화로 각색하는 과정에서 일부 줄거리가 크게 변경되었다.",
      "example_en": "In the process of adapting the original novel into a film, some plot points were significantly changed.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "조각하다",
      "english": "to sculpt; to carve; to engrave a form from raw material",
      "example": "그는 대리석 원석에서 인체의 곡선을 정밀하게 조각해 냈다.",
      "example_en": "He precisely sculpted the curves of the human body from a raw block of marble.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "주조하다",
      "english": "to cast (metal); to mint; to forge into a mold",
      "example": "고려 시대에는 청동으로 대형 범종을 주조하는 기술이 매우 발달했다.",
      "example_en": "During the Goryeo Dynasty, the technique of casting large bronze temple bells was highly advanced.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "연출하다",
      "english": "to direct; to stage; to orchestrate (a performance or scene)",
      "example": "감독은 배우들의 미세한 표정 변화까지 세심하게 연출했다.",
      "example_en": "The director meticulously staged even the subtle changes in the actors' facial expressions.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "채색하다",
      "english": "to color in; to paint; to apply color to a surface or drawing",
      "example": "복원 전문가가 퇴색된 벽화를 원래의 색감으로 채색하는 작업을 시작했다.",
      "example_en": "The restoration specialist began the work of painting the faded mural back to its original colors.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "항거하다",
      "english": "to resist; to rise up against; to defy authority",
      "example": "시민들은 부당한 법령에 항거하여 대규모 시위를 벌였다.",
      "example_en": "Citizens staged massive protests in defiance of the unjust decree.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "격퇴하다",
      "english": "to repulse; to repel; to drive back (an enemy or attack)",
      "example": "수비대는 열세에도 불구하고 적군의 공격을 성공적으로 격퇴했다.",
      "example_en": "Despite being outnumbered, the garrison successfully repulsed the enemy's attack.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "교전하다",
      "english": "to engage in battle; to exchange fire; to fight in combat",
      "example": "국경 지대에서 양측 군대가 수 시간에 걸쳐 교전한 것으로 알려졌다.",
      "example_en": "It was reported that troops from both sides engaged in battle for several hours in the border area.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "선동하다",
      "english": "to agitate; to incite; to stir up a crowd toward action",
      "example": "극단주의 지도자가 대중을 선동하여 폭력 사태를 야기했다.",
      "example_en": "The extremist leader incited the public, causing a violent incident.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "압도하다",
      "english": "to overwhelm; to overpower; to dominate completely",
      "example": "신인 선수가 경험 많은 상대를 압도하며 결승에 진출했다.",
      "example_en": "The rookie overwhelmed the experienced opponent and advanced to the finals.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "교란하다",
      "english": "to disrupt; to throw into confusion; to disturb the order of",
      "example": "적군은 전파 교란 작전으로 아군의 통신망을 교란하려 했다.",
      "example_en": "The enemy tried to disrupt our communication network through a signal-jamming operation.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "반박하다",
      "english": "to refute; to rebut; to counter an argument with evidence",
      "example": "피고 측 변호사가 검찰의 주장을 조목조목 반박하여 재판의 흐름이 바뀌었다.",
      "example_en": "The defense attorney rebutted the prosecution's claims point by point, shifting the course of the trial.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "농단하다",
      "english": "to monopolize and manipulate (power); to abuse authority behind the scenes",
      "example": "측근들이 국정을 농단한 사실이 밝혀지면서 정권이 흔들렸다.",
      "example_en": "When it was revealed that close aides had manipulated state affairs, the regime was shaken.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "도발하다",
      "english": "to provoke; to make a deliberate provocation",
      "example": "상대 팀이 노골적으로 도발했지만 그는 냉정하게 경기에 집중했다.",
      "example_en": "Although the opposing team openly provoked him, he stayed calm and focused on the game.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "제압하다",
      "english": "to subdue; to suppress; to bring under control by force",
      "example": "경찰 특공대가 인질범을 신속하게 제압하여 인질 전원을 구출했다.",
      "example_en": "The police special forces swiftly subdued the hostage-taker and rescued all the hostages.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "쇄신하다",
      "english": "to reform; to overhaul; to renovate a system or organization",
      "example": "새 경영진은 낡은 조직 문화를 쇄신하겠다고 취임 일성을 밝혔다.",
      "example_en": "The new management declared overhauling the outdated organizational culture as their first order of business.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "변모하다",
      "english": "to transform; to undergo a metamorphosis; to change in form or character",
      "example": "한때 황폐했던 항구 도시가 관광 명소로 완전히 변모했다.",
      "example_en": "The once-desolate port city completely transformed into a tourist attraction.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "퇴화하다",
      "english": "to degenerate; to devolve; to atrophy from disuse",
      "example": "동굴 속에서 오래 살아온 어류는 시력이 퇴화하여 눈이 거의 없다.",
      "example_en": "Fish that have lived in caves for a long time have degenerated eyesight, with almost no visible eyes.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "숙성하다",
      "english": "to mature; to ripen; to age or ferment over time",
      "example": "된장은 최소 일 년 이상 숙성해야 깊은 맛이 난다.",
      "example_en": "Doenjang needs to be aged for at least a year to develop a deep flavor.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "증폭하다",
      "english": "to amplify; to intensify; to magnify in scale or degree",
      "example": "소셜 미디어가 작은 논란을 순식간에 증폭하여 사회적 이슈로 만들었다.",
      "example_en": "Social media amplified a minor controversy into a social issue in an instant.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "정제하다",
      "english": "to refine; to purify; to remove impurities from",
      "example": "원유를 정제하는 과정에서 다양한 석유 화학 제품이 생산된다.",
      "example_en": "Various petrochemical products are produced in the process of refining crude oil.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "침식하다",
      "english": "to erode; to eat away at gradually",
      "example": "거짓 정보의 범람이 민주주의의 토대를 서서히 침식하고 있다.",
      "example_en": "The flood of false information is gradually eroding the foundations of democracy.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "응축하다",
      "english": "to condense; to concentrate; to compress into a dense essence",
      "example": "시인은 복잡한 감정을 짧은 한 행에 응축하는 데 천재적이었다.",
      "example_en": "The poet was a genius at condensing complex emotions into a single short line.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "발효하다",
      "english": "to ferment; to take effect (of a law or agreement coming into force)",
      "example": "김치는 적정 온도에서 천천히 발효해야 제맛이 나고, 조약도 양국이 비준해야 발효한다.",
      "example_en": "Kimchi must ferment slowly at the right temperature for proper flavor, and a treaty takes effect only when both countries ratify it.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "소멸하다",
      "english": "to be extinguished; to vanish; to expire or cease to exist",
      "example": "공소시효가 소멸하면 아무리 명백한 증거가 있어도 기소할 수 없다.",
      "example_en": "Once the statute of limitations expires, prosecution is impossible no matter how clear the evidence.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "공소하다",
      "english": "to prosecute; to file a public indictment",
      "example": "검찰이 피의자를 사기 혐의로 공소했다.",
      "example_en": "The prosecution filed an indictment against the suspect on fraud charges.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "구인하다",
      "english": "to issue a warrant for arrest; to apprehend",
      "example": "법원이 도주한 피의자에 대해 구인장을 발부했다.",
      "example_en": "The court issued a warrant to apprehend the suspect who fled.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "기탁하다",
      "english": "to deposit/entrust (officially); to donate in trust",
      "example": "기부금을 적십자사에 기탁했다.",
      "example_en": "The donation was entrusted to the Red Cross.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "갱신하다",
      "english": "to renew (a contract, license, record)",
      "example": "계약 만료 전에 반드시 갱신해야 한다.",
      "example_en": "You must renew before the contract expires.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "송달하다",
      "english": "to serve (legal documents officially)",
      "example": "소장이 피고에게 정식으로 송달되었다.",
      "example_en": "The complaint was officially served to the defendant.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "추인하다",
      "english": "to ratify retroactively; to give subsequent approval",
      "example": "무권대리 행위를 본인이 추인하면 유효하다.",
      "example_en": "If the principal ratifies an unauthorized agent's act, it becomes valid.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "위촉하다",
      "english": "to appoint/commission (an expert, advisor)",
      "example": "외부 전문가를 자문위원으로 위촉했다.",
      "example_en": "An outside expert was commissioned as an advisory member.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "고시하다",
      "english": "to publicly announce/notify (by official gazette)",
      "example": "정부가 새로운 토지 가격을 고시했다.",
      "example_en": "The government publicly announced the new land prices.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "각하하다",
      "english": "to dismiss (a case, petition) without ruling on merits",
      "example": "법원은 형식 요건 미비를 이유로 소를 각하했다.",
      "example_en": "The court dismissed the case due to failure to meet formal requirements.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "소환하다",
      "english": "to summon (to court or investigation)",
      "example": "검찰이 핵심 참고인을 소환했다.",
      "example_en": "The prosecution summoned the key witness.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "처치하다",
      "english": "to treat/administer medical care; to perform a procedure",
      "example": "응급실에서 신속하게 처치를 받았다.",
      "example_en": "Emergency treatment was administered quickly.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "절제하다",
      "english": "to excise/remove surgically (a tumor, organ)",
      "example": "종양을 완전히 절제하는 데 성공했다.",
      "example_en": "The tumor was successfully excised completely.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "투여하다",
      "english": "to administer (medication, dosage)",
      "example": "환자에게 항생제를 정맥으로 투여했다.",
      "example_en": "Antibiotics were administered to the patient intravenously.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "봉합하다",
      "english": "to suture; to stitch up (a wound)",
      "example": "의사가 열상 부위를 깨끗하게 봉합했다.",
      "example_en": "The doctor cleanly sutured the laceration.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "진찰하다",
      "english": "to examine (a patient medically)",
      "example": "의사가 환자의 상태를 면밀히 진찰했다.",
      "example_en": "The doctor thoroughly examined the patient's condition.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "소독하다",
      "english": "to disinfect/sterilize",
      "example": "상처 부위를 깨끗이 소독한 후 붕대를 감았다.",
      "example_en": "The wound was thoroughly disinfected before wrapping it with a bandage.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "마비되다",
      "english": "to become paralyzed/numb",
      "example": "신경 손상으로 하반신이 마비되었다.",
      "example_en": "The lower body became paralyzed due to nerve damage.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "재발하다",
      "english": "to relapse; to recur (disease)",
      "example": "완치된 줄 알았던 암이 재발했다.",
      "example_en": "The cancer that was thought to be cured has recurred.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "호전되다",
      "english": "to improve/get better (medical condition)",
      "example": "치료 후 환자의 상태가 눈에 띄게 호전되었다.",
      "example_en": "After treatment, the patient's condition improved noticeably.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "의뢰하다",
      "english": "to refer (a patient to a specialist); to request (a medical opinion)",
      "example": "주치의가 정밀 검사를 위해 대학병원에 의뢰했다.",
      "example_en": "The primary doctor referred the case to a university hospital for detailed testing.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "갈구하다",
      "english": "to crave; to yearn desperately for",
      "example": "인정을 갈구하는 마음이 그를 지치게 했다.",
      "example_en": "The desperate yearning for recognition exhausted him.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "매몰되다",
      "english": "to be consumed by; to be buried in (figuratively)",
      "example": "일에 매몰되어 가족과의 시간을 잃었다.",
      "example_en": "Consumed by work, I lost time with my family.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "전율하다",
      "english": "to shudder/tremble (from fear, awe, or excitement)",
      "example": "그 연주를 듣는 순간 온몸이 전율했다.",
      "example_en": "The moment I heard the performance, my whole body trembled.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "체감하다",
      "english": "to feel/perceive firsthand; to sense viscerally",
      "example": "외국에서 살아 보니 문화 차이를 체감했다.",
      "example_en": "Living abroad, I perceived the cultural differences firsthand.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "처연하다",
      "english": "to feel desolate and sad; to be forlorn",
      "example": "빈 집을 바라보니 처연한 마음이 들었다.",
      "example_en": "Looking at the empty house, I felt desolate and sad.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "회의하다",
      "english": "to doubt; to feel skepticism toward",
      "example": "반복되는 실패에 자신의 능력을 회의하게 되었다.",
      "example_en": "Repeated failures made me doubt my own abilities.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "미혹되다",
      "english": "to be beguiled/misled; to be led astray",
      "example": "달콤한 말에 미혹되어 잘못된 선택을 했다.",
      "example_en": "Beguiled by sweet words, I made the wrong choice.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "노여워하다",
      "english": "to be angry/wrathful; to feel indignation",
      "example": "부당한 대우에 그는 크게 노여워했다.",
      "example_en": "He was greatly angered by the unfair treatment.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "여미다",
      "english": "to collect/compose oneself (emotionally); to straighten (clothing, composure)",
      "example": "흐트러진 마음을 여미고 다시 출발했다.",
      "example_en": "I composed my scattered feelings and set off again.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "연모하다",
      "english": "to be lovesick for; to yearn for romantically",
      "example": "오랫동안 마음속으로 그를 연모해 왔다.",
      "example_en": "For a long time, I had been yearning for him in my heart.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "메마르다",
      "english": "to dry up; to become parched/barren",
      "example": "장기간 가뭄으로 저수지가 메말랐다.",
      "example_en": "The reservoir dried up due to the prolonged drought.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "범람하다",
      "english": "to overflow; to flood (river, information)",
      "example": "폭우로 하천이 범람하여 마을이 침수되었다.",
      "example_en": "The river overflowed due to heavy rain, and the village was flooded.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "서식하다",
      "english": "to inhabit; to live in (a habitat)",
      "example": "이 습지에는 희귀한 조류가 서식하고 있다.",
      "example_en": "Rare birds inhabit this wetland.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "풍화되다",
      "english": "to weather; to erode (by natural elements)",
      "example": "오랜 세월에 걸쳐 바위가 풍화되어 모래가 되었다.",
      "example_en": "Over long years, the rocks weathered and became sand.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "번식하다",
      "english": "to breed; to propagate/reproduce",
      "example": "따뜻한 기후 덕분에 해충이 빠르게 번식했다.",
      "example_en": "Thanks to the warm climate, the pests bred rapidly.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "고사하다",
      "english": "to wither and die (plants, trees)",
      "example": "산성비의 영향으로 숲의 나무들이 고사하고 있다.",
      "example_en": "Trees in the forest are withering and dying due to the effects of acid rain.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "퇴적되다",
      "english": "to be deposited/sedimented (geological process)",
      "example": "수만 년에 걸쳐 퇴적된 지층이 발견되었다.",
      "example_en": "Geological strata deposited over tens of thousands of years were discovered.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "용솟음치다",
      "english": "to gush/surge upward (water, lava, energy)",
      "example": "지열 에너지가 땅속에서 용솟음쳤다.",
      "example_en": "Geothermal energy surged up from underground.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "표류하다",
      "english": "to drift (on water/current)",
      "example": "해류를 따라 쓰레기가 수천 킬로미터를 표류했다.",
      "example_en": "Trash drifted thousands of kilometers along the ocean current.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "동면하다",
      "english": "to hibernate",
      "example": "곰은 겨울이 되면 굴속에서 동면한다.",
      "example_en": "Bears hibernate in their dens when winter comes.",
      "notes": "Related concepts and usage variations in natural Korean."
    }
  ]
}