{
  "고급 형용사 (Advanced Adjectives)": [
    {
      "korean": "까칠하다",
      "english": "prickly, irritable; describes someone whose demeanor is rough and easily annoyed",
      "example": "그 사람이 까칠해 보여도 알고 보면 속은 따뜻해요.",
      "example_en": "He may look prickly, but once you get to know him, he's warm inside.",
      "notes": "Prickly/irritable personality. Informal but expressive. Related: 까칠까칠하다, 까칠대다."
    },
    {
      "korean": "다소곳하다",
      "english": "demure, gentle and reserved; quietly modest in manner",
      "example": "그녀는 다소곳한 태도로 인사를 건넸다.",
      "example_en": "She greeted them in a demure and gentle manner.",
      "notes": "Demure; gently reserved. Literary/formal. Related: 조용하다, 순종적이다."
    },
    {
      "korean": "도도하다",
      "english": "aloof, proudly elegant; carries oneself with cool self-assurance",
      "example": "그녀는 도도한 분위기를 풍기지만 친해지면 정이 많다.",
      "example_en": "She gives off an aloof vibe, but she's very affectionate once you get close.",
      "notes": "Aloof; proudly elegant. Related: 거만하다, 고고하다."
    },
    {
      "korean": "싹싹하다",
      "english": "friendly and sociable; pleasant and accommodating in social situations",
      "example": "새로 온 동료가 싹싹해서 금방 팀에 녹아들었다.",
      "example_en": "The new colleague was so friendly that they quickly blended into the team.",
      "notes": "Friendly; sociable and accommodating. Related: 다정하다, 친절하다."
    },
    {
      "korean": "점잖다",
      "english": "dignified, composed; behaving with calm propriety befitting one's status or age",
      "example": "아버지는 항상 점잖은 말투로 조언을 해주셨다.",
      "example_en": "My father always gave advice in a dignified tone.",
      "notes": "Dignified; composed propriety. Formal register. Related: 고상하다, 정중하다."
    },
    {
      "korean": "치사하다",
      "english": "petty, cheap; describes behavior that is beneath one's dignity or meanly calculating",
      "example": "몇 백 원 가지고 따지다니 너무 치사하지 않아?",
      "example_en": "Isn't it too petty to argue over a few hundred won?",
      "notes": "Petty; meanly calculating. Related: 야박하다, 좁은 마음."
    },
    {
      "korean": "너그럽다",
      "english": "magnanimous, broad-minded; generously forgiving of others' faults",
      "example": "그분은 실수에 대해 항상 너그럽게 넘어가 주신다.",
      "example_en": "That person always magnanimously lets mistakes slide.",
      "notes": "Magnanimous; generously forgiving. Related: 관대하다, 포용적이다."
    },
    {
      "korean": "우직하다",
      "english": "stubbornly sincere, doggedly honest; straightforward to the point of seeming simple",
      "example": "그는 우직한 성격 덕분에 주변 사람들의 신뢰를 얻었다.",
      "example_en": "His stubbornly sincere character earned the trust of those around him.",
      "notes": "Stubbornly sincere; straightforward. Related: 성실하다, 직선적이다."
    },
    {
      "korean": "진중하다",
      "english": "serious and composed; thoughtfully deliberate, not rash",
      "example": "중요한 결정일수록 진중한 태도가 필요하다.",
      "example_en": "The more important the decision, the more a composed and deliberate attitude is needed.",
      "notes": "Serious/composed; thoughtfully deliberate. Related: 무거운, 심각한."
    },
    {
      "korean": "교활하다",
      "english": "cunning, sly; deceptively clever in a manipulative way",
      "example": "그 정치인은 교활한 수법으로 여론을 자기편으로 돌렸다.",
      "example_en": "The politician used cunning tactics to sway public opinion in his favor.",
      "notes": "Cunning; slyly manipulative. Related: 간사하다, 이중적이다."
    },
    {
      "korean": "을씨년스럽다",
      "english": "dreary, bleak; describes a scene or atmosphere that feels desolately cold and gloomy",
      "example": "가을비가 내리니 거리가 을씨년스러워졌다.",
      "example_en": "With the autumn rain falling, the streets became dreary and bleak.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "음산하다",
      "english": "eerie, gloomy; giving off a dark, unsettling atmosphere",
      "example": "안개가 자욱한 산길이 음산한 느낌을 줬다.",
      "example_en": "The fog-shrouded mountain path gave off an eerie feeling.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "화기애애하다",
      "english": "warm and harmonious; describes a pleasantly friendly and peaceful atmosphere",
      "example": "명절에 온 가족이 모여 화기애애한 분위기 속에서 식사를 했다.",
      "example_en": "During the holiday, the whole family gathered and ate in a warm, harmonious atmosphere.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "삭막하다",
      "english": "desolate, barren; lacking warmth or vitality, emotionally or physically bleak",
      "example": "고층 빌딩만 가득한 도심이 삭막하게 느껴졌다.",
      "example_en": "The downtown area, filled only with high-rises, felt desolate.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "어수선하다",
      "english": "chaotic, disorderly; describes a scene or situation that is messy and unsettled",
      "example": "사건 직후 사무실 분위기가 매우 어수선했다.",
      "example_en": "The office atmosphere was very chaotic right after the incident.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "적막하다",
      "english": "silent and desolate; an almost oppressive quietness with no signs of life",
      "example": "새벽 두 시, 도시 전체가 적막한 정적에 잠겨 있었다.",
      "example_en": "At two in the morning, the entire city was submerged in desolate silence.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "스산하다",
      "english": "chilly and bleak; a cold, forlorn atmosphere that makes one uneasy",
      "example": "겨울바람이 불어 폐공장 주변이 스산한 분위기였다.",
      "example_en": "The winter wind blew, creating a chilly, bleak atmosphere around the abandoned factory.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "흉흉하다",
      "english": "unsettling, ominous; describes a tense social atmosphere full of anxiety or rumors",
      "example": "연쇄 사건 이후 동네 분위기가 흉흉해졌다.",
      "example_en": "After the string of incidents, the neighborhood atmosphere became unsettling.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "번잡하다",
      "english": "bustling, crowded and noisy; hectic with too many people or things going on",
      "example": "명동 거리는 주말마다 관광객으로 번잡하다.",
      "example_en": "Myeongdong streets are bustling with tourists every weekend.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "훈훈하다",
      "english": "heartwarming; also literally warm and cozy, used for feel-good stories or atmospheres",
      "example": "낯선 사람이 할머니의 짐을 들어주는 훈훈한 장면이 화제가 됐다.",
      "example_en": "The heartwarming scene of a stranger carrying the elderly woman's bags became a hot topic.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "탁월하다",
      "english": "outstanding, excellent; far surpassing others in ability or quality",
      "example": "그 연구원은 탁월한 분석력으로 문제의 원인을 짚어냈다.",
      "example_en": "The researcher pinpointed the cause of the problem with outstanding analytical skills.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "미흡하다",
      "english": "insufficient, inadequate; falling short of what is needed or expected",
      "example": "이번 대응은 국민의 기대에 미흡했다는 평가를 받았다.",
      "example_en": "This response was evaluated as falling short of public expectations.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "출중하다",
      "english": "distinguished, exceptional; standing out noticeably above the rest",
      "example": "출중한 외모와 실력을 겸비한 배우가 주목받고 있다.",
      "example_en": "An actor who possesses both exceptional looks and skill is drawing attention.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "노골적이다",
      "english": "blatant, overt; shamelessly unconcealed, with no attempt to hide intentions",
      "example": "상대 팀의 노골적인 시간 끌기에 관중들이 야유를 보냈다.",
      "example_en": "The crowd booed the opposing team's blatant time-wasting.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "미비하다",
      "english": "incomplete, deficient; lacking necessary elements or preparation",
      "example": "법적 장치가 미비하여 피해자 보호가 제대로 이루어지지 않았다.",
      "example_en": "Due to deficient legal safeguards, victim protection was not properly carried out.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "치졸하다",
      "english": "crude, clumsy; lacking sophistication, especially in schemes or execution",
      "example": "치졸한 거짓말은 오히려 신뢰를 무너뜨릴 뿐이다.",
      "example_en": "Crude lies only end up destroying trust.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "방대하다",
      "english": "vast, enormous in scale; used for data, content, or scope that is immensely large",
      "example": "방대한 양의 자료를 분석하는 데 몇 달이 걸렸다.",
      "example_en": "It took several months to analyze the vast amount of data.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "조잡하다",
      "english": "crude, sloppy; poorly made or lacking refinement in quality",
      "example": "디자인이 조잡해서 소비자들의 외면을 받았다.",
      "example_en": "The design was so sloppy that consumers turned away from it.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "현저하다",
      "english": "remarkable, conspicuous; noticeably prominent, often used with differences or changes",
      "example": "두 집단 간 학업 성취도에 현저한 차이가 나타났다.",
      "example_en": "A conspicuous difference in academic achievement appeared between the two groups.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "어처구니없다",
      "english": "absurd, preposterous; so ridiculous that one is left speechless",
      "example": "어처구니없는 실수로 승진 기회를 날려 버렸다.",
      "example_en": "An absurd mistake cost him his chance at promotion.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "숭고하다",
      "english": "sublime, noble; exalted to the highest moral or spiritual level",
      "example": "자신을 희생하여 남을 구한 숭고한 행동에 모두 숙연해졌다.",
      "example_en": "Everyone was humbled by the sublime act of sacrificing oneself to save others.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "심오하다",
      "english": "profound, deep; intellectually deep and not easily grasped on the surface",
      "example": "그 철학자의 사상은 심오하여 한 번에 이해하기 어렵다.",
      "example_en": "That philosopher's ideas are so profound that they are hard to understand at once.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "오묘하다",
      "english": "subtle, mysteriously intricate; delicately complex in a way that defies easy explanation",
      "example": "자연의 오묘한 질서 앞에서 인간은 겸허해진다.",
      "example_en": "Before the mysteriously intricate order of nature, humans become humble.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "덧없다",
      "english": "fleeting, transient; passing quickly and leaving nothing behind",
      "example": "젊음이 이토록 덧없을 줄은 몰랐다.",
      "example_en": "I never knew youth could be this fleeting.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "무상하다",
      "english": "impermanent, transient; nothing in the world lasts — a Buddhist-tinged philosophical term",
      "example": "인생이 무상하다는 걸 깨달은 후 하루하루에 감사하게 됐다.",
      "example_en": "After realizing that life is impermanent, I became grateful for each day.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "자명하다",
      "english": "self-evident, obvious; so clear that no proof or explanation is needed",
      "example": "준비 없이 성공할 수 없다는 건 자명한 사실이다.",
      "example_en": "It is a self-evident fact that one cannot succeed without preparation.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "피상적이다",
      "english": "superficial; remaining on the surface without deeper understanding or engagement",
      "example": "피상적인 분석으로는 문제의 본질을 파악할 수 없다.",
      "example_en": "A superficial analysis cannot grasp the essence of the problem.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "근원적이다",
      "english": "fundamental, root-level; pertaining to the deepest origin or cause of something",
      "example": "사회 불평등의 근원적인 해결책을 모색해야 한다.",
      "example_en": "We must seek a fundamental solution to social inequality.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "필연적이다",
      "english": "inevitable, necessary; bound to happen as a logical or natural consequence",
      "example": "기술이 발전하면 산업 구조의 변화는 필연적이다.",
      "example_en": "As technology advances, changes in industrial structure are inevitable.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "모호하다",
      "english": "ambiguous, vague; unclear in meaning or boundaries, open to multiple interpretations",
      "example": "정부의 모호한 입장 때문에 국민들의 혼란이 가중되었다.",
      "example_en": "The government's ambiguous stance deepened public confusion.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "꿉꿉하다",
      "english": "musty, damp and stuffy; having a stale, humid quality that feels unpleasant",
      "example": "장마철이라 빨래가 마르지 않고 꿉꿉한 냄새가 난다.",
      "example_en": "The laundry won't dry during the rainy season and gives off a musty smell.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "텁텁하다",
      "english": "thick and stale; a heavy, unpleasant sensation in the mouth or air",
      "example": "라면을 먹고 나면 입안이 텁텁해서 물을 많이 마시게 된다.",
      "example_en": "After eating ramyeon, my mouth feels thick and stale, so I end up drinking a lot of water.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "칼칼하다",
      "english": "sharp and pungent; a biting spiciness or dryness that hits the throat",
      "example": "김치찌개가 칼칼해서 속이 다 풀리는 기분이다.",
      "example_en": "The kimchi stew is so sharply spicy that it feels like it clears everything up inside.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "까끌까끌하다",
      "english": "rough, scratchy; having a coarse texture that irritates when touched",
      "example": "새로 산 수건이 까끌까끌해서 피부에 자극이 심하다.",
      "example_en": "The newly bought towel is so scratchy that it really irritates the skin.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "얼얼하다",
      "english": "tingling, numb; a buzzing sensation from spice, cold, or impact",
      "example": "마라탕을 먹었더니 입이 얼얼해서 한동안 맛을 못 느꼈다.",
      "example_en": "After eating mala hotpot, my mouth was so numb that I couldn't taste anything for a while.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "비릿하다",
      "english": "having a raw, fishy smell; the metallic scent of blood or raw seafood",
      "example": "시장 골목에 들어서니 생선 비릿한 냄새가 코를 찔렀다.",
      "example_en": "As I entered the market alley, the raw fishy smell hit my nose.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "퀴퀴하다",
      "english": "musty, stale; having a stuffy old smell from being closed up too long",
      "example": "오래된 창고 문을 여니 퀴퀴한 냄새가 확 풍겼다.",
      "example_en": "When I opened the old warehouse door, a musty smell instantly wafted out.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "느끼하다",
      "english": "greasy, cloying; unpleasantly oily or rich, also used for cheesy or sleazy behavior",
      "example": "크림파스타가 너무 느끼해서 반밖에 못 먹었다.",
      "example_en": "The cream pasta was so greasy that I could only eat half.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "텁수룩하다",
      "english": "bushy, shaggy; thick and unkempt, typically describing facial hair or overgrown hair",
      "example": "수염이 텁수룩하게 자라서 면도를 해야겠다.",
      "example_en": "My beard has grown bushy and shaggy, so I should shave.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "찌릿하다",
      "english": "sharp tingling; a sudden, electric-like piercing sensation",
      "example": "팔꿈치를 부딪히자 팔 전체가 찌릿하게 저려 왔다.",
      "example_en": "When I bumped my elbow, a sharp tingling sensation ran through my whole arm.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "강직하다",
      "english": "upright, principled; rigidly honest and refusing to bend to pressure",
      "example": "강직한 성격 탓에 상사에게도 잘못된 건 잘못됐다고 말한다.",
      "example_en": "Because of his upright character, he tells even his superiors when something is wrong.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "비겁하다",
      "english": "cowardly, underhanded; lacking courage or resorting to dishonorable means",
      "example": "책임을 남에게 떠넘기는 건 비겁한 행동이다.",
      "example_en": "Shifting responsibility onto others is a cowardly act.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "염치없다",
      "english": "shameless, lacking decency; having no sense of propriety or embarrassment",
      "example": "이렇게 자주 부탁드리기 염치없지만 한 번만 더 도와주세요.",
      "example_en": "I know it's shameless to ask so often, but please help me just one more time.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "고결하다",
      "english": "noble, lofty; morally pure and elevated in character",
      "example": "그의 고결한 인격은 주변 사람들에게 깊은 감화를 주었다.",
      "example_en": "His noble character deeply inspired those around him.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "비열하다",
      "english": "despicable, vile; morally low and contemptible in behavior",
      "example": "약자를 이용하는 비열한 수법에 분노가 치밀었다.",
      "example_en": "Anger surged at the despicable tactics of exploiting the weak.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "결백하다",
      "english": "innocent, guiltless; free from wrongdoing or crime",
      "example": "그는 끝까지 자신의 결백함을 주장하며 재심을 요청했다.",
      "example_en": "He maintained his innocence to the end and requested a retrial.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "올곧다",
      "english": "upright, morally straight; adhering firmly to principles without wavering",
      "example": "올곧은 신념을 가진 사람은 어떤 유혹에도 흔들리지 않는다.",
      "example_en": "A person with upright convictions is not swayed by any temptation.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "간사하다",
      "english": "treacherous, two-faced; outwardly friendly but harboring deceitful intentions",
      "example": "겉으로는 웃으면서 뒤에서 험담하는 간사한 사람을 조심해야 한다.",
      "example_en": "You have to watch out for treacherous people who smile to your face but gossip behind your back.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "후덕하다",
      "english": "virtuous and generous; warm-hearted with a broad generosity of spirit",
      "example": "후덕한 인상 덕분에 처음 만난 사람도 금방 마음을 연다.",
      "example_en": "Thanks to her virtuous and generous demeanor, even people meeting her for the first time quickly open up.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "뻔뻔하다",
      "english": "brazen, shameless; showing no embarrassment despite wrongdoing",
      "example": "잘못을 하고도 사과 한마디 없이 뻔뻔하게 구는 게 이해가 안 된다.",
      "example_en": "I can't understand how someone can act so brazenly without even a word of apology after doing something wrong.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "까다롭다",
      "english": "exacting, picky; difficult to satisfy or requiring meticulous attention to detail",
      "example": "이 교수님은 과제 기준이 까다로워서 학생들이 긴장한다.",
      "example_en": "Students are nervous because this professor's assignment criteria are exacting.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "난해하다",
      "english": "abstruse, incomprehensible; so complex and deep that it is extremely hard to understand",
      "example": "그 소설은 구조가 난해해서 두 번을 읽고서야 이해했다.",
      "example_en": "The novel's structure was so abstruse that I understood it only after reading it twice.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "복잡다단하다",
      "english": "complex and multifaceted; involving many intertwined layers of difficulty",
      "example": "한반도의 정세는 복잡다단해서 한마디로 설명할 수 없다.",
      "example_en": "The situation on the Korean Peninsula is complex and multifaceted, impossible to explain in a single sentence.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "수월하다",
      "english": "easy, smooth; proceeding without much difficulty or effort",
      "example": "경험이 있으니 이번에는 한결 수월하게 진행할 수 있었다.",
      "example_en": "Since I had experience, I was able to proceed much more smoothly this time.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "만만하다",
      "english": "easy-looking, not to be underestimated; appears simple but is deceptively challenging",
      "example": "상대를 만만하게 봤다가 크게 당한 적이 있다.",
      "example_en": "I once underestimated my opponent and paid dearly for it.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "정교하다",
      "english": "elaborate, exquisite; crafted with meticulous precision and fine detail",
      "example": "장인의 손에서 탄생한 정교한 도자기에 감탄이 절로 나왔다.",
      "example_en": "The elaborate ceramics born from the artisan's hands drew spontaneous admiration.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "자질구레하다",
      "english": "trivial, petty; consisting of many small, unimportant details piled up",
      "example": "자질구레한 업무에 시간을 빼앗기다 보니 정작 중요한 일을 못 했다.",
      "example_en": "I spent so much time on trivial tasks that I couldn't get to the actually important work.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "허술하다",
      "english": "sloppy, full of holes; lacking thoroughness and easy to find fault with",
      "example": "보안이 허술해서 개인정보가 대량으로 유출되었다.",
      "example_en": "Security was so sloppy that personal information was leaked on a massive scale.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "촘촘하다",
      "english": "tightly woven, dense; with very small gaps, leaving no room for error or escape",
      "example": "법망이 촘촘해야 범죄를 사전에 예방할 수 있다.",
      "example_en": "The legal net must be tightly woven to prevent crime in advance.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "번거롭다",
      "english": "cumbersome, troublesome; involving tedious and complicated procedures",
      "example": "서류 절차가 너무 번거로워서 온라인 신청으로 바꿨으면 좋겠다.",
      "example_en": "The paperwork process is so cumbersome that I wish they'd switch to online applications.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "서먹서먹하다",
      "english": "awkward, stiff; the uncomfortable distance between people who are not yet close",
      "example": "오랜만에 만난 친구 사이가 서먹서먹해서 어색한 침묵이 흘렀다.",
      "example_en": "Meeting after a long time, things were awkward between us and an uneasy silence filled the air.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "소원하다",
      "english": "estranged, distant; having grown apart in a relationship that was once close",
      "example": "한때 절친이었지만 연락을 안 하다 보니 사이가 소원해졌다.",
      "example_en": "We were once best friends, but not keeping in touch made us grow distant.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "각별하다",
      "english": "special, extraordinarily close; a bond that stands out from ordinary relationships",
      "example": "할머니와 각별한 사이였기에 그 상실감이 더 컸다.",
      "example_en": "Because I had an extraordinarily close bond with my grandmother, the sense of loss was even greater.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "돈독하다",
      "english": "close, solid; describing a strong, reliable relationship built on trust",
      "example": "어려운 시기를 함께 겪으면서 두 사람의 우정은 더욱 돈독해졌다.",
      "example_en": "Going through tough times together made their friendship even stronger and more solid.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "원만하다",
      "english": "amicable, smooth; harmonious without friction or conflict",
      "example": "부부 사이가 원만하려면 서로의 공간을 존중해야 한다.",
      "example_en": "For a marriage to be amicable, both sides need to respect each other's space.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "냉담하다",
      "english": "cold, indifferent; showing a lack of interest or emotional warmth toward others",
      "example": "인사를 건넸는데 냉담한 반응이 돌아와서 당황스러웠다.",
      "example_en": "I greeted them, but the cold, indifferent response left me flustered.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "야박하다",
      "english": "heartless, stingy; lacking generosity or kindness in interpersonal dealings",
      "example": "오래 일한 직원에게 아무런 보상도 없이 내보내다니 너무 야박하다.",
      "example_en": "It's so heartless to let go of a long-serving employee without any compensation.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "다정다감하다",
      "english": "tender and sensitive; naturally affectionate and easily moved emotionally",
      "example": "다정다감한 성격이라 남의 사정에도 쉽게 눈물을 흘린다.",
      "example_en": "Being naturally tender and sensitive, she easily sheds tears at others' circumstances.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "살갑다",
      "english": "warm, affectionate; showing personal warmth and closeness in a touching way",
      "example": "오랫만에 만난 이모가 살갑게 안아주셔서 마음이 따뜻해졌다.",
      "example_en": "My aunt, whom I hadn't seen in a long time, hugged me warmly, and it warmed my heart.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "무뚝뚝하다",
      "english": "blunt, curt; not very expressive and seemingly unfriendly in manner",
      "example": "아버지는 무뚝뚝하지만 행동으로 사랑을 표현하시는 분이다.",
      "example_en": "My father is blunt and curt, but he's someone who expresses love through actions.",
      "notes": "Related concepts and usage variations in natural Korean."
    }
  ]
}