{
  "구어체 (Colloquial)": [
    {
      "korean": "헐",
      "english": "Expression of shock or disbelief, like 'whoa' or 'oh my god.' Used when something unexpected or absurd happens.",
      "example": "헐, 걔가 회사 그만뒀다고? 입사한 지 일주일밖에 안 됐잖아.",
      "example_en": "Whoa, he quit the company? It's only been a week since he started.",
      "notes": "Shock/disbelief exclamation. Younger generation, casual. Related: 정말?, 진짜?."
    },
    {
      "korean": "아이고",
      "english": "Versatile exclamation expressing frustration, exhaustion, sympathy, or mild pain. Used across all ages and situations.",
      "example": "아이고, 허리야. 하루 종일 앉아 있었더니 온몸이 쑤셔.",
      "example_en": "Oh my, my back. I've been sitting all day and my whole body aches.",
      "notes": "Versatile exclamation for frustration/pain/sympathy. Cross-generational. Related: 아이고머니, 아유."
    },
    {
      "korean": "어머",
      "english": "Exclamation of surprise (slightly feminine). Used for unexpected discoveries or mild shock.",
      "example": "어머, 이게 누구야! 여기서 만날 줄이야.",
      "example_en": "Oh my, who is this! I never expected to run into you here.",
      "notes": "Surprise (slightly feminine). Related: 어머나, 오마이갓."
    },
    {
      "korean": "세상에",
      "english": "'Good heavens' or 'oh my goodness.' Expresses strong surprise or disbelief at something remarkable.",
      "example": "세상에, 십 년 만에 연락이 오다니. 너무 반갑다.",
      "example_en": "Good heavens, getting a call after ten years. I'm so glad to hear from you.",
      "notes": "Strong surprise. Related: 세상에 다신, 천만의 말씀."
    },
    {
      "korean": "말도 안 돼",
      "english": "'That's absurd' or 'no way.' Used when something seems impossible or unbelievable.",
      "example": "그 식당 웨이팅이 세 시간이래. 말도 안 돼, 그냥 다른 데 가자.",
      "example_en": "They say the wait at that restaurant is three hours. That's absurd, let's just go somewhere else.",
      "notes": "Expressing absurdity. Related: 그럴 리가, 웬일이야."
    },
    {
      "korean": "웬일이야",
      "english": "'What brings you here?' or 'what a rare occasion.' Used when someone does something unexpected or out of character.",
      "example": "네가 아침에 일찍 일어나다니, 웬일이야? 무슨 일 있어?",
      "example_en": "You're up early in the morning — what's the occasion? Is something going on?",
      "notes": "Asking what's the occasion. Related: 뭐 하는 거야?, 왜 그래?"
    },
    {
      "korean": "그럴 리가",
      "english": "'That can't be' or 'no way.' Expresses disbelief or denial that something is true.",
      "example": "시험에 떨어졌다고? 그럴 리가. 네가 얼마나 열심히 했는데.",
      "example_en": "You failed the exam? That can't be. You worked so hard for it.",
      "notes": "Disbelief. Related: 말도 안 돼, 있을 수 없지."
    },
    {
      "korean": "어쩜 이렇게",
      "english": "'How can it be like this?' Expresses admiration, surprise, or sometimes frustration at an extreme quality.",
      "example": "어쩜 이렇게 맛있지? 이 집 비빔밥은 진짜 예술이다.",
      "example_en": "How can it be this good? The bibimbap here is truly a work of art.",
      "notes": "Expressing amazement. Related: 어떻게 이럴 수 있어, 정말 대단해."
    },
    {
      "korean": "뭐야 이게",
      "english": "'What is this?' Reaction of confusion, disgust, or disbelief at something right in front of you.",
      "example": "뭐야 이게, 택배가 완전히 찌그러져서 왔네. 항의해야겠다.",
      "example_en": "What is this — the package arrived completely crushed. I need to file a complaint.",
      "notes": "Confusion/disgust. Related: 이게 뭐 하는 거야?, 이건 너무해."
    },
    {
      "korean": "어이가 없다",
      "english": "'I'm dumbfounded' or 'I can't believe this.' Stronger than simple surprise; implies the situation is absurd or outrageous.",
      "example": "내가 줄 서 있었는데 새치기를 하더라. 진짜 어이가 없어서 말이 안 나왔어.",
      "example_en": "I was standing in line and someone cut in front of me. I was so dumbfounded I couldn't even speak.",
      "notes": "Dumbfounded. Related: 황당하다, 코웃음이 나오다."
    },
    {
      "korean": "좀 그렇다",
      "english": "Euphemistic way to say something is uncomfortable, awkward, or not great. Used to soften refusals or negative opinions.",
      "example": "그 날 약속은 좀 그런데, 다른 날은 안 될까?",
      "example_en": "That day is a bit difficult for me — would another day work?",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "글쎄요",
      "english": "'Hmm, well...' or 'I'm not so sure.' Non-committal response when you don't want to give a definite answer.",
      "example": "\"이번 프로젝트 성공할 수 있을까요?\" \"글쎄요, 아직 변수가 많아서 뭐라 말하기 어렵네요.\"",
      "example_en": "\"Do you think this project can succeed?\" \"Well... there are still a lot of variables, so it's hard to say.\"",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "그렇긴 한데",
      "english": "'That's true, but...' Acknowledges someone's point while signaling disagreement or a reservation is coming.",
      "example": "그렇긴 한데, 현실적으로 그게 가능할까? 예산도 부족하잖아.",
      "example_en": "That's true, but is it realistically possible? We don't even have the budget.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "말이 좀 그런데",
      "english": "'This might sound weird/rude, but...' Preface before saying something potentially awkward or blunt.",
      "example": "말이 좀 그런데, 그 사람이랑 같이 일하기 좀 힘들지 않아?",
      "example_en": "This might sound a bit off, but isn't it kind of hard working with that person?",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "어떻게 보면",
      "english": "'Depending on how you look at it' or 'in a way.' Used to offer an alternative perspective or soften a statement.",
      "example": "어떻게 보면 오히려 잘된 거야. 그 회사 얼마 후에 망했잖아.",
      "example_en": "In a way, it actually worked out for the better. That company went under not long after.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "뭐 그럴 수도 있지",
      "english": "'Well, I suppose that's possible' or 'that can happen.' Casual acceptance or concession, sometimes reluctant.",
      "example": "실수한 거에 대해 사과했대. 뭐 그럴 수도 있지, 누구나 실수하니까.",
      "example_en": "He said he apologized for the mistake. Well, that can happen — everyone makes mistakes.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "솔직히 말하면",
      "english": "'To be honest' or 'frankly speaking.' Used before delivering a candid opinion, often one the listener might not want to hear.",
      "example": "솔직히 말하면 나도 별로 기대 안 했는데, 의외로 재밌더라.",
      "example_en": "To be honest, I wasn't expecting much either, but it was surprisingly fun.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "내가 보기엔",
      "english": "'The way I see it' or 'in my opinion.' Introduces a personal assessment, slightly hedged to avoid sounding too assertive.",
      "example": "내가 보기엔 아직 준비가 덜 된 것 같아. 조금 더 다듬는 게 어때?",
      "example_en": "The way I see it, it doesn't seem quite ready yet. How about polishing it a bit more?",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "괜히",
      "english": "'For no good reason' or 'unnecessarily.' Expresses regret about a pointless action or an inexplicable feeling.",
      "example": "괜히 말했나 봐. 분위기가 갑자기 어색해졌어.",
      "example_en": "I guess I shouldn't have said anything. The mood suddenly got awkward.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "말하기 좀 뭐하지만",
      "english": "'It's a bit awkward to say this, but...' Polite preface before saying something delicate or potentially unwelcome.",
      "example": "말하기 좀 뭐하지만, 네 발표 자료에 오타가 좀 많아.",
      "example_en": "It's a bit awkward to say this, but there are quite a few typos in your presentation materials.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "죽겠다",
      "english": "'I'm dying (of...).' Hyperbolic suffix expressing an extreme state — hunger, tiredness, boredom, heat, etc.",
      "example": "배고파 죽겠다. 점심 안 먹었더니 정말 쓰러질 것 같아.",
      "example_en": "I'm starving to death. I skipped lunch and I feel like I'm going to collapse.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "장난 아니다",
      "english": "'It's no joke' or 'it's seriously intense.' Emphasizes that something is extreme in degree — positively or negatively.",
      "example": "오늘 추위 장난 아니다. 나가자마자 후회했어.",
      "example_en": "The cold today is no joke. I regretted it the moment I stepped outside.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "미치겠다",
      "english": "'It's driving me crazy.' Expresses overwhelming frustration, stress, or sometimes excitement.",
      "example": "옆집에서 새벽 두 시까지 노래를 불러. 미치겠다, 진짜.",
      "example_en": "The neighbors are singing until 2 AM. It's driving me insane, honestly.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "끝내주다",
      "english": "'It's amazing' or 'unbeatable.' Strong compliment meaning something is exceptionally good.",
      "example": "이 집 갈비탕 끝내준다. 여기 자주 와야겠다.",
      "example_en": "The galbitang here is incredible. I should come here more often.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "한두 번이 아니다",
      "english": "'It's not just once or twice.' Emphasizes that something has happened repeatedly, implying frustration or a pattern.",
      "example": "그 사람이 약속을 어긴 게 한두 번이 아니야. 이제 못 믿겠어.",
      "example_en": "It's not just once or twice that he's broken promises. I can't trust him anymore.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "말이 되냐",
      "english": "'Does that even make sense?' Rhetorical question expressing that something is completely unreasonable.",
      "example": "월급은 그대로인데 일만 두 배로 늘었어. 이게 말이 되냐?",
      "example_en": "My salary is the same but the workload doubled. Does that even make sense?",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "얼마나 ~는지 모르다",
      "english": "'You have no idea how much...' Emphasizes an extreme degree of something that's hard to convey.",
      "example": "그 소식 듣고 얼마나 기뻤는지 몰라. 눈물이 날 뻔했어.",
      "example_en": "You have no idea how happy I was to hear that news. I almost cried.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "정신이 없다",
      "english": "'I'm overwhelmed' or 'I can't think straight.' Describes being so busy or chaotic that you lose track of things.",
      "example": "이사 준비하느라 요즘 정신이 없어. 뭐가 어디 있는지도 모르겠어.",
      "example_en": "I've been so overwhelmed preparing for the move. I don't even know where anything is.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "뭐가 이렇게 많아",
      "english": "'Why is there so much of this?' Exclamation of exasperation at an excessive quantity of something.",
      "example": "서류가 뭐가 이렇게 많아, 이걸 언제 다 처리해?",
      "example_en": "Why is there so much paperwork? When am I supposed to get through all of this?",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "어디 ~뿐이겠어",
      "english": "'It's not just...' / 'And that's not even the only thing.' Rhetorical expression meaning the problem goes far beyond what was mentioned.",
      "example": "돈 문제가 어디 그것뿐이겠어. 시간도 없고 사람도 부족해.",
      "example_en": "The money issue is not even the half of it. There's no time and not enough people either.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "있잖아",
      "english": "'You know what' or 'so listen.' Conversation opener to get someone's attention before introducing a topic.",
      "example": "있잖아, 나 요즘 고민이 하나 있는데 얘기 좀 해도 돼?",
      "example_en": "Hey, so listen — I've been worried about something lately. Can I talk to you about it?",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "그러니까",
      "english": "'Exactly' or 'that's what I'm saying.' Used to strongly agree with someone, or as a filler meaning 'so' or 'I mean.'",
      "example": "\"이번 일은 좀 심하지 않아?\" \"그러니까, 나도 그 말을 하고 싶었어.\"",
      "example_en": "\"Isn't this going a bit too far?\" \"Exactly — that's what I wanted to say.\"",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "아 맞다",
      "english": "'Oh right' or 'that reminds me.' Used when you suddenly remember something mid-conversation.",
      "example": "아 맞다, 내일 회의 시간 바뀐 거 알지? 두 시로 옮겨졌어.",
      "example_en": "Oh right, you know the meeting time changed tomorrow, right? It moved to 2 o'clock.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "그게 아니라",
      "english": "'That's not what I mean' or 'no, actually.' Used to correct a misunderstanding or redirect the conversation.",
      "example": "그게 아니라, 내 말은 아예 안 된다는 게 아니고 좀 더 생각해 보자는 거야.",
      "example_en": "That's not what I mean — I'm not saying it's impossible, I'm saying let's think about it more.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "뭐랄까",
      "english": "'How should I put it' or 'what's the word.' Filler used while searching for the right expression.",
      "example": "그 영화가, 뭐랄까, 슬프면서도 따뜻한 느낌이었어.",
      "example_en": "That movie was, how should I put it, sad but warm at the same time.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "그건 그렇고",
      "english": "'That aside' or 'anyway.' Used to acknowledge a point then shift to a different topic.",
      "example": "그건 그렇고, 주말에 시간 있어? 같이 밥 먹자.",
      "example_en": "That aside, are you free this weekend? Let's grab a meal.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "그나저나",
      "english": "'By the way' or 'anyway' (topic pivot). Used to change the subject naturally in casual conversation.",
      "example": "그나저나 너 요즘 운동 시작했다며? 몸이 달라진 것 같은데.",
      "example_en": "By the way, I heard you started working out recently? You look like you've changed.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "하긴",
      "english": "'Come to think of it' or 'well, you have a point.' Concedes that the other person's argument is valid after initial resistance.",
      "example": "하긴, 네 말도 맞아. 서두르면 오히려 실수할 수 있지.",
      "example_en": "Come to think of it, you're right. If we rush, we might make mistakes instead.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "그래 가지고",
      "english": "'And so' or 'and then.' Casual connective used in storytelling to link events. More spoken than written.",
      "example": "버스를 놓쳤어. 그래 가지고 택시를 탔는데 택시비가 장난 아니더라.",
      "example_en": "I missed the bus. And so I took a taxi, and the fare was no joke.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "아니 근데",
      "english": "'But wait' or 'hold on though.' Used to interject with a new thought, mild objection, or shift in direction.",
      "example": "아니 근데, 그 사람이 왜 거기 있었어? 출장 간다고 하지 않았어?",
      "example_en": "But wait, why was he there? Didn't he say he was going on a business trip?",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "내 말이",
      "english": "'That's what I'm saying.' Emphatic agreement, confirming that someone just expressed exactly what you think.",
      "example": "\"요즘 물가가 너무 올랐어.\" \"내 말이. 장 보러 갈 때마다 깜짝 놀라.\"",
      "example_en": "\"Prices have gone up so much lately.\" \"That's what I'm saying. I'm shocked every time I go grocery shopping.\"",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "당연하지",
      "english": "'Of course' or 'obviously.' Emphatic affirmation that something goes without saying.",
      "example": "\"이번에 도와줄 수 있어?\" \"당연하지, 말만 해.\"",
      "example_en": "\"Can you help me with this?\" \"Of course — just say the word.\"",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "누가 아니래",
      "english": "'Tell me about it' or 'who would disagree.' Strong agreement implying the point is so obvious nobody could argue.",
      "example": "\"이 날씨에 일하러 가기 싫다.\" \"누가 아니래, 나도 집에서 쉬고 싶어.\"",
      "example_en": "\"I don't want to go to work in this weather.\" \"Tell me about it — I want to stay home and rest too.\"",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "인정",
      "english": "'Fair point' or 'acknowledged.' Casual one-word concession validating someone's argument. Popular among younger speakers.",
      "example": "\"이 드라마 연출이 진짜 좋지 않아?\" \"인정. 특히 마지막 장면은 소름 돋았어.\"",
      "example_en": "\"Isn't the directing in this drama really good?\" \"Fair point. The last scene especially gave me chills.\"",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "완전 공감",
      "english": "'I totally relate.' Expresses deep agreement or shared feeling about a situation or opinion.",
      "example": "\"나이 들수록 시간이 빨리 간다는 말, 진짜 맞는 것 같아.\" \"완전 공감. 올해도 벌써 반이 지났잖아.\"",
      "example_en": "\"The saying that time flies faster as you age seems really true.\" \"I totally relate. Half of this year is already gone.\"",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "그치",
      "english": "'Right?' Casual contraction of 그렇지, used to seek or express quick agreement in conversation.",
      "example": "\"여기 분위기 진짜 좋다, 그치?\" \"응, 다음에 또 오자.\"",
      "example_en": "\"The atmosphere here is really great, right?\" \"Yeah, let's come again next time.\"",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "설마",
      "english": "'Surely not' or 'no way.' Expresses disbelief or reluctance to accept that something could possibly be true.",
      "example": "설마 걔가 진짜로 회사를 옮긴 거야? 농담인 줄 알았는데.",
      "example_en": "You're not telling me he actually switched companies? I thought it was a joke.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "별로인데",
      "english": "'Not really' or 'I'm not into it.' Mild, casual way to express that something doesn't appeal to you.",
      "example": "\"이 식당 어때?\" \"음, 별로인데. 지난번에 왔을 때 맛이 좀 그랬어.\"",
      "example_en": "\"How about this restaurant?\" \"Hmm, not really. The taste was a bit off last time I came.\"",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "좀 아닌 것 같은데",
      "english": "'I don't think that's right' or 'that seems off.' Softened disagreement used to gently push back on an idea.",
      "example": "\"그냥 이대로 제출하면 안 될까?\" \"그건 좀 아닌 것 같은데, 한 번 더 검토하자.\"",
      "example_en": "\"Can't we just submit it as is?\" \"I don't think that's a good idea — let's review it one more time.\"",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "무슨 소리야",
      "english": "'What are you talking about?' Dismissive response when someone's statement seems nonsensical or off-base.",
      "example": "\"네가 잘못한 거 아니야?\" \"무슨 소리야, 나는 아무 관련 없어.\"",
      "example_en": "\"Wasn't it your fault?\" \"What are you talking about? I had nothing to do with it.\"",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "짜증 나",
      "english": "'I'm so annoyed' or 'this is irritating.' Direct expression of annoyance at a situation or person.",
      "example": "인터넷이 또 끊겼어. 진짜 짜증 나, 이번 달에만 벌써 세 번째야.",
      "example_en": "The internet went out again. I'm so annoyed — this is already the third time this month.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "또야?",
      "english": "'Again?' or 'Not this again.' Exasperated reaction when an unwanted situation keeps repeating.",
      "example": "\"내일도 야근이래.\" \"또야? 이번 주만 벌써 네 번째잖아.\"",
      "example_en": "\"They said it's overtime again tomorrow.\" \"Again? That's already the fourth time just this week.\"",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "환장하겠다",
      "english": "'I'm going to lose my mind.' Expresses extreme frustration or the feeling of being pushed past one's limit.",
      "example": "서류를 세 번이나 다시 쓰라고 해. 환장하겠다, 진짜.",
      "example_en": "They're making me rewrite the documents for the third time. I'm going to lose my mind, seriously.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "진이 빠지다",
      "english": "'I'm completely drained.' Describes being physically or mentally exhausted from a tedious or taxing ordeal.",
      "example": "이사 짐 다 옮기고 나니까 진이 다 빠졌어. 손가락 하나 까딱 못 하겠어.",
      "example_en": "After moving all the boxes, I'm completely drained. I can't lift a finger.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "그만 좀 해",
      "english": "'Stop it already' or 'cut it out.' Tells someone to stop doing something repetitive or annoying.",
      "example": "자꾸 같은 얘기 반복하지 마. 그만 좀 해, 나도 알고 있다고.",
      "example_en": "Stop repeating the same thing. Cut it out already — I know.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "한숨밖에 안 나온다",
      "english": "'All I can do is sigh.' Resigned frustration when a situation is so bad there is nothing left to say.",
      "example": "다음 달 카드값 보고 한숨밖에 안 나왔어. 어디서부터 줄여야 할지 모르겠어.",
      "example_en": "When I saw next month's credit card bill, all I could do was sigh. I don't know where to start cutting back.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "끝이 안 보인다",
      "english": "'There's no end in sight.' Expresses frustration with a task or situation that seems to go on forever.",
      "example": "이 보고서 작성 끝이 안 보인다. 쓰면 쓸수록 추가 자료가 필요해.",
      "example_en": "There's no end in sight with this report. The more I write, the more additional materials I need.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "골치 아프다",
      "english": "'It's a headache' or 'what a pain.' Describes something troublesome and difficult to resolve.",
      "example": "윗집 소음 문제 때문에 골치 아파. 말해도 안 듣거든.",
      "example_en": "The noise from the upstairs neighbor is such a headache. They don't listen even when I talk to them.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "될 대로 되라",
      "english": "'Whatever happens, happens.' Resigned expression of giving up trying to control a frustrating situation.",
      "example": "더 이상 손 쓸 게 없어. 될 대로 되라, 나는 최선을 다했어.",
      "example_en": "There's nothing more I can do. Whatever happens, happens — I did my best.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "어휴",
      "english": "Exasperated sigh expressing weariness, annoyance, or mild disgust. Heavier and more drawn-out than a simple 'ah.'",
      "example": "어휴, 이 더위에 에어컨도 고장이야? 참 되는 일이 하나도 없다.",
      "example_en": "Ugh, the AC is broken in this heat? Nothing is going right.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "역시 너밖에 없다",
      "english": "'No one else but you could do this.' Strong compliment expressing that someone is uniquely skilled or reliable.",
      "example": "이렇게 빨리 해결해 줄 줄은 몰랐어. 역시 너밖에 없다.",
      "example_en": "I didn't expect you to solve it this fast. No one else could've done it but you.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "쩐다",
      "english": "'That's insane' or 'that's incredible.' Slang expressing strong admiration for something impressive.",
      "example": "혼자서 이 프로젝트 다 한 거야? 야, 진짜 쩐다.",
      "example_en": "You did this whole project by yourself? Dude, that's incredible.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "너답다",
      "english": "'That's so you.' Compliment acknowledging that someone's action perfectly reflects their best qualities.",
      "example": "바쁜데도 남 도와주는 거 보니까 역시 너답다.",
      "example_en": "Seeing you help others even when you're busy — that's so you.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "센스 있다",
      "english": "'You've got great sense.' Praises someone's perceptiveness, good taste, or situational awareness.",
      "example": "선물 고르는 거 진짜 센스 있다. 내가 딱 갖고 싶었던 건데.",
      "example_en": "You've got such great taste in picking gifts. This is exactly what I wanted.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "별걸 다 잘하네",
      "english": "'You're good at everything.' Admiring exclamation when someone shows unexpected talent in yet another area.",
      "example": "그림도 이렇게 잘 그려? 별걸 다 잘하네, 진짜.",
      "example_en": "You draw this well too? You're seriously good at everything.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "해낼 줄 알았어",
      "english": "'I knew you'd pull it off.' Expression of confidence in someone, said after they succeed at something.",
      "example": "합격한 거 축하해! 네가 해낼 줄 알았어, 한 번도 의심 안 했어.",
      "example_en": "Congratulations on passing! I knew you'd pull it off — I never doubted you.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "좀 치는데",
      "english": "'You're pretty good at this.' Understated, playful compliment implying someone is actually very skilled.",
      "example": "당구 처음이라며? 좀 치는데? 완전 거짓말이지.",
      "example_en": "You said this was your first time playing billiards? You're pretty good — you're totally lying.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "니가 하면 다르다",
      "english": "'It's different when you do it.' Compliment that someone brings a special quality or skill that elevates the result.",
      "example": "같은 레시피인데 니가 하면 다르다. 훨씬 맛있어.",
      "example_en": "It's the same recipe, but it's different when you make it. It's way more delicious.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "포기하기엔 아깝다",
      "english": "'It'd be a waste to give up now.' Encouragement urging someone to keep going because they have already invested so much.",
      "example": "여기서 그만두려고? 이만큼 했는데 포기하기엔 아깝다. 조금만 더 힘내 봐.",
      "example_en": "You're going to quit here? After coming this far, it'd be a waste to give up. Push through just a bit more.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "어떻게 그런 생각을 했어",
      "english": "'How did you even come up with that?' Expresses admiration for someone's unexpected creativity or cleverness.",
      "example": "이 아이디어 진짜 기발하다. 어떻게 그런 생각을 했어?",
      "example_en": "This idea is really brilliant. How did you even come up with that?",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "그래서 말인데",
      "english": "'So, about that...' Transition phrase used to segue from casual talk to the real point or a favor you want to ask.",
      "example": "그래서 말인데, 혹시 이번 주 토요일에 차 좀 빌려줄 수 있어?",
      "example_en": "So about that... could you maybe lend me your car this Saturday?",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "말 나온 김에",
      "english": "'Since we're on the topic' or 'while we're at it.' Brings up something related to the current subject.",
      "example": "말 나온 김에 하나만 더 얘기할게. 다음 달 회비 인상 건도 논의해야 해.",
      "example_en": "Since we're on the topic, let me bring up one more thing. We need to discuss the fee increase next month.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "근데 진짜",
      "english": "'But seriously though.' Shifts to a more earnest or important point within a casual conversation.",
      "example": "근데 진짜, 너 요즘 살 많이 빠진 것 같아. 무슨 비결이야?",
      "example_en": "But seriously, you look like you've lost a lot of weight lately. What's your secret?",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "그건 둘째 치고",
      "english": "'Setting that aside' or 'that's secondary.' Dismisses one point to redirect attention to something more urgent.",
      "example": "돈은 그건 둘째 치고, 시간이 부족한 게 더 큰 문제야.",
      "example_en": "Money aside, the bigger problem is that we don't have enough time.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "어쨌든",
      "english": "'Anyway' or 'in any case.' Wraps up a tangent or debate and refocuses the conversation on the main point.",
      "example": "이유야 어쨌든, 결과적으로 잘 됐으니 됐지 뭐.",
      "example_en": "Whatever the reason, it worked out in the end, so it's fine.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "뭐냐면",
      "english": "'The thing is' or 'what I mean is.' Clarifying preface before explaining a point more precisely.",
      "example": "내가 하고 싶은 말이 뭐냐면, 이번 기회를 놓치면 안 된다는 거야.",
      "example_en": "What I'm trying to say is that we can't afford to miss this opportunity.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "아무튼",
      "english": "'At any rate' or 'anyway.' Quick conversational wrap-up or pivot, slightly more casual than 어쨌든.",
      "example": "아무튼 결론은 내일까지 끝내야 한다는 거지? 알겠어, 해 볼게.",
      "example_en": "At any rate, the bottom line is it needs to be done by tomorrow, right? Got it, I'll try.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "다름이 아니라",
      "english": "'The reason I'm bringing this up is...' Polite preface before stating the real purpose of a conversation or call.",
      "example": "전화한 건 다름이 아니라, 주말에 도움이 좀 필요해서.",
      "example_en": "The reason I'm calling is that I need some help this weekend.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "딴 얘기지만",
      "english": "'This is off-topic, but...' Signals a pivot to a completely unrelated subject mid-conversation.",
      "example": "딴 얘기지만, 너 아까 말한 그 책 제목이 뭐였어? 갑자기 생각났어.",
      "example_en": "This is off-topic, but what was the title of that book you mentioned earlier? It just popped into my head.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "그게 말이야",
      "english": "'So here's the thing.' Introduces a point you have been building up to or hesitating to say.",
      "example": "그게 말이야, 사실 나 다음 달에 이직하려고.",
      "example_en": "So here's the thing — actually, I'm planning to change jobs next month.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "참 대단하시다",
      "english": "How impressive (sarcastic — meaning the opposite)",
      "example": "약속을 또 어겼네? 참 대단하시다.",
      "example_en": "You broke your promise again? How impressive.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "그래, 네가 다 잘했어",
      "english": "Sure, you did everything right (dismissive sarcasm)",
      "example": "남 탓만 하더니, 그래, 네가 다 잘했어.",
      "example_en": "You kept blaming others — sure, you did everything right.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "아이고, 고생이 많으시다",
      "english": "Oh, you must be suffering so much (ironic sympathy)",
      "example": "하루 종일 폰만 봤으면서, 아이고 고생이 많으시다.",
      "example_en": "You were on your phone all day, yet oh, you must be suffering so much.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "눈치도 없다",
      "english": "You have zero social awareness (pointed observation)",
      "example": "분위기가 이런데 혼자 웃고 있어? 눈치도 없다.",
      "example_en": "The mood is like this and you're laughing alone? Zero social awareness.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "입만 살았어",
      "english": "All talk, no action",
      "example": "매번 하겠다고만 하지, 입만 살았어.",
      "example_en": "You always say you'll do it — you're all talk.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "그게 말이라고 해?",
      "english": "Is that even something you should say?",
      "example": "사과한다면서 그게 말이라고 해?",
      "example_en": "You call that an apology? Is that even something to say?",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "잘난 척은",
      "english": "What a show-off (dismissive)",
      "example": "한 번 맞았다고 잘난 척은.",
      "example_en": "You got one right and now you're showing off.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "어디서 배운 거야, 그 버릇",
      "english": "Where did you pick up that bad habit? (rhetorical, mocking)",
      "example": "어른 앞에서 그렇게 말하면, 어디서 배운 거야 그 버릇?",
      "example_en": "Talking like that in front of elders — where did you pick up that habit?",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "오, 진짜?",
      "english": "Oh, really? (can be sarcastic or genuinely surprised depending on tone)",
      "example": "자기가 직접 요리했다고? 오, 진짜?",
      "example_en": "You cooked it yourself? Oh, really?",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "하여튼 말은 참 잘해",
      "english": "You sure have a way with words (sarcastically implying they only talk)",
      "example": "변명할 때 보면 하여튼 말은 참 잘해.",
      "example_en": "When it comes to making excuses, you sure have a way with words.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "헉, 이게 뭐야",
      "english": "Whoa, what is this?! (shock/disbelief)",
      "example": "헉, 이게 뭐야! 갑자기 사장이 전체 메일을 보냈어.",
      "example_en": "Whoa, what is this?! The boss suddenly sent a company-wide email.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "소름 끼친다",
      "english": "That gives me chills (shock/awe/creepiness)",
      "example": "우연의 일치라기엔 소름 끼친다.",
      "example_en": "It gives me chills to call it just a coincidence.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "기가 차다",
      "english": "To be so stunned/appalled one is speechless",
      "example": "이 정도면 기가 차서 말이 안 나온다.",
      "example_en": "At this point, I'm so stunned I can't even speak.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "뜬금없이 왜",
      "english": "Why out of the blue?",
      "example": "뜬금없이 왜 전 여자친구 이야기를 꺼내?",
      "example_en": "Why are you bringing up your ex-girlfriend out of the blue?",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "눈앞이 캄캄하다",
      "english": "Everything goes dark before one's eyes (overwhelmed/shocked)",
      "example": "시험 결과를 보는 순간 눈앞이 캄캄했다.",
      "example_en": "The moment I saw the test results, everything went dark.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "아닐 줄 알았는데",
      "english": "I thought it wouldn't be the case, but... (surprised it happened)",
      "example": "설마 했는데, 아닐 줄 알았는데 진짜 합격했어.",
      "example_en": "I didn't think it would happen, but I actually passed.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "꿈에도 몰랐다",
      "english": "I had no idea in my wildest dreams",
      "example": "그 사람이 범인이었다니 꿈에도 몰랐다.",
      "example_en": "I had no idea in my wildest dreams that person was the culprit.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "심장이 멎는 줄 알았다",
      "english": "I thought my heart was going to stop (extreme shock)",
      "example": "뒤에서 갑자기 소리 질러서 심장이 멎는 줄 알았다.",
      "example_en": "Someone suddenly screamed from behind — I thought my heart was going to stop.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "이게 실화야?",
      "english": "Is this for real? (disbelief at something happening)",
      "example": "시험 범위가 전부라고? 이게 실화야?",
      "example_en": "The exam covers everything? Is this for real?",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "하늘이 노래지다",
      "english": "The sky turned yellow (feeling faint from shock/despair)",
      "example": "통장 잔고를 확인하고 하늘이 노래졌다.",
      "example_en": "I checked my bank balance and nearly fainted.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "한번만 더 생각해 봐",
      "english": "Just think about it one more time (gentle persuasion)",
      "example": "섣불리 결정하지 말고 한번만 더 생각해 봐.",
      "example_en": "Don't decide hastily — just think about it one more time.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "네 입장은 알겠는데",
      "english": "I understand your position, but... (prelude to disagreeing)",
      "example": "네 입장은 알겠는데, 이건 좀 아닌 것 같아.",
      "example_en": "I understand your position, but I don't think this is right.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "그건 좀 다른 문제 아니야?",
      "english": "Isn't that a different issue? (redirecting an argument)",
      "example": "비용 문제를 말하는데 왜 감정 이야기를 해? 그건 좀 다른 문제 아니야?",
      "example_en": "We're talking about costs, so why bring up feelings? Isn't that a different issue?",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "그 논리대로라면",
      "english": "By that logic... (challenging someone's reasoning)",
      "example": "그 논리대로라면 아무도 새로운 시도를 못 하겠네.",
      "example_en": "By that logic, nobody could ever try anything new.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "따지고 보면",
      "english": "If you think about it carefully / when you really look into it",
      "example": "따지고 보면 네가 먼저 약속을 어긴 거잖아.",
      "example_en": "When you really look into it, you were the one who broke the promise first.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "안 그래도 그 얘기 하려고 했는데",
      "english": "I was actually just about to bring that up",
      "example": "안 그래도 그 얘기 하려고 했는데, 네가 먼저 꺼내니까 잘됐다.",
      "example_en": "I was just about to bring that up — good thing you mentioned it first.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "핑계 대지 마",
      "english": "Don't make excuses",
      "example": "바빠서 못 했다니, 핑계 대지 마.",
      "example_en": "You said you were too busy — don't make excuses.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "끝까지 우길 거야?",
      "english": "Are you going to insist until the very end?",
      "example": "증거가 이렇게 있는데 끝까지 우길 거야?",
      "example_en": "With this much evidence, are you still going to insist?",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "그렇다고 이게 맞아?",
      "english": "Even so, is this right? (conceding a point but still disagreeing)",
      "example": "힘들었던 건 알아. 그렇다고 이게 맞아?",
      "example_en": "I know it was hard. But even so, is this the right thing to do?",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "두고 보자",
      "english": "Just you wait / We'll see (mild threat or determination)",
      "example": "지금은 웃어도 두고 보자, 누가 맞는지.",
      "example_en": "Laugh now, but just you wait — we'll see who's right.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "야, 들었어?",
      "english": "Hey, did you hear? (starting gossip)",
      "example": "야, 들었어? 옆 부서 과장이 갑자기 사표 냈대.",
      "example_en": "Hey, did you hear? The manager in the next department suddenly resigned.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "그래서 어떻게 됐는데?",
      "english": "So what happened? (egging on a story)",
      "example": "거기까지 알고 끊으면 어떡해, 그래서 어떻게 됐는데?",
      "example_en": "You can't stop there — so what happened?",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "아니 근데 진짜 웃긴 게",
      "english": "No but the really funny thing is... (storytelling transition)",
      "example": "아니 근데 진짜 웃긴 게, 다음 날 본인은 아무 일 없다는 듯이 나왔어.",
      "example_en": "But the really funny thing is, the next day they showed up acting like nothing happened.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "카더라",
      "english": "So they say / Allegedly (hearsay marker)",
      "example": "이번 인사이동에서 팀장이 바뀐다 카더라.",
      "example_en": "They say the team leader is changing in the next personnel reshuffle.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "소문에 의하면",
      "english": "According to rumors",
      "example": "소문에 의하면 그 두 사람이 사귄대.",
      "example_en": "According to rumors, those two are dating.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "그 사람 원래 좀 그래",
      "english": "That person has always been like that (dismissive characterization)",
      "example": "놀랄 것도 없어, 그 사람 원래 좀 그래.",
      "example_en": "Nothing to be surprised about — that person has always been like that.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "듣자 하니",
      "english": "From what I've heard (introducing secondhand info)",
      "example": "듣자 하니 그쪽 회사 분위기가 완전 엉망이래.",
      "example_en": "From what I've heard, the atmosphere at that company is a total mess.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "그 뒷이야기가 있어",
      "english": "There's a backstory to that",
      "example": "걔가 왜 갑자기 그만뒀는지 알아? 그 뒷이야기가 있어.",
      "example_en": "Do you know why they suddenly quit? There's a backstory.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "내가 직접 본 건 아닌데",
      "english": "I didn't see it myself, but... (hedging before gossip)",
      "example": "내가 직접 본 건 아닌데, 그날 사무실에서 큰 소리가 났다고 해.",
      "example_en": "I didn't see it myself, but they say there was a lot of shouting in the office that day.",
      "notes": "Related concepts and usage variations in natural Korean."
    },
    {
      "korean": "함부로 말하면 안 되는데",
      "english": "I probably shouldn't say this, but... (pretending to hold back before sharing)",
      "example": "함부로 말하면 안 되는데, 그 프로젝트 사실 거의 엎어질 뻔했대.",
      "example_en": "I probably shouldn't say this, but that project almost fell apart.",
      "notes": "Related concepts and usage variations in natural Korean."
    }
  ]
}