{
  "주제별 단어 — 비즈니스 (Topic: Business)": [
    {
      "korean": "의제",
      "english": "agenda item; topic for discussion",
      "example": "오늘 회의의 주요 의제는 내년도 사업 계획입니다.",
      "example_en": "The main agenda item for today's meeting is next year's business plan.",
      "notes": "Collocates with 주요, 채택하다. Related: 안건 (agenda item), 회의록 (minutes). Formal meeting vocabulary."
    },
    {
      "korean": "기조연설",
      "english": "keynote speech; keynote address",
      "example": "대표이사가 연례 컨퍼런스에서 기조연설을 맡았습니다.",
      "example_en": "The CEO delivered the keynote speech at the annual conference.",
      "notes": "Compound: 기조 (keynote) + 연설 (speech). Collocates with 하다, 맡다. Related: 축사 (congratulatory address), 개회사 (opening remarks)."
    },
    {
      "korean": "발언권",
      "english": "right to speak; the floor",
      "example": "의장이 참석자들에게 순서대로 발언권을 부여했다.",
      "example_en": "The chairperson granted the floor to the attendees in order.",
      "notes": "Compound: 발언 (speaking) + 권 (right). Collocates with 주다, 얻다. Related: 의사 진행 (proceedings), 질의 (inquiry)."
    },
    {
      "korean": "질의응답",
      "english": "question-and-answer session; Q&A",
      "example": "발표가 끝난 후 질의응답 시간을 가지겠습니다.",
      "example_en": "We will have a Q&A session after the presentation ends.",
      "notes": "Abbreviation: Q&A. Collocates with 시간, 갖다. Related: 토론 (discussion), 패널 (panel). Standard conference format."
    },
    {
      "korean": "사회를 보다",
      "english": "to moderate; to host; to emcee",
      "example": "이번 워크숍은 기획팀 김 과장이 사회를 봅니다.",
      "example_en": "Manager Kim from the planning team will moderate this workshop.",
      "notes": "사회 here means MC/hosting, not society. Collocates with 맡다. Related: 진행자 (moderator), 사회자 (MC/host)."
    },
    {
      "korean": "회람하다",
      "english": "to circulate (a document); to pass around",
      "example": "수정된 계약서를 전 부서에 회람해 주세요.",
      "example_en": "Please circulate the revised contract to all departments.",
      "notes": "Formal/written register. Collocates with 문서, 전 부서. Related: 공유하다 (share), 배포하다 (distribute). Office vocabulary."
    },
    {
      "korean": "현안",
      "english": "current issue; pressing matter; pending issue",
      "example": "경영진이 모여 회사의 주요 현안을 논의했다.",
      "example_en": "The management gathered to discuss the company's key pressing issues.",
      "notes": "Collocates with 주요, 논의하다, 해결하다. Related: 당면 과제 (immediate challenge), 쟁점 (contention point). Formal register."
    },
    {
      "korean": "회부하다",
      "english": "to refer (a matter) to; to submit for review",
      "example": "이 안건은 법무팀에 회부하여 검토를 받겠습니다.",
      "example_en": "This matter will be referred to the legal team for review.",
      "notes": "Collocates with 안건, 위원회에. Related: 이관하다 (transfer), 상정하다 (bring up for discussion). Formal bureaucratic term."
    },
    {
      "korean": "배석하다",
      "english": "to sit in on; to attend as an observer or support",
      "example": "신입 사원이 중요한 거래 협상에 배석하여 경험을 쌓았다.",
      "example_en": "The new employee sat in on an important deal negotiation to gain experience.",
      "notes": "Collocates with 회의에, 협상에. Also used in legal contexts (배석 판사). Implies observing, not leading the meeting."
    },
    {
      "korean": "속개하다",
      "english": "to resume (a meeting or session)",
      "example": "점심 식사 후 오후 1시에 회의를 속개하겠습니다.",
      "example_en": "We will resume the meeting at 1 PM after lunch.",
      "notes": "Formal term for resuming a meeting or session after a break. Collocates with 회의를, 오후에. Related: 휴회 (recess)."
    },
    {
      "korean": "결산",
      "english": "settlement of accounts; closing the books; financial closing",
      "example": "회계팀이 연말 결산을 마무리하느라 야근하고 있다.",
      "example_en": "The accounting team is working overtime to finalize the year-end closing.",
      "notes": "Collocates with 연말, 분기, 마무리하다. Related: 재무제표 (financial statements), 손익계산서 (income statement). Accounting term."
    },
    {
      "korean": "감사",
      "english": "audit; inspection (financial)",
      "example": "외부 감사에서 회계 처리에 문제가 없는 것으로 확인되었다.",
      "example_en": "The external audit confirmed that there were no issues with the accounting.",
      "notes": "Homonym: 감사 also means gratitude or auditor (person). Collocates with 외부, 내부, 받다. Related: 회계 감사 (financial audit)."
    },
    {
      "korean": "감가상각",
      "english": "depreciation (of assets)",
      "example": "이 설비는 감가상각이 완료되어 장부상 가치가 0원입니다.",
      "example_en": "This equipment has been fully depreciated, so its book value is zero won.",
      "notes": "Accounting term: 감가 (reduce value) + 상각 (write off). Collocates with 비용, 완료되다. Related: 내용연수 (useful life of asset)."
    },
    {
      "korean": "원가",
      "english": "cost price; production cost",
      "example": "원자재 가격이 올라서 원가가 15% 이상 증가했습니다.",
      "example_en": "Raw material prices have risen, increasing the production cost by over 15%.",
      "notes": "Collocates with 절감, 분석, 계산하다. Related: 매출원가 (cost of goods sold), 제조원가 (manufacturing cost). Key business metric."
    },
    {
      "korean": "전표",
      "english": "accounting slip; voucher; chit",
      "example": "경비를 청구하려면 지출 전표를 먼저 작성해야 합니다.",
      "example_en": "To claim expenses, you need to fill out an expenditure voucher first.",
      "notes": "Collocates with 작성하다, 처리하다. Types: 입금, 출금, 대체 전표. Basic accounting document in Korean companies."
    },
    {
      "korean": "정산하다",
      "english": "to settle accounts; to square up; to reconcile",
      "example": "출장비는 귀국 후 일주일 이내에 정산해야 합니다.",
      "example_en": "Business trip expenses must be settled within one week of returning.",
      "notes": "Collocates with 비용, 출장비. Related: 결산 (closing books), 환급 (refund). Common in expense reimbursement contexts."
    },
    {
      "korean": "미수금",
      "english": "accounts receivable; outstanding payment owed",
      "example": "미수금이 누적되면서 회사의 현금 흐름에 문제가 생겼다.",
      "example_en": "As outstanding receivables piled up, the company's cash flow ran into trouble.",
      "notes": "Compound: 미 (not yet) + 수 (receive) + 금 (money). Opposite: 미지급금. Balance sheet term. Collocates with 회수하다."
    },
    {
      "korean": "미지급금",
      "english": "accounts payable; amount owed but not yet paid",
      "example": "분기 말까지 모든 미지급금을 처리해 주시기 바랍니다.",
      "example_en": "Please process all outstanding payables by the end of the quarter.",
      "notes": "Compound: 미 (not yet) + 지급 (pay) + 금 (money). Opposite: 미수금. Balance sheet term. Collocates with 처리하다."
    },
    {
      "korean": "세무",
      "english": "tax affairs; taxation matters",
      "example": "세무 조사를 앞두고 관련 서류를 꼼꼼히 점검했다.",
      "example_en": "We thoroughly reviewed the relevant documents ahead of the tax audit.",
      "notes": "Collocates with 조사, 신고, 사무소. Compounds: 세무사 (tax accountant), 세무 조사 (tax audit). Important Korean business term."
    },
    {
      "korean": "분기 실적",
      "english": "quarterly earnings; quarterly results",
      "example": "3분기 실적이 시장 예상치를 크게 웃돌았다.",
      "example_en": "Third-quarter earnings significantly exceeded market expectations.",
      "notes": "분기 = quarter (Q1-Q4). Collocates with 발표하다, 웃돌다/밑돌다. Related: 연간 실적, 영업이익 (operating profit)."
    },
    {
      "korean": "복리후생",
      "english": "employee benefits; fringe benefits; welfare",
      "example": "이 회사는 연봉은 낮지만 복리후생이 탄탄하기로 유명하다.",
      "example_en": "This company is known for having strong benefits despite lower salaries.",
      "notes": "Collocates with 제도, 탄탄하다. Examples: health insurance, meal stipends, tuition support. Key factor in Korean job decisions."
    },
    {
      "korean": "연봉",
      "english": "annual salary",
      "example": "이직 제안을 받았는데 연봉이 30% 인상된 조건이었다.",
      "example_en": "I received a job offer with a 30% increase in annual salary.",
      "notes": "Collocates with 협상, 인상, 삭감. Related: 월급 (monthly salary), 성과급 (performance bonus). Always pretax in Korea."
    },
    {
      "korean": "인사이동",
      "english": "personnel reshuffle; staff transfer; reassignment",
      "example": "대규모 인사이동이 발표되면서 사내 분위기가 긴장됐다.",
      "example_en": "A large-scale personnel reshuffle was announced, creating tension in the office.",
      "notes": "Collocates with 발표되다, 대규모. Related: 전보 (transfer), 발령 (appointment order). Happens seasonally at Korean companies."
    },
    {
      "korean": "승진하다",
      "english": "to be promoted; to advance in rank",
      "example": "5년 만에 과장에서 부장으로 승진했습니다.",
      "example_en": "After five years, I was promoted from section chief to department head.",
      "notes": "Korean corporate ranks: 사원, 대리, 과장, 차장, 부장, 이사. Collocates with 하다, 시키다. Related: 진급 (military promotion)."
    },
    {
      "korean": "출퇴근",
      "english": "commuting to and from work",
      "example": "출퇴근 시간이 왕복 두 시간이라 재택근무가 절실하다.",
      "example_en": "My round-trip commute is two hours, so I desperately need remote work.",
      "notes": "Compound: 출근 (go to work) + 퇴근 (leave work). Collocates with 시간, 길. Related: 재택근무 (remote work)."
    },
    {
      "korean": "연차",
      "english": "annual leave; paid time off",
      "example": "남은 연차가 3일밖에 없어서 아껴 써야 한다.",
      "example_en": "I only have 3 days of annual leave left, so I need to use them wisely.",
      "notes": "Short for 연차 휴가. Collocates with 쓰다, 내다, 남다. Related: 반차 (half-day off), 병가 (sick leave). Common workplace term."
    },
    {
      "korean": "수습 기간",
      "english": "probation period; trial period",
      "example": "수습 기간 3개월 동안 업무 적응도를 평가합니다.",
      "example_en": "Work adaptability is assessed during the three-month probation period.",
      "notes": "Collocates with 3개월, 끝나다. Related: 정규직 (permanent), 계약직 (contract). Probation before becoming a regular employee."
    },
    {
      "korean": "퇴직금",
      "english": "severance pay; retirement allowance",
      "example": "1년 이상 근무한 직원에게는 퇴직금이 지급됩니다.",
      "example_en": "Severance pay is provided to employees who have worked for over one year.",
      "notes": "Legally mandated in Korea for 1+ year employees. Collocates with 지급하다, 중간 정산. Related: 퇴직연금 (retirement pension)."
    },
    {
      "korean": "인사 고과",
      "english": "performance review; performance evaluation",
      "example": "인사 고과 결과에 따라 연봉 인상률이 결정됩니다.",
      "example_en": "The salary raise percentage is determined based on the performance review results.",
      "notes": "Collocates with 평가, 결과. Related: KPI, 다면 평가 (360-degree review). Determines raises and promotions in Korean firms."
    },
    {
      "korean": "직무",
      "english": "job duties; role; position responsibilities",
      "example": "지원하기 전에 직무 기술서를 꼼꼼히 읽어 보세요.",
      "example_en": "Read the job description carefully before applying.",
      "notes": "Collocates with 기술서, 역량, 분석. Related: 업무 (work/tasks), 직책 (title/position). Formal HR terminology."
    },
    {
      "korean": "거래처",
      "english": "business client; trading partner; account",
      "example": "주요 거래처와의 계약이 곧 만료되어 재협상이 필요하다.",
      "example_en": "The contract with our major client is expiring soon and needs renegotiation.",
      "notes": "Collocates with 관리하다, 확보하다. Related: 협력업체 (partner company), 납품업체 (supplier). Key business relationship term."
    },
    {
      "korean": "견적서",
      "english": "quotation; cost estimate; price quote",
      "example": "세 곳에서 견적서를 받아 비교한 후 업체를 선정했다.",
      "example_en": "We selected a vendor after receiving and comparing quotes from three companies.",
      "notes": "Collocates with 받다, 보내다, 비교하다. Related: 청구서 (invoice), 계약서 (contract). Standard in B2B transactions."
    },
    {
      "korean": "납품하다",
      "english": "to deliver goods; to supply; to fulfill an order",
      "example": "약속한 날짜까지 물량을 납품하지 못하면 위약금이 발생합니다.",
      "example_en": "If we fail to deliver the quantity by the promised date, there will be a penalty.",
      "notes": "Collocates with 기한, 물량. Related: 발주 (placing an order), 검수 (inspection on delivery). Supply chain vocabulary."
    },
    {
      "korean": "단가",
      "english": "unit price; unit cost",
      "example": "대량 주문하면 단가를 10% 낮춰 드릴 수 있습니다.",
      "example_en": "If you place a bulk order, we can lower the unit price by 10%.",
      "notes": "Collocates with 인하, 인상, 산출하다. Related: 소비자가 (retail price), 도매가 (wholesale price). Key negotiation keyword."
    },
    {
      "korean": "홍보",
      "english": "public relations; publicity; promotion",
      "example": "신제품 출시에 맞춰 대대적인 홍보 캠페인을 벌였다.",
      "example_en": "A large-scale PR campaign was launched to coincide with the new product release.",
      "notes": "Collocates with 활동, 캠페인, 자료. Related: 마케팅, 광고 (advertising), PR. Very common in business Korean."
    },
    {
      "korean": "입찰하다",
      "english": "to bid; to submit a tender",
      "example": "이번 공공사업에 다섯 개 업체가 입찰했다.",
      "example_en": "Five companies submitted bids for this public project.",
      "notes": "Collocates with 공공사업, 참여하다. Related: 낙찰 (winning bid), 유찰 (failed auction), 경쟁 입찰 (competitive bidding)."
    },
    {
      "korean": "판촉",
      "english": "sales promotion; promotional activity",
      "example": "연말 판촉 행사 덕분에 매출이 전월 대비 40% 올랐다.",
      "example_en": "Thanks to the year-end sales promotion, revenue rose 40% month-over-month.",
      "notes": "Short for 판매 촉진 (sales promotion). Collocates with 행사, 활동, 물품. Related: 프로모션, 세일, 할인 (discount)."
    },
    {
      "korean": "시장 점유율",
      "english": "market share",
      "example": "올해 목표는 시장 점유율을 5%포인트 높이는 것입니다.",
      "example_en": "This year's goal is to increase our market share by 5 percentage points.",
      "notes": "Collocates with 높이다, 확대하다. Related: 업계 1위 (industry leader), 경쟁력 (competitiveness). Key KPI for companies."
    },
    {
      "korean": "경쟁사",
      "english": "competitor; rival company",
      "example": "경쟁사가 파격적인 가격으로 시장에 진입해서 긴장하고 있다.",
      "example_en": "We are on edge because a competitor entered the market with aggressive pricing.",
      "notes": "Collocates with 분석, 동향. Related: 경쟁 우위 (competitive advantage), 차별화 (differentiation). Business strategy term."
    },
    {
      "korean": "매입하다",
      "english": "to purchase; to procure; to buy in",
      "example": "원자재를 저가에 대량으로 매입하여 원가를 절감했다.",
      "example_en": "We reduced costs by purchasing raw materials in bulk at a low price.",
      "notes": "Opposite: 매출하다 (to sell). Collocates with 대량, 원자재. Related: 매입가 (purchase price), 조달 (procurement)."
    }
  ]
}
