{
  "주제별 단어 — 과학 (Topic: Science)": [
    {
      "korean": "중력",
      "english": "gravity; gravitational force",
      "example": "달의 중력은 지구의 약 6분의 1에 불과하다.",
      "example_en": "The Moon's gravity is only about one-sixth of Earth's.",
      "notes": "Sino-Korean 重力. Collocates with 작용하다, 영향. Related: 무중력 (zero gravity), 만유인력 (universal gravitation)."
    },
    {
      "korean": "마찰",
      "english": "friction",
      "example": "표면 간의 마찰을 줄이면 에너지 효율이 높아진다.",
      "example_en": "Reducing friction between surfaces increases energy efficiency.",
      "notes": "Collocates with 력 (friction force), 줄이다. Also figurative: 마찰을 빚다 (cause friction/conflict between people)."
    },
    {
      "korean": "파동",
      "english": "wave (physics)",
      "example": "빛은 파동과 입자의 성질을 동시에 지닌다.",
      "example_en": "Light possesses the properties of both a wave and a particle.",
      "notes": "Collocates with 에너지, 함수. Types: 음파 (sound wave), 전자기파 (electromagnetic). Also figurative: 파동을 일으키다 (cause a stir)."
    },
    {
      "korean": "밀도",
      "english": "density",
      "example": "해수의 밀도는 온도와 염분에 따라 달라진다.",
      "example_en": "The density of seawater varies depending on temperature and salinity.",
      "notes": "Collocates with 높다/낮다, 인구 (population density). Related: 비중 (specific gravity), 농도 (concentration). Physics and geography."
    },
    {
      "korean": "가속도",
      "english": "acceleration",
      "example": "자유 낙하하는 물체의 가속도는 약 9.8m/s²이다.",
      "example_en": "The acceleration of a freely falling object is approximately 9.8 m/s².",
      "notes": "Compound: 가속 (acceleration) + 도 (degree). Also figurative: 가속도가 붙다 means gaining speed or momentum rapidly."
    },
    {
      "korean": "촉매",
      "english": "catalyst",
      "example": "효소는 생체 내 화학 반응의 촉매 역할을 한다.",
      "example_en": "Enzymes act as catalysts for chemical reactions within the body.",
      "notes": "Collocates with 역할, 작용. Also figurative: 촉매제 역할을 하다 (act as a catalyst). Related: 효소 (enzyme)."
    },
    {
      "korean": "용해",
      "english": "dissolution; dissolving",
      "example": "소금이 물에 용해되는 속도는 온도가 높을수록 빨라진다.",
      "example_en": "The rate at which salt dissolves in water increases with higher temperature.",
      "notes": "Collocates with 되다, 시키다, 속도. Related: 용액 (solution), 용질 (solute), 용매 (solvent). Chemistry terminology."
    },
    {
      "korean": "원소",
      "english": "chemical element",
      "example": "현재까지 발견된 원소는 총 118종이다.",
      "example_en": "A total of 118 elements have been discovered to date.",
      "notes": "Collocates with 기호, 주기율표 (periodic table). Related: 화합물 (compound), 분자 (molecule), 원자 (atom)."
    },
    {
      "korean": "굴절",
      "english": "refraction",
      "example": "물속에 있는 빨대가 꺾여 보이는 것은 빛의 굴절 때문이다.",
      "example_en": "A straw appearing bent in water is due to the refraction of light.",
      "notes": "Collocates with 률 (refractive index), 각도. Related: 반사 (reflection), 회절 (diffraction). Also figurative: 사실의 굴절."
    },
    {
      "korean": "방사능",
      "english": "radioactivity",
      "example": "원전 사고 이후 인근 지역의 방사능 수치를 지속적으로 모니터링하고 있다.",
      "example_en": "Radioactivity levels in the surrounding area have been continuously monitored since the nuclear plant accident.",
      "notes": "Collocates with 오염, 누출, 수치. Related: 방사선 (radiation), 방사성 물질 (radioactive material), 원자력 (nuclear power)."
    },
    {
      "korean": "광합성",
      "english": "photosynthesis",
      "example": "식물은 광합성을 통해 이산화탄소를 산소로 변환한다.",
      "example_en": "Plants convert carbon dioxide into oxygen through photosynthesis.",
      "notes": "Compound: 광 (light) + 합성 (synthesis). Collocates with 하다, 과정. Related: 엽록소 (chlorophyll), 이산화탄소 (CO2)."
    },
    {
      "korean": "신진대사",
      "english": "metabolism",
      "example": "나이가 들수록 신진대사가 느려져 체중 관리가 어려워진다.",
      "example_en": "As we age, metabolism slows down, making weight management more difficult.",
      "notes": "Collocates with 활발하다, 높이다. Related: 기초대사량 (basal metabolic rate). Common in daily health talk, not just academic."
    },
    {
      "korean": "서식지",
      "english": "habitat",
      "example": "도시 확장으로 인해 야생 동물의 서식지가 빠르게 줄어들고 있다.",
      "example_en": "Urban expansion is rapidly shrinking the habitats of wild animals.",
      "notes": "Collocates with 파괴, 보호, 잃다. Related: 생태계 (ecosystem), 야생 동물 (wildlife). Environmental science keyword."
    },
    {
      "korean": "멸종",
      "english": "extinction",
      "example": "기후 변화로 전 세계적으로 수많은 종이 멸종 위기에 처해 있다.",
      "example_en": "Climate change has put countless species worldwide on the brink of extinction.",
      "notes": "Collocates with 위기, 되다, 시키다. Compounds: 멸종 위기종 (endangered species), 대멸종 (mass extinction). Conservation term."
    },
    {
      "korean": "미생물",
      "english": "microorganism; microbe",
      "example": "장내 미생물의 균형이 전반적인 건강에 큰 영향을 미친다.",
      "example_en": "The balance of gut microorganisms has a significant impact on overall health.",
      "notes": "Compound: 미 (micro) + 생물 (organism). Related: 세균 (bacteria), 바이러스 (virus), 곰팡이 (fungus). Biology basic term."
    },
    {
      "korean": "유전자",
      "english": "gene",
      "example": "유전자 편집 기술의 윤리적 한계에 대한 논의가 활발하다.",
      "example_en": "There is active debate about the ethical limits of gene-editing technology.",
      "notes": "Collocates with 편집, 변이, 분석. Compounds: 유전자 검사 (genetic testing), 유전자 치료 (gene therapy). Hot science topic."
    },
    {
      "korean": "생물 다양성",
      "english": "biodiversity",
      "example": "열대 우림은 지구 생물 다양성의 보고로 알려져 있다.",
      "example_en": "Tropical rainforests are known as a treasure trove of Earth's biodiversity.",
      "notes": "Collocates with 보전, 감소, 위협. Related: 생태계 (ecosystem), 서식지 (habitat). UN Sustainable Development Goals keyword."
    },
    {
      "korean": "배출량",
      "english": "emissions (amount discharged)",
      "example": "각국은 탄소 배출량을 줄이기 위해 다양한 정책을 시행하고 있다.",
      "example_en": "Countries are implementing various policies to reduce carbon emissions.",
      "notes": "Collocates with 탄소, 줄이다, 규제. Related: 온실가스 (greenhouse gas), 탄소 중립 (carbon neutrality). Environmental policy term."
    },
    {
      "korean": "생분해",
      "english": "biodegradation",
      "example": "생분해가 가능한 포장재가 기존 플라스틱을 빠르게 대체하고 있다.",
      "example_en": "Biodegradable packaging materials are rapidly replacing conventional plastics.",
      "notes": "Compound: 생 (bio) + 분해 (decomposition). Collocates with 가능한, 플라스틱. Related: 퇴비화 (composting), 재활용 (recycling)."
    },
    {
      "korean": "돌연변이",
      "english": "mutation",
      "example": "바이러스의 돌연변이가 잦아지면서 새로운 변이 주가 계속 출현하고 있다.",
      "example_en": "With frequent viral mutations, new variant strains keep emerging.",
      "notes": "Compound: 돌연 (sudden) + 변이 (variation). Collocates with 일으키다, 발생하다. Related: 변이 주 (variant strain), DNA."
    },
    {
      "korean": "인공지능",
      "english": "artificial intelligence (AI)",
      "example": "인공지능이 의료 영상 판독에서 전문의 수준의 정확도를 보이고 있다.",
      "example_en": "Artificial intelligence is showing specialist-level accuracy in medical image interpretation.",
      "notes": "Abbreviated AI. Collocates with 기술, 활용, 개발. Related: 머신러닝, 딥러닝, 자연어 처리. Top tech buzzword in Korea."
    },
    {
      "korean": "반도체",
      "english": "semiconductor",
      "example": "한국은 세계 반도체 시장에서 핵심적인 위치를 차지하고 있다.",
      "example_en": "Korea holds a pivotal position in the global semiconductor market.",
      "notes": "Korea's key export industry. Collocates with 산업, 수출, 칩. Companies: 삼성전자, SK하이닉스. Related: 파운드리 (foundry)."
    },
    {
      "korean": "자동화",
      "english": "automation",
      "example": "공장 자동화로 생산성은 높아졌지만 일자리 감소가 우려된다.",
      "example_en": "Factory automation has increased productivity, but job losses are a concern.",
      "notes": "Collocates with 공장, 시스템, 도입하다. Related: 로봇, RPA (robotic process automation). Manufacturing and office contexts."
    },
    {
      "korean": "연산",
      "english": "computation; arithmetic operation",
      "example": "양자 컴퓨터는 기존 컴퓨터보다 특정 연산을 수백만 배 빠르게 처리한다.",
      "example_en": "Quantum computers process certain computations millions of times faster than conventional ones.",
      "notes": "Collocates with 속도, 처리, 능력. Related: 알고리즘, 처리 장치 (processor). Also basic math: 사칙연산 (four operations)."
    },
    {
      "korean": "복호화",
      "english": "decryption; decoding",
      "example": "전송된 데이터를 복호화해야 원래 내용을 확인할 수 있다.",
      "example_en": "The transmitted data must be decrypted to view the original content.",
      "notes": "Opposite: 암호화 (encryption). Collocates with 하다, 키 (key). Related: 보안 (security), 해독 (deciphering). Cybersecurity term."
    },
    {
      "korean": "자율주행",
      "english": "autonomous driving; self-driving",
      "example": "자율주행 기술이 상용화되면 교통사고가 크게 줄어들 것으로 전망된다.",
      "example_en": "Once autonomous driving technology is commercialized, traffic accidents are expected to decrease significantly.",
      "notes": "Collocates with 차, 기술, 상용화. Levels: 1~5단계. Related: 라이다 (LiDAR), 센서 (sensor). Hot automotive tech topic."
    },
    {
      "korean": "증강현실",
      "english": "augmented reality (AR)",
      "example": "증강현실 기술을 활용한 교육 콘텐츠가 학생들의 이해도를 높이고 있다.",
      "example_en": "Educational content utilizing augmented reality technology is enhancing student comprehension.",
      "notes": "Abbreviated AR. Collocates with 기술, 활용. Related: 가상현실 VR, 혼합현실 MR, 메타버스. Consumer technology term."
    },
    {
      "korean": "초전도체",
      "english": "superconductor",
      "example": "상온 초전도체 개발에 성공한다면 에너지 산업에 혁명이 일어날 것이다.",
      "example_en": "If a room-temperature superconductor is successfully developed, it will revolutionize the energy industry.",
      "notes": "Compound: 초 (super) + 전도체 (conductor). Collocates with 상온, 개발. Was big Korean news in 2023. Related: 저항 (resistance)."
    },
    {
      "korean": "양자역학",
      "english": "quantum mechanics",
      "example": "양자역학의 원리는 일상적인 직관과 크게 어긋나는 경우가 많다.",
      "example_en": "The principles of quantum mechanics often greatly defy everyday intuition.",
      "notes": "Collocates with 원리, 이론. Related: 양자 컴퓨터, 불확정성 원리 (uncertainty principle). Advanced physics terminology."
    },
    {
      "korean": "정보보안",
      "english": "information security; cybersecurity",
      "example": "기업의 정보보안 투자가 해마다 증가하고 있다.",
      "example_en": "Corporate investment in information security is increasing every year.",
      "notes": "Collocates with 위협, 강화하다. Related: 해킹 (hacking), 방화벽 (firewall), 개인정보 보호 (privacy protection)."
    },
    {
      "korean": "표본",
      "english": "sample; specimen",
      "example": "연구진은 전국에서 수집한 5,000개의 표본을 분석했다.",
      "example_en": "The research team analyzed 5,000 specimens collected from across the country.",
      "notes": "Collocates with 수집하다, 분석하다. Related: 샘플, 표본 조사 (sample survey). Used in statistics and biology contexts."
    },
    {
      "korean": "대조군",
      "english": "control group",
      "example": "실험 결과의 신뢰도를 높이려면 적절한 대조군 설정이 필수적이다.",
      "example_en": "Setting up an appropriate control group is essential to increase the reliability of experimental results.",
      "notes": "Opposite: 실험군 (experimental group). Collocates with 설정하다, 비교하다. Essential in clinical trials and experiments."
    },
    {
      "korean": "재현성",
      "english": "reproducibility",
      "example": "재현성이 확보되지 않은 연구 결과는 학계에서 인정받기 어렵다.",
      "example_en": "Research results without established reproducibility are difficult to gain recognition in academia.",
      "notes": "Collocates with 확보하다, 부족하다. Related: 반복 실험, 신뢰도 (reliability). Key criterion for valid scientific research."
    },
    {
      "korean": "학제간",
      "english": "interdisciplinary",
      "example": "기후 위기 대응은 학제간 협력 없이는 해결하기 어렵다.",
      "example_en": "Addressing the climate crisis is difficult to solve without interdisciplinary collaboration.",
      "notes": "Collocates with 연구, 협력. Related: 융합 연구 (convergence research), 다학제 (multidisciplinary). Academic research trend."
    },
    {
      "korean": "정량적",
      "english": "quantitative",
      "example": "정량적 분석을 통해 두 변수 간의 상관관계를 수치로 입증했다.",
      "example_en": "Through quantitative analysis, the correlation between the two variables was numerically demonstrated.",
      "notes": "Opposite: 정성적 (qualitative). Collocates with 분석, 데이터, 평가. Related: 수치화 (quantification). Research methodology term."
    },
    {
      "korean": "편향",
      "english": "bias; skew",
      "example": "연구자의 편향이 실험 설계에 무의식적으로 영향을 줄 수 있다.",
      "example_en": "A researcher's bias can unconsciously influence the experimental design.",
      "notes": "Collocates with 확인 (confirmation bias), 선택 (selection bias). Related: 왜곡 (distortion), 객관성 (objectivity). Research and media."
    },
    {
      "korean": "귀납법",
      "english": "inductive reasoning; induction",
      "example": "귀납법은 개별 관찰에서 일반적인 법칙을 이끌어내는 추론 방식이다.",
      "example_en": "Induction is a reasoning method that derives general laws from individual observations.",
      "notes": "Opposite: 연역법. Direction: specific observations to general rule. Collocates with 추론, 방식. Philosophy and science methodology."
    },
    {
      "korean": "연역법",
      "english": "deductive reasoning; deduction",
      "example": "연역법은 전제가 참이면 결론도 반드시 참이 되는 논리 구조를 따른다.",
      "example_en": "Deduction follows a logical structure where, if the premises are true, the conclusion must also be true.",
      "notes": "Opposite: 귀납법. Direction: general rule to specific conclusion. Collocates with 추론, 논리. Philosophy and science methodology."
    },
    {
      "korean": "표절",
      "english": "plagiarism",
      "example": "유명 교수의 논문 표절 사실이 밝혀져 학계가 발칵 뒤집혔다.",
      "example_en": "The academic world was turned upside down when a prominent professor's plagiarism was revealed.",
      "notes": "Collocates with 검사, 의혹, 판정. Related: 저작권 (copyright), 인용 (citation). Serious academic and literary offense in Korea."
    },
    {
      "korean": "학술지",
      "english": "academic journal; scholarly journal",
      "example": "이 연구는 세계적으로 권위 있는 학술지에 게재되었다.",
      "example_en": "This research was published in a globally prestigious academic journal.",
      "notes": "Collocates with 게재하다, 투고하다 (submit). Related: 논문 (paper), 동료 심사 (peer review), 인용 지수 (impact factor)."
    }
  ]
}