{
  "주제별 단어 — 교통 (Topic: Transportation)": [
    {
      "korean": "환승",
      "english": "transfer (between transit lines); interchange",
      "example": "이 역에서 2호선으로 환승하면 세 정거장 만에 도착한다.",
      "example_en": "If you transfer to Line 2 at this station, you'll arrive in just three stops.",
      "notes": "環乘 (Sino-Korean: environment + ride). Collocations: 환승하다, 환승 구간. Related: 갈아타다."
    },
    {
      "korean": "배차 간격",
      "english": "service interval; headway between buses/trains",
      "example": "출퇴근 시간에는 배차 간격이 2분으로 줄어든다.",
      "example_en": "During rush hours, the service interval is reduced to 2 minutes.",
      "notes": "Service frequency term. Related: 배차간격 줄이다, 운행 간격. Natural in: 배차 간격이 5분이다."
    },
    {
      "korean": "첫차",
      "english": "first train/bus of the day",
      "example": "첫차를 타려면 새벽 5시에는 역에 도착해야 한다.",
      "example_en": "To catch the first train, you need to arrive at the station by 5 AM.",
      "notes": "Opposite: 막차 (last). Collocations: 첫차를 타다, 첫차를 놓치다. Common in commute context."
    },
    {
      "korean": "막차",
      "english": "last train/bus of the day",
      "example": "막차를 놓치면 택시를 타거나 심야버스를 이용해야 한다.",
      "example_en": "If you miss the last train, you have to take a taxi or use the late-night bus.",
      "notes": "Opposite: 첫차 (first). Collocations: 막차를 놓치다, 막차를 타다. Often followed by transport mode."
    },
    {
      "korean": "노선",
      "english": "route; transit line; course",
      "example": "새로운 버스 노선이 신설되면서 통학이 한결 편해졌다.",
      "example_en": "Commuting to school became much easier with the new bus route.",
      "notes": "路線 (Sino-Korean: road + line). Collocations: 노선을 신설하다, 버스 노선. Related: 노선도 (route map)."
    },
    {
      "korean": "교통카드",
      "english": "transit card; transportation card (T-money etc.)",
      "example": "교통카드를 충전하지 않으면 지하철을 탈 수 없다.",
      "example_en": "You can't ride the subway if you haven't charged your transit card.",
      "notes": "Modern term. Collocations: 교통카드를 충전하다, 충전하다. Korean cards: T-money, Cashbee."
    },
    {
      "korean": "혼잡",
      "english": "congestion; crowding; overcrowding",
      "example": "출근 시간 지하철 혼잡도가 200%를 넘기기도 한다.",
      "example_en": "During morning rush hour, subway congestion can exceed 200% capacity.",
      "notes": "混雜 (Sino-Korean: mix + disorder). Collocations: 혼잡도, 혼잡하다. Related: 혼잡 시간대."
    },
    {
      "korean": "정류장",
      "english": "bus stop; station; stop",
      "example": "다음 정류장에서 내리면 병원이 바로 앞이에요.",
      "example_en": "If you get off at the next stop, the hospital is right in front of you.",
      "notes": "停留場 (Sino-Korean: stop + stay + place). Collocations: 다음 정류장, 정류장에서 내리다. Related: 버스정류장."
    },
    {
      "korean": "광역버스",
      "english": "express bus; metropolitan bus (between cities)",
      "example": "경기도에서 서울까지 광역버스로 출퇴근하는 사람이 수십만 명이다.",
      "example_en": "Hundreds of thousands of people commute from Gyeonggi Province to Seoul by express bus.",
      "notes": "Long-distance commute buses. Collocations: 광역버스를 타다, 광역버스 이용. Prefixed with colors/numbers."
    },
    {
      "korean": "전용차로",
      "english": "dedicated lane; bus-only lane",
      "example": "버스 전용차로 덕분에 출퇴근 시간에도 버스가 빠르게 운행된다.",
      "example_en": "Thanks to bus-only lanes, buses run quickly even during rush hours.",
      "notes": "Dedicated traffic lane. Collocations: 버스 전용차로, 전용차로를 침범하다. Related: 차선 (lane)."
    },
    {
      "korean": "차선",
      "english": "lane (on a road); traffic lane",
      "example": "고속도로에서 1차선은 추월 차선으로 지정되어 있다.",
      "example_en": "On the highway, the first lane is designated as the passing lane.",
      "notes": "車線 (Sino-Korean: vehicle + line). Collocations: 차선을 바꾸다, 1차선, 오른쪽/왼쪽 차선."
    },
    {
      "korean": "교차로",
      "english": "intersection; crossroads; junction",
      "example": "이 교차로는 사고가 잦아서 신호등이 추가 설치됐다.",
      "example_en": "This intersection had frequent accidents, so additional traffic lights were installed.",
      "notes": "交叉路 (Sino-Korean: cross + fork + road). Collocations: 교차로에서, 교차로를 지나다. Related: 신호등."
    },
    {
      "korean": "과속",
      "english": "speeding; exceeding the speed limit",
      "example": "과속 단속 카메라에 찍히면 벌점과 함께 범칙금이 부과된다.",
      "example_en": "If caught by a speed camera, you receive demerit points along with a traffic fine.",
      "notes": "過速 (Sino-Korean: exceed + speed). Collocations: 과속으로 달리다, 과속 단속. Related: 속도 위반."
    },
    {
      "korean": "역주행",
      "english": "driving the wrong way; going against traffic",
      "example": "고속도로 역주행은 대형 사고로 이어지는 극히 위험한 행위다.",
      "example_en": "Driving the wrong way on the highway is an extremely dangerous act that leads to major accidents.",
      "notes": "Native compound: 역 (reverse) + 주행 (driving). Extremely dangerous act. Collocations: 역주행하다, 역주행 사고."
    },
    {
      "korean": "음주운전",
      "english": "drunk driving; DUI",
      "example": "음주운전 처벌이 강화되면서 대리운전 이용이 크게 늘었다.",
      "example_en": "As drunk driving penalties were strengthened, the use of designated driver services increased significantly.",
      "notes": "Drinking + driving. Related: 대리운전 (designated driver service). Collocations: 음주운전 적발, 음주운전 처벌."
    },
    {
      "korean": "내비게이션",
      "english": "navigation; GPS navigation system",
      "example": "내비게이션이 막히지 않는 우회 경로를 안내해 줬다.",
      "example_en": "The navigation system guided me through an alternate route without traffic.",
      "notes": "Loanword: navigation. Collocations: 내비게이션을 켜다, 내비게이션 설정. Korean: GPS, 네비."
    },
    {
      "korean": "갓길",
      "english": "road shoulder; hard shoulder",
      "example": "차가 고장 나면 갓길에 세우고 비상등을 켜야 한다.",
      "example_en": "If your car breaks down, you should pull over to the shoulder and turn on the hazard lights.",
      "notes": "Native Korean: 갓 (edge) + 길 (road). Collocations: 갓길에 세우다, 갓길 주차. Related: 도로 어깨."
    },
    {
      "korean": "톨게이트",
      "english": "tollgate; toll booth",
      "example": "하이패스 단말기가 있으면 톨게이트에서 멈추지 않고 통과할 수 있다.",
      "example_en": "With a Hi-pass device, you can pass through the tollgate without stopping.",
      "notes": "Toll + gate (loanword). Collocations: 톨게이트를 통과하다, 하이패스 (Hi-pass system)."
    },
    {
      "korean": "정체",
      "english": "traffic jam; standstill; gridlock",
      "example": "명절 연휴마다 고속도로 정체가 극심해진다.",
      "example_en": "Highway traffic jams become severe every holiday season.",
      "notes": "停滯 (Sino-Korean: stop + stagnate). Collocations: 정체가 심하다, 정체되다. Related: 교통 정체."
    },
    {
      "korean": "우회도로",
      "english": "bypass road; detour; alternate route",
      "example": "공사 중이라 우회도로로 돌아가야 해서 30분이 더 걸렸다.",
      "example_en": "Due to construction, we had to take a detour, which added 30 minutes.",
      "notes": "Detour + road. Collocations: 우회도로로 가다, 우회도로를 이용하다. Related: 돌아가다."
    },
    {
      "korean": "물류",
      "english": "logistics; distribution; freight",
      "example": "전자상거래의 성장으로 물류 산업이 급속도로 발전하고 있다.",
      "example_en": "With the growth of e-commerce, the logistics industry is developing rapidly.",
      "notes": "物流 (Sino-Korean: things + flow). Collocations: 물류 산업, 물류 센터. Related: 유통."
    },
    {
      "korean": "컨테이너",
      "english": "container; shipping container",
      "example": "부산항에는 하루에 수만 개의 컨테이너가 오간다.",
      "example_en": "Tens of thousands of containers pass through Busan Port daily.",
      "notes": "Container (loanword). Collocations: 컨테이너 선박, 컨테이너 터미널. Related: 화물."
    },
    {
      "korean": "화물",
      "english": "freight; cargo; goods",
      "example": "화물 트럭의 과적이 도로 파손의 주요 원인이다.",
      "example_en": "Overloading of freight trucks is a major cause of road damage.",
      "notes": "貨物 (Sino-Korean: goods + goods). Collocations: 화물 차량, 화물 운송. Related: 짐, 물건."
    },
    {
      "korean": "항만",
      "english": "port; harbor; seaport",
      "example": "인천 항만은 수도권 물류의 핵심 거점이다.",
      "example_en": "Incheon port is a key hub for logistics in the metropolitan area.",
      "notes": "港灣 (Sino-Korean: harbor + bay). Collocations: 항만 시설, 항만 운영. Related: 항구, 포구."
    },
    {
      "korean": "하역",
      "english": "unloading; loading and unloading (cargo)",
      "example": "항구에서 하역 작업이 끝나기까지 꼬박 이틀이 걸렸다.",
      "example_en": "It took a full two days for the unloading work at the port to be completed.",
      "notes": "荷役 (Sino-Korean: cargo + work). Collocations: 하역 작업, 하역 비용. Related: 짐을 싣다/내리다."
    },
    {
      "korean": "택배",
      "english": "delivery service; parcel delivery; courier",
      "example": "한국의 택배 시스템은 당일 배송까지 가능할 정도로 빠르다.",
      "example_en": "Korea's delivery system is so fast that same-day delivery is possible.",
      "notes": "擇配 (Sino-Korean: select + distribute). Collocations: 택배를 보내다, 택배 서비스. Related: 배송, 배달."
    },
    {
      "korean": "운송",
      "english": "transport; shipping; conveyance",
      "example": "냉장 운송 기술 발달로 신선식품의 전국 배송이 가능해졌다.",
      "example_en": "With advances in refrigerated transport technology, nationwide delivery of fresh food became possible.",
      "notes": "運送 (Sino-Korean: transport + convey). Collocations: 운송 수단, 냉장 운송. Related: 배송, 배달."
    },
    {
      "korean": "수출입",
      "english": "import and export; trade",
      "example": "부산항은 한국 수출입 화물의 70% 이상을 처리한다.",
      "example_en": "Busan Port handles more than 70% of Korea's import and export cargo.",
      "notes": "輸出入 (Sino-Korean: convey + out + in). Collocations: 수출입 화물, 수출입 관세. Related: 국제 무역."
    },
    {
      "korean": "유통",
      "english": "distribution; circulation (of goods)",
      "example": "중간 유통 단계를 줄이면 소비자 가격을 낮출 수 있다.",
      "example_en": "Reducing intermediate distribution stages can lower consumer prices.",
      "notes": "流通 (Sino-Korean: flow + circulation). Collocations: 유통 단계, 유통 경로. Related: 배급, 분배."
    },
    {
      "korean": "공급망",
      "english": "supply chain",
      "example": "코로나 이후 글로벌 공급망 재편이 가속화되고 있다.",
      "example_en": "Reorganization of the global supply chain has been accelerating since COVID.",
      "notes": "Supply + chain. Modern term. Collocations: 공급망 재편, 글로벌 공급망. Related: 공급, 수요."
    },
    {
      "korean": "교통사고",
      "english": "traffic accident; car crash",
      "example": "교통사고 사망자 수가 10년 전에 비해 절반으로 줄었다.",
      "example_en": "The number of traffic accident fatalities has been halved compared to 10 years ago.",
      "notes": "Traffic + accident. Collocations: 교통사고가 발생하다, 교통사고로 다치다. Related: 사건, 사고."
    },
    {
      "korean": "추돌",
      "english": "rear-end collision; tailgating crash",
      "example": "안개가 짙은 날 고속도로에서 연쇄 추돌 사고가 발생했다.",
      "example_en": "A chain rear-end collision occurred on the highway on a foggy day.",
      "notes": "追突 (Sino-Korean: follow + strike). Rear-end collision. Collocations: 추돌 사고, 연쇄 추돌."
    },
    {
      "korean": "접촉사고",
      "english": "fender bender; minor collision",
      "example": "주차장에서 접촉사고가 나서 보험 처리를 했다.",
      "example_en": "I had a fender bender in the parking lot and filed an insurance claim.",
      "notes": "Contact + accident. Minor collision. Collocations: 접촉사고를 내다, 접촉사고 처리."
    },
    {
      "korean": "블랙박스",
      "english": "dashcam; black box (vehicle camera)",
      "example": "블랙박스 영상 덕분에 사고 과실 비율을 정확히 판단할 수 있었다.",
      "example_en": "Thanks to the dashcam footage, the fault ratio for the accident could be determined accurately.",
      "notes": "Black box (loanword). Vehicle dashcam. Collocations: 블랙박스 영상, 블랙박스 조회."
    },
    {
      "korean": "신호위반",
      "english": "running a red light; traffic signal violation",
      "example": "신호위반으로 적발되면 벌점 15점이 부과된다.",
      "example_en": "If caught running a red light, 15 demerit points are imposed.",
      "notes": "Signal + violation. Collocations: 신호위반으로 적발되다, 신호위반 벌금. Related: 빨간불 무시."
    },
    {
      "korean": "뺑소니",
      "english": "hit-and-run (accident)",
      "example": "뺑소니 사고 후 도주한 운전자가 CCTV를 통해 검거됐다.",
      "example_en": "The driver who fled after the hit-and-run was caught through CCTV.",
      "notes": "Native Korean onomatopoeia for hit-and-run. Collocations: 뺑소니를 저지르다, 뺑소니 피해."
    },
    {
      "korean": "보행자",
      "english": "pedestrian; person on foot",
      "example": "횡단보도에서는 항상 보행자가 우선이다.",
      "example_en": "At crosswalks, pedestrians always have the right of way.",
      "notes": "步行者 (Sino-Korean: walk + person). Collocations: 보행자 우선, 보행자 신호. Related: 행인."
    },
    {
      "korean": "견인",
      "english": "towing; vehicle towing",
      "example": "불법 주차 차량이 견인되면 반환 수수료를 내야 한다.",
      "example_en": "If an illegally parked vehicle is towed, you have to pay a retrieval fee.",
      "notes": "牽引 (Sino-Korean: lead + pull). Vehicle towing. Collocations: 견인되다, 견인차, 견인 비용."
    },
    {
      "korean": "보험료",
      "english": "insurance premium (vehicle/accident)",
      "example": "무사고 기간이 길어질수록 자동차 보험료가 할인된다.",
      "example_en": "The longer your accident-free period, the more your car insurance premium is discounted.",
      "notes": "Insurance + fee. Collocations: 보험료를 내다, 보험료 할인. Related: 보험, 요금."
    },
    {
      "korean": "사각지대",
      "english": "blind spot; dead zone (traffic)",
      "example": "대형 차량의 사각지대에서 발생하는 사고가 매년 증가하고 있다.",
      "example_en": "Accidents occurring in the blind spots of large vehicles are increasing every year.",
      "notes": "四角地帯 (Sino-Korean: four corners + zone). Blind spot. Collocations: 사각지대에 있다, 사각지대 사고."
    }
  ]
}