{
  "주제별 단어 — 요리 (Topic: Cooking)": [
    {
      "korean": "볶다",
      "english": "to stir-fry; to saute",
      "example": "센 불에서 야채를 빠르게 볶아야 아삭한 식감이 살아난다.",
      "example_en": "You need to quickly stir-fry the vegetables over high heat to keep them crispy.",
      "notes": "Often paired with 센 불 (high heat) for vegetables. Related: 덮밥, 계란볶음밥. Tip: stir constantly for even cooking."
    },
    {
      "korean": "조리다",
      "english": "to simmer; to braise (in sauce)",
      "example": "간장 양념에 감자를 조리면 밑반찬으로 좋다.",
      "example_en": "Simmering potatoes in soy sauce seasoning makes a great side dish.",
      "notes": "Common with 장조림, 감자조림. Sino-Korean: 調 (arrange/adjust). Collocation: 장 양념에 조리다."
    },
    {
      "korean": "데치다",
      "english": "to blanch; to parboil",
      "example": "시금치를 끓는 물에 살짝 데쳐서 나물을 만들었다.",
      "example_en": "I blanched the spinach briefly in boiling water and made namul.",
      "notes": "Preliminary step before making 나물 (namul). Related: 삶다 (boil), 살짝 데치다 (blanch briefly)."
    },
    {
      "korean": "절이다",
      "english": "to pickle; to salt; to brine",
      "example": "배추를 소금에 절이는 것이 김치 만들기의 첫 단계이다.",
      "example_en": "Salting the napa cabbage is the first step in making kimchi.",
      "notes": "Essential for 김치, 무 장아찌. Sino-Korean: 漬 (soak). Collocation: 소금에 절이다."
    },
    {
      "korean": "숙성시키다",
      "english": "to age; to ferment; to mature",
      "example": "된장은 최소 6개월 이상 숙성시켜야 깊은 맛이 난다.",
      "example_en": "Doenjang needs to be aged for at least six months to develop a deep flavor.",
      "notes": "Used for 된장, 고추장, fermented foods. Sino-Korean: 熟 (ripe/mature), 成 (become). Takes months/years."
    },
    {
      "korean": "졸이다",
      "english": "to reduce (a sauce); to boil down",
      "example": "소스를 약한 불에 졸여서 농도를 맞추세요.",
      "example_en": "Reduce the sauce over low heat to adjust the consistency.",
      "notes": "Reduces liquid to concentrate flavor. Often with 약한 불 (low heat). Related: 육수 졸이다."
    },
    {
      "korean": "무치다",
      "english": "to toss; to mix (vegetables with seasoning)",
      "example": "콩나물을 참기름과 소금으로 무쳐서 반찬을 만들었다.",
      "example_en": "I tossed the bean sprouts with sesame oil and salt to make a side dish.",
      "notes": "Mix vegetables with 양념. Collocation: 참기름으로 무치다, 고추장으로 무치다."
    },
    {
      "korean": "튀기다",
      "english": "to deep-fry",
      "example": "새우를 바삭하게 튀기려면 기름 온도가 중요하다.",
      "example_en": "The oil temperature is important for deep-frying shrimp until crispy.",
      "notes": "Requires precise oil temperature (170-180°C). Related: 바삭한 (crispy), 기름 온도."
    },
    {
      "korean": "쪄내다",
      "english": "to steam (food until done)",
      "example": "만두를 찜기에 넣고 15분간 쪄냈다.",
      "example_en": "I put the dumplings in the steamer and steamed them for 15 minutes.",
      "notes": "Also written as 찐다. Common: 만두 쪄내다, 계란 쪄내다. Cooking method using 찜기 (steamer)."
    },
    {
      "korean": "삶다",
      "english": "to boil (ingredients)",
      "example": "돼지고기를 삶아서 보쌈을 만들었다.",
      "example_en": "I boiled pork to make bossam.",
      "notes": "Boiling for tenderness/cleanliness. Related: 데치다 (blanch), 우리다. Collocation: 고기를 삶다."
    },
    {
      "korean": "칼",
      "english": "knife; kitchen knife",
      "example": "요리를 잘하려면 먼저 칼을 다루는 법을 배워야 한다.",
      "example_en": "To cook well, you first need to learn how to handle a knife.",
      "notes": "Related tools: 도마 (cutting board), 숌돌 (sharpener). Tip: 칼질 (knife work) affects cooking time."
    },
    {
      "korean": "도마",
      "english": "cutting board",
      "example": "생선과 채소는 별도의 도마를 사용하는 것이 위생적이다.",
      "example_en": "Using separate cutting boards for fish and vegetables is hygienic.",
      "notes": "Used with 칼. Hygienic to separate: 생선용, 채소용 (separate boards for fish/vegetables)."
    },
    {
      "korean": "냄비",
      "english": "pot; saucepan",
      "example": "찌개는 뚝배기보다 냄비에 끓이면 빨리 식는다.",
      "example_en": "Jjigae cools down faster when boiled in a regular pot rather than a stone pot.",
      "notes": "Common types: 양수냄비 (shallow), 국냄비 (tall). Related: 냄비 끓이다 (boil in pot)."
    },
    {
      "korean": "프라이팬",
      "english": "frying pan; skillet",
      "example": "눌어붙지 않는 프라이팬이 있으면 요리가 훨씬 수월하다.",
      "example_en": "Cooking is much easier with a non-stick frying pan.",
      "notes": "Loanword from English 'frying pan'. Related: 눌어붙지 않는 (non-stick), 코팅."
    },
    {
      "korean": "주걱",
      "english": "spatula; rice paddle",
      "example": "나무 주걱으로 저어야 코팅이 벗겨지지 않는다.",
      "example_en": "You should stir with a wooden spatula so the coating doesn't peel off.",
      "notes": "Often wooden (나무 주걱) to preserve non-stick coating. Related: 저어주다 (stir)."
    },
    {
      "korean": "강판",
      "english": "grater",
      "example": "무를 강판에 갈아서 소스에 넣었다.",
      "example_en": "I grated the radish on a grater and added it to the sauce.",
      "notes": "For grating 무 (radish), 생강 (ginger). Related: 갈다 (grate), 곱게 간다 (grate finely)."
    },
    {
      "korean": "체",
      "english": "sieve; strainer",
      "example": "밀가루를 체에 내려야 덩어리 없이 부드러운 반죽이 된다.",
      "example_en": "You need to sift the flour through a sieve for a smooth, lump-free dough.",
      "notes": "For sifting flour, powders. Related: 내려다 (sift), 체에 내리다 (pass through sieve)."
    },
    {
      "korean": "뒤집개",
      "english": "flipper; turner",
      "example": "전을 뒤집개로 살살 뒤집어야 모양이 안 무너진다.",
      "example_en": "You need to gently flip the jeon with a turner so it doesn't fall apart.",
      "notes": "Also called 뒤집게. For flipping 전 (jeon), 계란 (eggs) without breaking."
    },
    {
      "korean": "계량컵",
      "english": "measuring cup",
      "example": "베이킹은 계량컵으로 정확하게 재는 것이 중요하다.",
      "example_en": "In baking, it's important to measure accurately with a measuring cup.",
      "notes": "Essential for baking precision. Related: 계량스푼 (measuring spoon), 정확하게 재다."
    },
    {
      "korean": "찜기",
      "english": "steamer",
      "example": "대나무 찜기에 쪄낸 딤섬이 가장 맛있다.",
      "example_en": "Dim sum steamed in a bamboo steamer is the most delicious.",
      "notes": "Types: 대나무 찜기 (bamboo), 이중냄비 (double boiler). For steaming 만두, 딤섬."
    },
    {
      "korean": "간을 맞추다",
      "english": "to season; to adjust the seasoning",
      "example": "국물 요리는 마지막에 간을 맞추는 것이 핵심이다.",
      "example_en": "The key to soup dishes is adjusting the seasoning at the end.",
      "notes": "Fine-tune seasoning, usually at end of cooking. Related: 밑간, 마무리 간."
    },
    {
      "korean": "감칠맛",
      "english": "umami; savory taste",
      "example": "멸치 육수를 넣으면 감칠맛이 확 살아난다.",
      "example_en": "Adding anchovy broth really brings out the umami flavor.",
      "notes": "Umami flavor. Sino-Korean: 感 (sense), 喝 (flavor). From 멸치, 다시마, 버터."
    },
    {
      "korean": "고소하다",
      "english": "nutty; savory (in a rich way)",
      "example": "참기름을 넣으니까 나물이 훨씬 고소해졌다.",
      "example_en": "Adding sesame oil made the namul much more nutty and savory.",
      "notes": "Rich, nutty taste. From 참기름 (sesame oil), 견과류 (nuts). Related: 풍미."
    },
    {
      "korean": "담백하다",
      "english": "light; mild; clean-tasting",
      "example": "담백한 맛을 원하면 양념을 최소화해야 한다.",
      "example_en": "If you want a light, clean taste, you should minimize the seasoning.",
      "notes": "Light, clean taste. Opposite of 자극적 (stimulating). Collocation: 담백한 국물."
    },
    {
      "korean": "칼칼하다",
      "english": "pleasantly spicy and pungent",
      "example": "해장국은 칼칼해야 속이 풀린다.",
      "example_en": "Hangover soup needs to be pleasantly spicy to settle the stomach.",
      "notes": "Pleasantly pungent/spicy. Common with 해장국 (hangover soup), 라면. Related: 자극적."
    },
    {
      "korean": "느끼하다",
      "english": "greasy; heavy; oily (food)",
      "example": "치킨이 느끼하면 무 피클이랑 같이 먹으면 된다.",
      "example_en": "If the fried chicken tastes greasy, eat it with pickled radish.",
      "notes": "Greasy, heavy. Paired with 무 피클, 막걸리 (neutralizer). Opposite: 담백하다."
    },
    {
      "korean": "새콤달콤하다",
      "english": "sweet and sour",
      "example": "새콤달콤한 소스에 탕수육을 찍어 먹었다.",
      "example_en": "I dipped the tangsuyuk in sweet and sour sauce.",
      "notes": "Sweet-sour balance. Common: 탕수육, 짜장면. Related: 쌍콤한, 산미."
    },
    {
      "korean": "짭짤하다",
      "english": "pleasantly salty; savory",
      "example": "짭짤한 치즈가 와인 안주로 딱이다.",
      "example_en": "Pleasantly salty cheese is perfect as a wine snack.",
      "notes": "Pleasantly salty, savory. Opposite: 싱겁다 (bland). Often describing 치즈, 베이컨."
    },
    {
      "korean": "텁텁하다",
      "english": "rough; coarse; dry-feeling (on the palate)",
      "example": "떫은 감은 먹으면 입이 텁텁해진다.",
      "example_en": "Eating an astringent persimmon makes your mouth feel rough and dry.",
      "notes": "Rough, astringent mouthfeel (from tannins in 떫은 감). Related: 떫다, 떫은맛."
    },
    {
      "korean": "깔끔하다",
      "english": "clean-tasting; refreshing (flavor)",
      "example": "이 소주는 맛이 깔끔해서 음식과 잘 어울린다.",
      "example_en": "This soju has a clean taste that pairs well with food.",
      "notes": "Clean finish without heaviness. Related: 상큼하다 (refreshing), 깔끔한 뒷맛."
    },
    {
      "korean": "밑간",
      "english": "base seasoning; preliminary seasoning (before cooking)",
      "example": "고기에 밑간을 해두면 양념이 잘 배어든다.",
      "example_en": "If you apply base seasoning to the meat beforehand, the flavor absorbs well.",
      "notes": "Base seasoning before cooking. Collocation: 고기에 밑간을 하다. Ensures even flavor absorption."
    },
    {
      "korean": "손질",
      "english": "food preparation; cleaning and trimming ingredients",
      "example": "재료 손질이 요리 시간의 절반을 차지한다.",
      "example_en": "Ingredient preparation takes up half the cooking time.",
      "notes": "Preparation (cleaning, trimming, peeling). Collocation: 재료 손질, 손질하기. Takes significant time."
    },
    {
      "korean": "육수를 내다",
      "english": "to make broth; to prepare stock",
      "example": "깊은 맛을 내려면 멸치와 다시마로 육수를 내야 한다.",
      "example_en": "To bring out a deep flavor, you need to make broth with anchovies and kelp.",
      "notes": "Make broth/stock. Common: 멸치 육수, 다시마 육수. Related: 푹 우리다 (steep)."
    },
    {
      "korean": "양념장",
      "english": "seasoning sauce; marinade mixture",
      "example": "불고기 양념장은 간장, 설탕, 마늘로 만든다.",
      "example_en": "Bulgogi marinade is made with soy sauce, sugar, and garlic.",
      "notes": "Marinade or dipping sauce. Collocation: 불고기 양념장, 쌈장. Contains: 간장, 설탕, 마늘, 고추."
    },
    {
      "korean": "재료를 썰다",
      "english": "to chop/slice ingredients",
      "example": "재료를 고르게 썰어야 골고루 익는다.",
      "example_en": "Ingredients must be sliced evenly so they cook uniformly.",
      "notes": "Chop/slice ingredients. Related: 칼질, 굵기 (thickness). Tip: even cutting = uniform cooking."
    },
    {
      "korean": "불 조절",
      "english": "heat control; flame adjustment",
      "example": "요리의 성패는 불 조절에 달려 있다.",
      "example_en": "The success or failure of cooking depends on heat control.",
      "notes": "Heat management critical for cooking success. Related: 센 불, 약한 불, 중불. English: 'heat control'."
    },
    {
      "korean": "반죽",
      "english": "dough; batter",
      "example": "수제비 반죽은 충분히 치대야 쫄깃한 식감이 나온다.",
      "example_en": "Sujebi dough needs to be kneaded enough to achieve a chewy texture.",
      "notes": "Dough or batter. Related: 치대다 (knead), 치대다 (knead), 부푸는 (rise/puff). Types: 밀가루 반죽."
    },
    {
      "korean": "계량하다",
      "english": "to measure (ingredients)",
      "example": "베이킹에서는 재료를 정확히 계량해야 실패가 없다.",
      "example_en": "In baking, you must measure ingredients precisely to avoid failure.",
      "notes": "Measure ingredients precisely. Essential for baking. Related: 정확하게, 저울 (scale)."
    },
    {
      "korean": "고명",
      "english": "garnish (for Korean food)",
      "example": "잡채 위에 계란 지단을 고명으로 올렸다.",
      "example_en": "I placed sliced egg crepe as garnish on top of the japchae.",
      "notes": "Garnish topping. Common: 계란 지단 (egg crepe), 파 (green onion), 깨. Improves presentation."
    },
    {
      "korean": "간이 배다",
      "english": "for seasoning to soak in; to be well-marinated",
      "example": "하루 재워두면 양념이 충분히 배어서 맛있다.",
      "example_en": "If you let it marinate for a day, the seasoning soaks in well and it tastes great.",
      "notes": "Seasoning absorbs/soaks in. Collocation: 양념이 배다, 맛이 배다. Takes time (1 hour+)."
    }
  ]
}